package kentos.loader.Component;

import android.content.Context;
import android.content.DialogInterface;
import android.graphics.Color;
import android.graphics.drawable.ColorDrawable;
import android.graphics.drawable.GradientDrawable;
import android.os.AsyncTask;
import android.os.Handler;
import android.os.Looper;
import android.os.Process;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.TextView;
import androidx.appcompat.app.AlertDialog;
import androidx.core.app.FrameMetricsAggregator;
import androidx.core.content.ContextCompat;
import androidx.core.internal.view.SupportMenu;
import androidx.core.view.PointerIconCompat;
import androidx.core.view.ViewCompat;
import com.google.android.material.internal.ViewUtils;
import com.google.android.material.progressindicator.LinearProgressIndicator;
import java.io.File;
import java.util.Objects;
import kentos.loader.C0931R;
import net.lingala.zip4j.ZipFile;
import okhttp3.internal.http.StatusLine;
import org.lsposed.lsparanoid.Deobfuscator$$app;
import top.niunaijun.blackbox.utils.FileUtils;
/* loaded from: classes2.dex */
public class DownloadZip extends AsyncTask<String, String, String> {
    public static boolean checkdonwload;
    private final Context context;
    private AlertDialog customProgressDialog;
    private LinearProgressIndicator progressBar;

    static {
        String str = "۠ۨۢۛۥۨۘۤ۟۫ۜۖۥ۬ۥۘۡ۠ۜۢۨۤۦۛۛۤۗۚۜۖۨۘۧۙۦۘۖ۬۬ۘۙۛۛ۠ۨۦۦۥۖ۬ۤ۟ۙۨۗۜۗۢۜۦۛۤ۫ۘۘۙۥۧۗ۠ۥۘۦۜۜۘۧ۟ۘ۫ۦۥۤۚۖۦ۬۠ۚۧۛۧۘۖۘۤۛۡۘۧۚۡۗۘۚۥ۟ۖۘۨۤۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 824) ^ 177) ^ 606) ^ 377) ^ 169) ^ 782) ^ 8) ^ 31) ^ 357) ^ 215) ^ 1) ^ 656) ^ 549) ^ 726) ^ 117) ^ 444) ^ 265) ^ 108) ^ 168) ^ 426) ^ 474) ^ 287) ^ 71) ^ 137) ^ 264) ^ 49) ^ 646) ^ 401) ^ 739) ^ 594) ^ 170) ^ (-111703354)) {
                case 102661929:
                    checkdonwload = false;
                    str = "ۢۛۡۤۖۨۘۚۘۥۘۙۨۨۨۛۘۦۨۥۘ۠ۧۖۦۢۧۜۢۚۚۖۧۘ۬ۤۡ۠ۡۜۧۙ۟ۖ۫ۧۧۙۢۘۧۗ۫ۡ۠ۗ۫ۛۗۘ۠ۧ۫ۥۘۖۛۘۘۦۘۜۧۜۖۡۨۦۘۜۘۨ۠۫ۘۥۖۧ۟ۤۢۙۚۖۙ۫ۨۢۛۡ۠ۗ۫ۤۛۨۗۚۘۘۨۙۖۘۘۘۡ۟ۢۢۤۦۘۛۡۖۖۤۘۘ";
                    break;
                case 1100868666:
                    return;
            }
        }
    }

    public DownloadZip(Context context) {
        this.context = context;
    }

    private void ExecuteElf(String str) {
        try {
            Runtime.getRuntime().exec(str, (String[]) null, (File) null);
        } catch (Exception e) {
            e.printStackTrace();
        }
    }

    /* renamed from: dp */
    private static int m82dp(Context context, int i) {
        float f = 0.0f;
        String str = "۬ۖۜۘۜۧۛۙۦۗۚۚ۬۬ۖۙۙۖۦۘۦ۫ۜۘۚ۠ۥۘۙ۫ۧۡۧۡۜۦۧۘۗۙۜۘۖ۬ۙۖۨۘۧۡۜ۟ۤۡۛۦۜۘۛۚۘۡۜۢۛۤۚۘۘۘۤۤۥۜۚۜۘۧۨۨۤۙ۠ۛۙۥۘۚۖۨ۠ۢۚۘۦۖۧۜۦۘۖۧۛۦۥۧۘۦۤۥ۠ۦۡ۬ۦ۠ۥۜۘ۫ۧۡۘۨۨۡۘۖۚ۠ۙ۠۟ۦۖۘۘۛۢۛ۫۬ۨۘۤۤۘۘۧۘۥۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 461) ^ 519) ^ 556) ^ 808) ^ 440) ^ 410) ^ 259) ^ 176) ^ 70) ^ 531) ^ 47) ^ 98) ^ 480) ^ 846) ^ 774) ^ 916) ^ 904) ^ 664) ^ 578) ^ 722) ^ 798) ^ 75) ^ 242) ^ 379) ^ 442) ^ 385) ^ 197) ^ 89) ^ 328) ^ 665) ^ 339) ^ 1513866574) {
                case -1856361167:
                    str = "ۘۜۧۨ۟ۨ۫ۢ۟ۤۖۦۖۘۦ۫ۛۦۘۡۨۦۘ۫۫ۡۘۥۘۘۢۘۖۗۘۦۙۦۘ۠۬ۡۘۤۜ۟۬ۡۡۛۤۥۜۤۡۘ۟ۙۧۘ۟ۧۖۖۖۚۡۙۥۤۧۨۚ۫ۧۤۤ۠ۤ۟ۙ۬ۨۘ۟ۙۙۢۥۜۘۛۗۚۗۙۖۧۧۢۙۜۖۛۘۜۘۘۡۘۧۙ۠۫ۙ۬ۘۚۘۜۘۘ۠ۖۥۨۤ";
                    break;
                case -1524289445:
                    str = "ۨۨۖۖۙۥۤۙۘ۠ۥۘۜۙ۠۫ۥۘۘ۬ۤۖۥۜ۟ۨۦۛۗۙۘۘۛ۬ۘۙ۠ۤۧۨۖۘۨۘۧ۫۟ۜۘۤۤ۟۠ۥۢۤۢۥۘۨۥۨۖ۬ۡۗۜۘۘۜۤۖۘۥۗۥۘۛۡۘۘۤۨ۬ۖۘۨۜۛۥۘۙ۫ۗۚۧۨۙۡۗۨۖۢۤۢۢۤ۬۬ۙ۠ۡۜۥۗۢۤۗۢۧۖ۟ۥۤۢۘۘۧۤۛۧۗۛۙ۫ۖ۬ۤۜۘ۠ۘۗۤۥۘ";
                    break;
                case -66543955:
                    f = context.getResources().getDisplayMetrics().density;
                    str = "۟ۦۤۡۜۡۘۨۥۖۗۧۘۤۚۖۘۗۧۖۘۖۧۘۦۦۧۢ۟ۦۘۜۛۧۖ۫ۨۘۥۘ۬ۢۢۖۘۖ۠۬۟ۛ۟ۥۥۜۘۜۦۧۘۤۦۖۘۚ۫ۡۦۦۡۛۛۛۢۦۨ۟۫ۢۨۘۘۜۦۘۘۢۢۜۨۥۡۨۤۤۗۡۧۢۜ۬ۡۥۘۥۛ۟۫ۢۖ۟ۤۜۖۘۘۜۡۘۘۛۡۘۗ۫ۥۙ۫ۥۘۨۜ";
                    break;
                case 167353220:
                    return (int) Math.ceil(i * f);
            }
        }
    }

    /* JADX INFO: Access modifiers changed from: package-private */
    public static /* synthetic */ void lambda$showFatalErrorDialog$2(DialogInterface dialogInterface, int i) {
        String str = "ۙۢۘۥۡۘۘۨ۟۟۫ۥۥۢ۟ۙ۬ۜ۬ۖۥۖۦ۠ۛۜۨۘۧۥۦۘ۠ۨۧۦۗۥۘۦۡۛۢۧۚ۟ۜۦۘۡ۠ۤۢۧ۬ۢۛۡۘ۠ۥۤۧۖۧۘۖ۟ۧۙ۫ۨۖۢۘۘۜۜۛ۬۠ۗۥۥۚۙۤۗ۫ۚ۟ۢۥۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 77) ^ 231) ^ 909) ^ 98) ^ 609) ^ 802) ^ 240) ^ 917) ^ 173) ^ 847) ^ 67) ^ 654) ^ 128) ^ 644) ^ 895) ^ 349) ^ 367) ^ 979) ^ 40) ^ 655) ^ 624) ^ PointerIconCompat.TYPE_ZOOM_OUT) ^ 602) ^ 418) ^ 521) ^ 219) ^ 583) ^ 775) ^ 485) ^ 386) ^ 132) ^ 1239213058) {
                case -1639660228:
                    dialogInterface.dismiss();
                    str = "ۢۨۡۚۢ۬ۡۢۢۥۙ۟ۢ۟ۧۧۙۧ۬ۗۚۗۦۡۘۙۖۦۤۛۧۧۡۖۘۙۖۗۛۡ۟ۚ۟ۙۚۖۘۤۤۗۖ۠۫ۡۨۘۘۥۚۡ۬ۨۘ۬ۖۨۘۛۜۤ۠ۨۥ۠ۦۧۘۖۢ۠";
                    break;
                case -994123839:
                    return;
                case -624178268:
                    System.exit(0);
                    str = "ۡۚۨ۫ۤۖۘۤۜۗ۬ۡۧ۠ۢۚ۟ۤۛۛ۫۫ۘۖۙ۫ۜۢۙۛۨ۬۫۠ۦۗۥۚۖۤۨۘۚۙۖۛۙۧۙ۠ۗۡۤۥ۬ۨۛۖۥۤۡۤۛۦۘ۠ۘۧ۬ۦۘۗۤۥۥ۫ۛۖۚۗۦ۫ۥۘۤۧۨ۬ۡۦۘ۫ۙۚۥۖۘۘ۫ۨ۟ۙۦۧۦ۬ۡۘۛۢۡ";
                    break;
                case -536222570:
                    Process.killProcess(Process.myPid());
                    str = "ۚ۫ۨۘ۬ۙ۫ۤۚۛۧۦۧۘۘۚ۠ۚۢۛۤۤۥۖ۬ۢ۟ۢۦۘۖ۟ۛ۠ۚۥۘۛ۬۫۠ۛۜۘۜ۫۫ۙ۬۬ۢۨۦۘ۟۬۬۠ۧۥۖۨۚۗۜۢۜۜۜۘۧ۫ۜۘۥۢۢ۟ۜ۫ۖۘۢۦۧۘۨۙۥۘۘۗ۠ۥۜۧۘۛ۠ۨۢۙۡۘۘۦۖۢۦۛۗۨۖۘ۟ۦ";
                    break;
                case 182997868:
                    str = "۟ۦۦۘۥۧۨۘۖۚۥۨ۠ۛۥۗۜۘۧۛۘۘۗ۠۬ۢۙۧۖۘۤۘ۬۬ۤۛۥۧ۠ۡۥۘۨ۫۫ۨ۠ۖۜۧۧۦۘۚۗۚ۫ۤۘ۫ۨۛۢ۟ۜ۫ۛۖۘۘۡۘۗۦۦۚۛۥ۬ۤۖۙۤ۠ۗۥ۠ۤۙۢۖ۠ۘۘۡۙۧ";
                    break;
                case 1797378420:
                    str = "ۦۘۢ۟ۗۡۨۨۖۥۢ۟۬ۨۥۘ۟ۜۨۗۨۨۘۡۙۘ۬۫ۧۖۦۘ۠ۡۖۘۘۛۦۦۚۜۥۛۜۘۜ۬ۛ۟ۦ۬ۛۘۙ۟ۧۘ۟ۥۛۙۖۘۡۡۦۖ۠ۨۘۧۥۡۘ۫ۘۛۤ۬ۗ۟ۜۜۘۥ۠ۜۘۗۙ۬ۡۜۧۘۨ۠ۦۘ۟ۨۘۢ۫ۗ۬ۜۧۘ۬ۜۨۘۥۢۜۤۖۨ۟ۙۦۘۛۘ۬ۜۧۖۘۗۧ۠ۢۛۦۘۖۧۘۘۛۘۘۨۡۦ۬ۤ";
                    break;
            }
        }
    }

    /* renamed from: pw */
    private native String m81pw();

    private void showFatalErrorDialog(String str) {
        String str2 = "ۘ۫ۥۥۘۥۡۘۨۥ۟ۘۘۡۤۡۘۦۖ۟ۚۧۗ۬۠ۘۘۦۗۡۘۛۦۖۘۘۦۚ۠۫ۖۢۤۧۥۘۨۨۛۜۜۚ۫ۤۨۘ۫ۘۦۘۥۖۨۘۢۥۛۜۢ۬ۖۨۛۖ۠ۢۨۖۘۘۧۚۖ";
        AlertDialog alertDialog = null;
        AlertDialog.Builder builder = null;
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 381) ^ 150) ^ 687) ^ 589) ^ 703) ^ PointerIconCompat.TYPE_GRAB) ^ 92) ^ 428) ^ 586) ^ 329) ^ 946) ^ 264) ^ 983) ^ 479) ^ 660) ^ 564) ^ 164) ^ 538) ^ 916) ^ 606) ^ 569) ^ 540) ^ 87) ^ 109) ^ 343) ^ 359) ^ 829) ^ 442) ^ ViewUtils.EDGE_TO_EDGE_FLAGS) ^ 40) ^ 229) ^ 805407664) {
                case -1970737983:
                    alertDialog.getButton(-1).setTextColor(SupportMenu.CATEGORY_MASK);
                    str2 = "ۙ۬ۨۗۙۡۘ۠ۜ۠ۡۗۦۘ۫ۤۖۘۙۖۘۘۡ۫ۨۚۘۦۘۨ۠ۘۦۦۛۚۖۖ۠ۘۨ۬ۦۖۘۡۘۙۧۖۖۘۢۢۜۖۜۚۢۘۦۘۚۤۛۥۢۥۙۤ۠ۡۗۨۛ۟ۥۙۛۢۡۦۘۧۜۘ۫ۖۧۘۚۡۦۙۚ۬ۜ۠ۦ";
                    break;
                case -1905435197:
                    builder.setTitle(Deobfuscator$$app.getString(-3440730195800973129L));
                    str2 = "ۗۥۤ۬۟ۗۡۡۙۡ۫ۚۚۖۘ۟۟ۖۦۢ۫ۢۥۧۘۗۜۖ۟ۛۛۦ۬ۜۜۛۦۜ۫ۦۘۖۜۖۘ۟ۘۨۘۡۢۡۥۥۡۘۥ۟ۨۘۜۜۦۘۦۥۘۘۤۘۛۡۦۢۜۡۗۘۢۛۨ۠ۜۤۗۨۨۧۖۤۨۘۖۙۨ۫ۤۦ";
                    break;
                case -1777354921:
                    str2 = "ۙۙ۠ۦۡۖۜۥ۠۠ۖ۟۠۬ۜۘۥۜۦ۠ۜ۟ۛۘۧ۠۟ۦOۘۢ۫۟ۤۥۤۡۖۘۥ۠ۤۚ۬ۗ۠ۘۦۛ۟۬۬ۗۥ۫ۙۖۛۛۦۚۤۛۚۖ۫ۚۚ۬۠ۧۛ۫ۢۡ";
                    builder = new AlertDialog.Builder(this.context);
                    break;
                case -1133965090:
                    builder.setCancelable(false);
                    str2 = "ۚۚ۟۬ۘ۫ۡۙۥۡۡۦۗۧۢ۟ۡۤۢۜ۫ۙ۟ۡۗۗۖۧۧۥ۠ۙۚۚۦۥۘۚۙۜۡ۟ۨۘۛۖۗۨۦۛ۫ۡۥۤۧ۬۠۫ۢۙۘۛۗۢۜۘۗ۠ۨۘۗ۟۠ۗۨۖۘۥۦۦۘ۟ۡۧۘۡ۫ۗ۟۟ۙ۬ۨۘۗۧۥ۟ۘۚۤۖۤۗ۫ۙۘۖۡۜۙۘ";
                    break;
                case -517606903:
                    builder.setPositiveButton(Deobfuscator$$app.getString(-3440729895153262409L), new DialogInterface.OnClickListener() { // from class: kentos.loader.Component.DownloadZip$$ExternalSyntheticLambda2
                        @Override // android.content.DialogInterface.OnClickListener
                        public final void onClick(DialogInterface dialogInterface, int i) {
                            String str3 = "ۜۡۢ۫ۘۤ۠ۙۡۘ۫ۧۜۘ۠ۖۧۗ۬ۜۘۡۙۚۡۨۜ۠ۜۘۘۤۡۥۘ۠۬۬۬ۙۗۛۥۘۚۛۨۘۖۘۜ۠ۖۜۡۧۤۖۢۜۘ۠ۦۗۡۢۘۛۨۚ۠ۨ۠ۗۤۘۧۡۧۘۚۚ۬ۦۡۛ۠ۢۗۖۢۨۦ۟ۡۙۛۙۘۖۡۡۙۗ۟ۗۛۗۨ۠ۚۧۨۘۛۜ۫ۛۡ۟ۘۘۨۢۡۢۦۨۦ";
                            while (true) {
                                switch ((((((((((((((((((((((((((((((((str3.hashCode() ^ 516) ^ 20) ^ 273) ^ 383) ^ 994) ^ 863) ^ 360) ^ 447) ^ 498) ^ 830) ^ FrameMetricsAggregator.EVERY_DURATION) ^ 808) ^ 691) ^ 387) ^ 5) ^ 45) ^ 605) ^ 638) ^ 938) ^ 748) ^ 920) ^ 712) ^ 713) ^ 925) ^ 925) ^ 667) ^ 619) ^ 874) ^ 70) ^ PointerIconCompat.TYPE_TOP_LEFT_DIAGONAL_DOUBLE_ARROW) ^ 742) ^ (-1958202209)) {
                                    case -2104462915:
                                        str3 = "ۜۚۖۘ۫ۗۙ۬ۗۗ۟ۙۜۜۗ۫ۦ۬ۦۘۛۥۥ۠ۤۤۡۚۥۧ۬ۖۦۙۦ۬ۙۡۘۨۜ۬ۙۛۦۚۦۡۡۜۙۖۛۦۢۚۢۜۡۥۘۚ۠۟ۤۜۙۢ۬ۖۢ۫ۗ۫ۥۖۤ۬ۦۘ";
                                        break;
                                    case -632980007:
                                        str3 = "ۤۘۥۘۡۗۘۘ۬ۙ۫ۚۧ۠ۡ۬۠ۘۗۦۘۚ۬ۙۢ۟ۖۘ۠ۡۜۘۙۘۡۖۛۤۧۖۧ۟ۢۦۗۖۘ۬ۘۙۜۧۘۘۨۚ۟ۥۦۘ۠ۘۤۖۢۨۘۨۜۨۘۖۤۡۘۢۥۘۨۛۥۘۙۧۢۗۜۥ۠ۚۧۤۥۛۛۦ۬ۚۤۘۢۨ۠ۡ۫ۡۘ۬۫ۡ۬۬۠ۧۥ۫۫ۛۛ۠ۢۘۗۖۜۘۛۥۜۘۘۦۖۡۗۦۘ۟ۢ۟ۧۙ۫ۨۗۨۘۙۦۜ";
                                        break;
                                    case 308872022:
                                        DownloadZip.lambda$showFatalErrorDialog$2(dialogInterface, i);
                                        str3 = "۬ۖۧۘۘ۠ۙۚۥۡۧ۫ۨ۟ۗۘۘۧۛۜۘۦ۟ۥۘ۫۫ۥۘ۠ۘۡۘ۬ۗۚۗۗۜ۟ۜۦۘۜۙۤۥۚۜۘ۟۟۫ۖ۠ۚ۫ۢ۟ۜۜۥۘۥۦۧۢۦۘ۬۫ۢۙ۫ۖۧۚۤۤۗۡۘۧۙۙۖۚۤ۫۠ۛۙۡۘ۠۠ۦۢۢۥۘۜۚۗۧۤ۟ۡ۟۫ۜۢۢ۬ۜ";
                                        break;
                                    case 382778001:
                                        return;
                                    case 662980452:
                                        str3 = "ۧۤۗۙ۬ۢۜۤ۬۫ۚۨ۟ۥۚۥۨۘۢۡ۠۟ۜۗۘۨۘۖۜۦۘۢۘۚ۠ۢۥۘۖۤۦۘۥ۫ۖۘۤۧۢۡۥۡۧۨۖۖۢۥۙۦۧۜۡۗۨ۠ۤ۟ۜۜۜۦۤۛۥۜۘۜۖۧۘۖ۬ۖۦۦۘۘۚۗ۠ۜۖۚۤ۟۠";
                                        break;
                                }
                            }
                        }
                    });
                    str2 = "ۤ۟ۢ۠ۦۖۥۦۥۘ۬ۧۖۘ۠ۙۡۧۙۡۘۛۘۘۗۗۡۘۚۙ۬۠ۧۥۤۦۨ۬ۛۢۘۦۦۘۦۢۢۦۦ۟۟ۧۡۛۜۘۢۥۘۘ۠ۢۜۡۗۥۗۚۢۦ۟ۛۢۢۜ۫ۨۘ۠ۥۦۘۦۢۙۦۖۥ۬۠ۜۘۧۛۨۘۚ۬ۨۘۚۥۥۘۡۡۖۘ۠ۦ۬ۚۨۥۘ۟۟ۘۘۘۡۖۚۛۨۘۘۦۜۙۖۙۗۥۨ";
                    break;
                case -500498236:
                    alertDialog.show();
                    str2 = "ۤۜ۫۫ۡۨۘ۫ۖۘۘۥ۬ۗۨۘۢۧۤۨۘۛ۠ۧۨۨۦۘۢۧۧ۠ۨۥۘۨۨۡۘۛۗۡۙۡۧۗۜۗۗۖۚۡۥۖ۠ۡۥۘۨۢۧۛۖۡۥ۠ۚۗۗۜۜ۟۠۟ۖۥۘۙۤۛۜۜۢۗۙۡۘۥۗۡۗۡۗۛۙۡۘۖۚۚۧۧ۠ۧۛۚۧ۫ۧ۟ۘۨۘۜۗۗۗۗۙۛۦۘۚۘۗ۬ۤ۟ۖۢۨۘ";
                    break;
                case 28397283:
                    return;
                case 168114658:
                    builder.setMessage(str);
                    str2 = "ۚۦۡۛۘۦۧۗۘۘۨۦۨۘ۫ۖۖۘ۬ۜۧۖ۬ۡۘۥ۬ۛۧۧ۟ۗۜۛۘۢ۬ۗۛۜۘۜۧ۠ۧۛۧۡۥ۠۠۫ۨۘۡ۫۠ۜۗۚ۬ۗۘۘ۠ۢۦۧۛۧۘۨۢۦۧۡۘ۟ۢۗۥۗ۬ۘۤ۬ۢۖۗۛۡۗۜۚۘۨۡۨۘۗۗۘۘۦۘۨۘۥۢۧۡۧۦۘۡۢۧۖۨۖۦ۬ۙۥ۟ۨۘۥۙۤۜۧ۫";
                    break;
                case 195253350:
                    str2 = "۬ۘۦۘۛۡۦۘۜۡۗۗۙۜۘۘۚۜۘۨۢۘۘۜۗۨۘ۠ۡۘ۠ۥۦۘۛۚۗۜۡۢ۬۬۬ۗ۠ۡ۫ۦۜۘ۟ۙۦۘۦۡۨۡۚۡۘۙۗۖۗ۫ۧۢ۫ۖ۫ۘۘۚ۫ۥۘ۫ۦۧۘۤۦۦۙۙ۠";
                    break;
                case 262214730:
                    str2 = "ۢۘۧ۟۟ۛۖ۠ۗۘۦ۠۬ۛۛۦۙۘۘۦۗۦۘۦۚۗ۬ۘۚۥۡۤۗۗۚۢۡۧۘۥۖۚۨ۠۟ۚۨۦۨۜۘۛ۠ۨۘ۫ۦۖۖۗۖۖۗۗۦۡۙۘۤۙۨۛ۟ۙۨۨۘۤۜۖ۟ۘۙ۟ۗۖۘۦۘۡۨۛۛۢۖۘۜۗۜۘ۬ۤۨۘ۬ۙۚ۬ۙۦۘۗۨۧۘۢۧۗۛ۬ۖۨ۫ۜ۬ۛۡۛۜ";
                    break;
                case 1726536236:
                    alertDialog = builder.create();
                    str2 = "ۘۧۡۢۤۨۗۡۗ۟ۖۢۢۙۥۘۢۦۜ۬۟ۢۖ۬ۡۦۨۗۛ۟ۥۘ۫ۚۜۘۚ۬ۛۢۘۚۙۦۗۗۡۢۗ۟ۢۦ۬۠ۙۗۡۦۘۗۜۧۘۥۚۘۘۤ۠۠۟ۧۢۡ۠۠۠ۙۖۘ";
                    break;
            }
        }
    }

    private boolean zip4j(String str, String str2, String str3) {
        try {
            new ZipFile(str, str3.toCharArray()).extractAll(str2);
            return true;
        } catch (Exception e) {
            e.printStackTrace();
            return false;
        }
    }

    void deleteRecursive(File file) {
        File[] fileArr = null;
        String str = "ۧ۟۫۬ۡۨۛۤ۫۟۟ۖۦۧۤۡۦۜۡۢۡۘۡۨۜۘۚۚۥ۬ۜۤۦ۠ۖ۟۬ۥۛۤۤۤۘۘۗۦۡۜۘۘۘۧۜ۫ۧۨ۟ۨۛۗۚۚۢۜۙۚ۟ۥۘۦ۬ۤ۫۫۟ۗۜۡۘۖۢۡۘۙۘۥۘۙۧۦۘۖۛۡ۟۬ۨۛۧۡۤۨ۟ۥۜۜۘۗۗۖۖۗۦۘ۬ۥۦۘۚۖۜۘۧۥۦۙ۟ۨۡۤۡۜ۠۠۫ۥ۬ۥۦۘۖۥۧۘ۬۬ۡ";
        int i = 0;
        int i2 = 0;
        int i3 = 0;
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 919) ^ 58) ^ 742) ^ 891) ^ 770) ^ 33) ^ 675) ^ 644) ^ 679) ^ 69) ^ 713) ^ 821) ^ 860) ^ 359) ^ 805) ^ 420) ^ 848) ^ 857) ^ 444) ^ 187) ^ 581) ^ 588) ^ 551) ^ 823) ^ 521) ^ 458) ^ 219) ^ 680) ^ 631) ^ 907) ^ 323) ^ 184476066) {
                case -2110540721:
                    return;
                case -1997944287:
                    String str2 = "ۨۖۥۘۜۜۖۜۨۢۛۗۨۘۡۨۙۙ۠ۢ۬ۨۚۡۤۘۙ۫ۙۨۘۛۙ۫ۙۤ۟ۨۙۥۘۖ۬ۦۘۢ۫ۤۙۧۡۘۘ۫ۤۧۡۥۘۜۛۜ۟ۖۡۘۡ۟ۦۘۤۖۙۖۤۛۚۦۧ۬ۦۗ";
                    while (true) {
                        switch (str2.hashCode() ^ 1365348455) {
                            case 379732066:
                                break;
                            case 567118703:
                                String str3 = "ۤۙۖۨ۠ۚ۫ۗۙۗ۠ۛۜۜۥۘ۬ۖۧۘۙۨۜ۬۫ۡۜۖۜۚۧۜ۬۟ۤ۫ۗۘۘۢۤۜۚۛۤۜۚۘۘۖۧۘۘۡۚۨۘۙۦۡۘۘۤ۠ۡۖۜۛۤۗۧۖۘۛۛ۟ۗ۫۬ۜۧۗۥۜۧۘ۬ۙۜۘۥۤۤۧ۠ۨۜۖۛۧ۫ۛ۟ۥۖۖۥۙۨۦۜۦۗۧۨۚ۬ۙۨۘۘۥۖۘ۟ۛۧۚۧۡۘۧۛۨۘۜ۫ۘۡۜۘۦ۬ۥۘۧۚۛ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-1140707940)) {
                                        case 21987021:
                                            str2 = "ۚ۟ۘۚۘۤۖۦۙۦۚۜۘ۟ۦۦۤ۠ۡۨۤ۫ۘۛۖۚۥۢۛۤۜۘۨۦۚۘ۫ۨۤۜۘۚۗ۫ۛۜۧۘۨۧۡۘۧۡۧۘۡ۫ۡۘۚۦۤۗۨۡۧۜۘۗ۠ۦۜۥ۬ۚۢۚۘۧۘۘ۫ۦۛۙ۫ۦۤۜۘۡۛ۬ۥۤۢۤ۟ۜۘۥ۫ۥ۬۠۬ۢۗۢۢۡۘ";
                                            break;
                                        case 1208387754:
                                            str3 = "۠ۨۥۘ۠ۡۧۘۜۧۤۥۜۘۧۖۧۘۘۨۢ۠ۡۜۘۤۨۘ۠ۦۤۢۤ۬ۖۥ۟ۨۧ۠ۚ۠ۨۘۥۘۜۡ۟ۖۡۡۥۦۘۜۧ۟ۙۧ۫ۥۖۗۤۜۡۘۖۚ۟ۗۙۜۘۖۤۚۤ۟ۦۘ";
                                        case 1306833758:
                                            String str4 = "ۚ۟ۤۗۨۜۦ۟ۜۡۤۛۘ۠ۡۘ۬ۗۚۗۨۡۧۧۙۦۖۤۚۥۘ۟ۢۥۖ۟ۦۤۤۜۦ۬ۤۜۙۚۗ۫ۨۘۘۤۧۦ۠ۚۙۢۡ۫ۦۖۘ۟۠ۛ۠ۖۡۘۘ۠ۦۘۡۧۛۙۡۧۜۨۨۘۡۚ۟ۗۨ۬ۥۤۥ۬ۡۧ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 640739930) {
                                                    case -1190729940:
                                                        str3 = "۠ۦۘۘۤۦۨۥۦۧۘۤۘ۫ۜۜ۫ۛۘۦۖۜ۟ۜۨۖۘۜۢۧۗ۬۟ۦ۟ۥۘۢۦۦ۬ۢۖۦۜۘۤۤۖۘۖۜۛۜۗۢۘۤۨۘۦۥۜ۠ۖۨۘ۬ۘۖۤۡۥ۠ۡۡۛ۬ۥۘۚۤۦۘۤۜ۬ۖۘۖۘۤ۫ۜۘۗۛۜۘۜۢۖۘۢۦۜۚۜۥۛۙۨۘۚ۫ۘ۬ۙۥ";
                                                        break;
                                                    case -592238065:
                                                        str3 = "ۢۜۜۚۡۘۚۥۖۘۧۗۤۛۨۛۚۘۨ۬ۢۡۘۤۡ۟ۜ۫ۥۖۘ۟ۡۘۘ۬ۥۦ۟۬ۘۘۛۥۘۘۦ۫۠ۙۜۚۨۗ۠ۢۡۘۖۥۘۢۛۗۥۙۨۘۡۡۡۘۙۜۜۛۙۡۘۙۧۘۘ۠ۧۥۥۧ۫ۖۘۘۚۥ۠ۢ۟ۚۖۛۦۢ۫ۘۨۖۛۤۗۨۘۖۥۘۤۜۢۚ۠ۤ۬۟ۢۦۖۘ۫ۨۖۧۖۨۘ۠ۨۦۗۤ۟۟۠ۘۤۥ";
                                                        break;
                                                    case -381355872:
                                                        str4 = "ۥۦۧۘۛۜۜۘۡۨ۠ۚ۫ۗ۟ۤۚۨۧۢۖۤۖۘ۬ۙۨۘۧۡ۠۟ۜۘۚ۫ۨۙ۠ۘ۟۠ۘۘ۫۬ۖ۟ۡۘۜۦۜۡۧۥۘۧۡۡۘۘۖۛۘۛۖۘۙ۠ۜۥ۠ۤۢۘۘۢۗۥۜۚۤۨۢۗۢۚۤۗۖۜۘۥ۫۫ۥۥۨۘ";
                                                    case -114292143:
                                                        String str5 = "ۥۚۦ۟ۥۖۘۢۧۙۢۙۡۡ۫ۘۦۤۨۛۙۨۘۖ۟ۡۙ۫ۥۘۧۢۥۘۖۘۘۨۢۗۘۖۧۘۦۧۦۘۙۗۧۙ۬ۛۖ۬ۘۘۖۘۢۜۤۖۖۛۖۡۡۚۘۨۘۚۦ۟ۗۨۦۘۙۨۢۢ۫۫ۡۨۘۤۤۖ۬ۙۛۧۗ۬ۦۘۧۡۧۘۨۖۢۡۗۘۢۖۘۙۨۜ۠۫۠ۗۘۡۘۧ۬۫۬ۜۨۗۖۜۤۖۡۤۘ۟ۗۛۧۛۖۜۘ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ 1873840106) {
                                                                case -1950521121:
                                                                    String str6 = "ۧۙۘۧ۬ۦۨۡۦۘ۬ۖۨۘۡ۬ۥ۠ۖۘۜ۫ۢۛۡ۠ۡۗۖۘ۠ۨۖۘ۟ۖۧۘۤۖ۠ۖۡۘۗۥۘۧۨۖۦۡۡۘۡۙۚ۟ۥ۬ۙۚۘۖۤۖ۫۠ۗۨۜۛۙۛ۬۬ۨۡۘۥۘۗۥۦۘ۠۟ۨۘۥۧۤ۫۫ۡۘۡۨۨۛۢۢۛۘۤۛ۠ۖ۫ۥ۫۫ۨ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ (-860895283)) {
                                                                            case -1856233172:
                                                                                str6 = i2 < i3 ? "۫ۥۤ۫ۚ۠ۜۧۖۘ۬ۦۦ۬ۛۚۦ۠ۜۘ۠ۤۘۘۜۢۢۘ۬ۢ۫ۨۖۘۛۜۖ۬ۦ۬ۜ۬ۥۗۦۜۘۡۧۤۦۤۜۥ۠ۧۡۧۖۢۜۥۘۚۡ۟ۗۖۡۘۦ۠ۥۘۧۨۗۖۙۢۨۖۘ" : "ۤۗۜۘۧۜۦۘۜۧۖۘۥۨۧۘۚ۟ۙۚۢۖ۬ۙۜۖۦۜۘۦ۬ۖۘۚۖۗۗ۠ۗۙۜۘۘۤۡ۫ۧۥۜۢۤۜۛۗۥۘ۟ۡۢ۫ۗۙ۟ۖۥۘۦ۠ۦۘۥۛۧ۬ۡۡ۠ۢ۫ۜۤۢۖۙ۬۫ۨۥ۬ۜۥۘ۫ۡۧۘ۠۫ۜۗۘۜ";
                                                                            case -308372342:
                                                                                str5 = "ۜۜۡۘ۬۬ۥۛۜۧۨۨۚۗ۠ۘۡۧۘۗۢۧۖۙۡۘۧۢۖۘۤۖ۟ۧۡۗۤۚۙۥ۫ۗۙ۠ۨ۠۬ۨۧۚ۬ۨۗ۬ۚۧۧۘۛۦۥ۟ۜۘۢ۫ۡۘ۠ۢ۫ۢۦۘۘۖۛۢۦۥۘ۬۬ۚۙ۬ۥۥۖۜۦۗۡۘۖۙۧۖۦۙۜۤۚۦ۠ۨۥۜ۬ۛۗۨ";
                                                                                break;
                                                                            case 33911729:
                                                                                str6 = "ۧۖ۬ۗ۠ۡ۫ۧۤۛۘ۠ۜۧۧۙۤۖۜۧۘۤۥۧۘۘ۟ۚۜۛۡۘۚۖۧۘۧۡۤۗۥۨۘۗ۠ۜ۠ۤۥۖۜ۟ۦۙۜۘۦۦۦ۟ۨ۬۫ۛۖۘۥ۠ۘۘۖۧ۫ۛۨۘۤۖ۟ۖ۠ۤ۠ۥۦۘۥۜۧۘۤۦۥۘۢ۫ۘۘ۠ۧۡ";
                                                                            case 1243266366:
                                                                                str5 = "ۖۗۖۘۚۨۜۦۨۘۘۤۡۢۡۤۘۧۙۜۚۧۜ۬۠۠ۤۥۘۛۤۜۘۛۤ۬۠ۢۘۥۦۖۘ۟۫ۙۖۢۘۘۦۧۥ۫۟۟ۥۛۜۗۙۤۧ۠ۚۛۖۘۙ۫ۦۘۡ۬۬ۙۤۨۘ۬ۢۥۘ۫ۙۡۘۛۙۗ۟۠ۡۦ۟ۥ۟ۨۗ۫ۡ۫۟ۗۖۘۙۡۘۡۥۨۨۙۘ";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case -1162860642:
                                                                    str5 = "ۥۡۖۘۙۙۤۧۥۥۚ۠ۡۘۘۦۘۘۧۚ۠۬۠ۥ۠ۙ۬ۛ۟۟ۢۘۦۗۦۦۨۥۘۡۖۘۘۥ۟ۦۘ۫ۢۥۢ۬۫ۤ۠ۥۘۙۚۖۥۦۛۙ۬ۦ۠ۖۚۛ۟ۖۧ۫ۘۘۗۗۡۨ۠ۦۘۚۤۜ۫ۜۧۘۙۧۥۛ۫ۧۦۗۙ۟ۢۨ۠۟۠ۜۢۨ۠ۛۦ۟ۘۧۚۗۡ۟ۜۚۜۘۗۖۘ۫ۦ۟ۘۨۡۗۢۧۗۗۨ۟۫ۜۜۡۘ";
                                                                case 170729439:
                                                                    str4 = "ۢۤۖ۠۟ۗۖۧ۬۟۟۟ۡۦ۟۬ۥ۟ۦ۟۫۟ۚۥۘۘۡۙ۫ۚ۫ۗۤ۟ۢۦۖۦ۟ۗۗۤۦۡۗۡۘۢۛ۠ۤۗۤ۫ۡۘۥۚ۟۠ۙۥ۠۟ۤ۟ۢۜ۠۠ۘ۠ۤۘۥۙۦۧۜۖۤۡۡۢۨۘۤۨۛ۫۬ۤۡ۬۬۫ۗۦۖۖۥۙ۟ۜۘۘۗۨۘۚۛۛۡۢۡۘۙۜۜ۬ۚۘ۠ۦۖۗۘۨۘۛ۠۠ۗۙۦۗ۟ۨۘ۬ۛۖۘ";
                                                                    break;
                                                                case 1194270889:
                                                                    str4 = "ۢۗۥۘۥۘۦ۫ۡۥۘ۬ۦۘ۟۫ۙۛۨۘۢۥۦۘۡۘۖۖۢۚۚۦۢ۬۟ۜۤۖ۠ۧۜۘ۬ۨ۬۟۫ۡۘۙ۟۟ۖ۠ۨۘۡۜۖۘۚ۫ۨۚۧۡ۬۠ۡۚ۫ۢۤۨۘۧۘ۟ۢۘۨۘۖۧۜۢۖۨۘۥۙۛۙۙۖۤۨۜ۠ۥۨۘۨ۠ۚۤۛۘ۠ۙۖۨۡۢ۫ۤ۫۫۠۫ۡۢۧ۫ۙۙۦۜۡ";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                }
                                            }
                                            break;
                                        case 2106758127:
                                            str2 = "ۢۛۖۥۥۧۙۤۥۘ۟ۜۙۦۤۨ۫۟ۘۘۛۧۘۘۚۘۗ۫ۘۡۢۥۘۙۥۚۗۢۘۗ۫۬ۢۚۜۧۦۘۘ۬۟ۖۤۜۘۡۖۖۘۥۤۦۗۦۘ۠ۦۖۨۖ۫۟ۤۛ۫ۡ۠";
                                            break;
                                    }
                                }
                                break;
                            case 785207052:
                                str = "ۨۚۨۨ۠ۖۘۥۤۡۗۧۡۘۙۧۦۘ۬ۥۡۚ۫ۖۘۖ۬۫ۙۜۘ۟ۢۢۨۛۦۛ۬ۢۗۚۘۘۙۢۨۘ۬۫ۥۢۚۨ۠۫ۤۢ۟ۖۘۚ۟ۚۧۦۘۘۥۜۗۧۜۦۙ۫ۧۙ۫ۡۛ۟ۜۙۖۨۧۥۘۘۚۜۢ۬ۦۘ۠ۥۧۤ۠ۤ۬۫ۧۚۗۖۤ۫ۡۗ۬۬";
                                continue;
                            case 1094158693:
                                str2 = "ۢۗ۫ۧۚۢۦۦۘۥۘ۫ۙۦۙۛۥۖۘۗ۠ۨۚۖۘ۫ۦۨۘۜۥۛۨۚ۟۬ۖۥۡۢۜۘۘ۟ۤ۬۟ۧ۫ۜۘۜۘۦۛ۟ۤ۫۫ۙۧۜ۫ۢۛۤۚۥۘۙۥۗۧۡۖۘۖ۫ۢۤۙۜۘۛۘۚ۬ۤۧ۬ۖۦۘۡۤۢ";
                        }
                    }
                    break;
                case -1424822034:
                    str = "ۖۥۥۗۦۡۘۘۤۥۚ۟ۚۨۦ۟ۛ۬ۡۘۨ۬ۢۛۤۜۜ۠ۗۛۘۘۤ۠ۛۘۦۛۥ۬ۛ۟ۨۦۘۤۜ۠۫ۡۨ۬۬ۚۛۚۤۥ۫ۡۘۙ۠ۚۥۛۡ۟۬ۡۜۚۡۘۥ۟ۘۘۚۦۢۚ۟ۦۘۤۗۦۗۛۡۘۛۡۥ۠ۨۤۤۢ۠ۜۗۘ۬۠ۚۢۡۗ۫ۜۖۦ۟ۘۨۥ۟ۛ۬۠ۖۘۘۨۙۡ";
                    continue;
                case -780861708:
                    str = "ۧۤ۠ۚ۠ۦۤۗۖۙۚۛۜۜۘۧ۟ۖۜۢۨۢۖۖۘ۫ۛۥۘۙۙۖ۫ۦۦۘۤ۬ۛۚ۟ۚ۠ۦۦۦۘۘۡ۟ۥۘۨ۠ۛۥۙۚۗۢۡۘ۫۟ۘۗ۟۫ۖۧۘۖۤۥۘۢ۬ۗ۠ۡۦۜۨۥۢۡۗۨ۠ۘ۟۬ۡۧۥۘۙۥۗۢۨۦۜۢۦۘۗ۫۟ۨ۫ۘ۠ۦۤ۟ۦۗۦ۠ۢۛۚۨۘۘۧۡۘۢ۟ۦۘۚۨۖۤ۠ۘۘ۠ۧۨ۟۬ۗ";
                    fileArr = (File[]) Objects.requireNonNull(file.listFiles());
                    continue;
                case -520279089:
                    str = "ۨ۫ۗۜۜۘۖ۬ۨۨ۟۟ۦۖۡ۫ۦۖ۫ۢۤۜۘۘۨۚ۬ۗۙۨ۟۬۟ۡۗۨۘۛۦۖۗۧۦۘۛۚۜ۠ۚۦۢۧۢ۬ۥۖۘ۫ۖۙۘۨۡۧۨۖۘۢۖۡۘ۫ۜۗۘۚ۫۟ۛۜۘۤۡۙۢۗۨۘ۟۠ۤ۟ۖۚ۠۟ۥ۠ۚ۬ۛۧۦۘۚۧۛۧۦۜۗۛۨ";
                    continue;
                case -486324541:
                    str = "۬ۗ۟ۚۘۥۡۨۘۛۦ۟۬ۨۥۥۤۤۡۡۥۚۥۡۚ۬ۖۙۤ۫ۡ۠ۚۖۨۙ۬ۢ۫ۡ۠ۘۘۦۡۛۚ۬ۦۗۧۧ۫ۥۖۘۚۧۨۘ۬ۚۜۘۢ۠۟۫ۦۗ۟ۘۜۙۡۘۘ۠۟ۥۘۢۨۘ۫ۦۗۚۘۢۖۙ۟۬ۗۗ";
                    i2 = i;
                    continue;
                case -267297376:
                    file.delete();
                    str = "۟ۡ۠ۦۚۥۡۙۙۜۚۨۘۛۥۘۘۜۥۙۛۖ۬ۛۡ۠ۦۢ۟ۛ۠ۚۤۦۜۧۨۘ۬ۗۘۘ۠ۡۦۜۦۚۘۖۚۦۗۧۙ۟ۦۘۗ۠ۢۥۤ۫ۢ۠ۦ۠ۡۘۘ۬۬۠ۤ۬ۙۦۚۜۙۜۡۡۦۙۡ۟۟ۙ۫ۥۘ";
                    continue;
                case -127703804:
                    str = "ۨ۫ۗۜۜۘۖ۬ۨۨ۟۟ۦۖۡ۫ۦۖ۫ۢۤۜۘۘۨۚ۬ۗۙۨ۟۬۟ۡۗۨۘۛۦۖۗۧۦۘۛۚۜ۠ۚۦۢۧۢ۬ۥۖۘ۫ۖۙۘۨۡۧۨۖۘۢۖۡۘ۫ۜۗۘۚ۫۟ۛۜۘۤۡۙۢۗۨۘ۟۠ۤ۟ۖۚ۠۟ۥ۠ۚ۬ۛۧۦۘۚۧۛۧۦۜۗۛۨ";
                    i2 = 0;
                    continue;
                case 18588545:
                    deleteRecursive(fileArr[i2]);
                    str = "ۧۡۚ۠ۖ۫ۤۦۘۚۚۧ۟ۚ۟ۦۚۨۘۢۖۧۘ۬ۡ۠ۨۘۧۘ۟ۤۡۡۛۘ۫۟ۢۦۧۨۗۖۤۥ۫۠ۘۗۙ۠ۡۧۜۡۡۖۙۜۚۥ۬ۤ۫۬ۗۢۡۘۜۙ۫۫ۖۚۧۡۘۘۜۤۖۘۗ۫ۡۨۤۧۨۖ۠ۤۤۡۘۨۙۜۘۙۘۘۘ۟ۨۘۘۚۨۙۤۦۨ";
                    continue;
                case 890369845:
                    str = "ۛۨۘۘ۟۟ۛ۫ۥ۠ۨۛۤۖ۠ۘۙۗۖۘۖ۬۟ۨ۠ۤ۟ۛۘۘۗۙۜۖۚۦۥ۫ۦ۠ۧۙ۟ۢۨۗۡۤ۫ۤۘۙۙۗۧۥۘۗۡۤۢۦۡۡۧۖۛۦ۫ۜ۠۟ۙۘۥۥۖ";
                    continue;
                case 1484048952:
                    i = i2 + 1;
                    str = "۠ۡۢۢۥۨۖۖۦۘۢۙۨۜۨۙ۬ۘۚۚۥۡۜۘۘۤۤ۠ۚۧۗۧۙۧۥۤۚ۫ۘۥۖۘۦ۟ۜۗ۠ۚ۟ۧۧۧۗۚ۟ۡۤۨۤۥۚۨۘۘۜۘۘۤۘۡۘۖۘۧۘۛۥۤۢۘۛۧۜۘۚۙۖۗۘۡۘۜۨۖۘ";
                    continue;
                case 2039834744:
                    String str7 = "۫ۛۚۘۗۗۦ۠ۜۖ۬ۡۘۜۦ۠۟ۧۧۛۖۥۘۥ۟ۡۘۧۧ۬ۘۢۧۚۖۛۦۖۥۧ۟ۢ۬ۜۜۥۨۘ۟۫ۤۖ۬۠ۨ۠۫ۢۖۦۘۘۥۗ۫ۗۥۢۜۚۢ۟۠ۗۗۢۥ۫ۜۘۙۘۘۖۥ۠ۛۙ۟۫۫۬ۛۙ۫ۖ۬ۧۢۛۜۥۘۢۢۥۡۖ۠ۦۘ۬ۢ۫ۢۘۚۚ۬ۨ۟ۦۡۘۖۗۡۨ۫ۦۥۧۜۘۥ۫ۨۜۦۤۜۗ۟";
                    while (true) {
                        switch (str7.hashCode() ^ 595303290) {
                            case -1493186912:
                                str7 = "ۧۖۧۘۘۨۡۘۗۛۨۘۘۥۖۘۡ۬ۨۘۢۥۗ۬ۨۡۘ۟ۘۦۛۨۙۙۤۜۘۡۤۧۚ۫ۤۙۧۥۨۧۜۘۗۗۗۗۘۘۡۢۚۗۙۖۙۙ۫ۗۙۛۥۚۦۖۢۡۘۛۢۦۘۚۢۤۡۛۜۘۥ۫۠ۥۦۧ۟۫ۚ۠۬ۤۡ۬۫۫ۜۖۘۙۚۖۥۜۥۘۛۤۥۥۘۙۥ۬ۨۥۛۥۜۙۘۧ۬ۨۘ";
                            case -1304073915:
                                String str8 = "ۛۡۛ۫ۘۡ۫ۥۦۖ۟ۡۜۗ۠ۗۨۘۡۗۜۘۢ۫۠ۘۦۨۘۢۥۦ۟ۜ۠ۦۥۢ۟ۚۦۘۤۘۘ۟۟ۚۤۧۢۨۙۤ۬ۤۨۘ۟ۤۨۘۗۘۘ۟ۙۢۥ۬ۜۙ۠ۙۡۘۛۛۢۨۘۖۥ۠۟ۧ۠ۧ۠ۨۘ۟۬ۖ۬۠۠۫ۜۥۗۦ۬ۦۢۗۛۗۨۢۖۜۘۧۛۨۡۗۜۗۦۡۗۨۖۘۜۨۜۘۥۨۨۥۜۥۘ۠ۢۦۘۨ۟ۘۘۚۨ۠";
                                while (true) {
                                    switch (str8.hashCode() ^ 1565244226) {
                                        case -773490807:
                                            str7 = "ۛۥۢۖ۬ۜۘۚ۬ۗۚ۠ۧۤۤۜۖۗۗۧۜۛۚ۬ۜ۠ۡۜۥ۠ۤۛۛۨۢۜۙۥ۫ۨۛۨۧۘ۫ۥۥ۬ۗۨۘ۠ۦۘۘۘۥۦۥ۠ۦ۬ۖۘۨۗۨۤۥۖۘ۫ۛۧۦۢۚ۬۠ۨۤۘۖۘۜ۟۠۫۠ۡۨۖۥ۬ۧ۫ۙۤۙۦۧۡ۟ۖۚۗ۠ۥۤ۟ۖ";
                                            break;
                                        case 144992474:
                                            str7 = "ۨ۟۬ۨۤۨۡۗۨۖۖ۫ۨۤۡۘ۠ۥۖۘۚۦۨۘ۠ۛۨۘۦۧ۬ۖۧۜۘۛۜ۠ۦۢ۟ۡۖۘۡۡۤۘۤۧۚ۬ۚۘۦۘ۠ۤۥۡۘۡۜۨ۟ۡۥۘۘۜۥۘۘۖۢۡۥۘۡۘۤۗ۫ۢۛۨۘۙۗۦۘۡۢۢۖۡۡۘۜۢۙۥۦۖۘۚ۟ۦۧ۠ۜۘۢۗۨۘۤۨۥۡۛۘۘ۫ۘۨۘۤۙ۟ۨۤۨۘۤۖۡ";
                                            break;
                                        case 463411912:
                                            String str9 = "ۧ۫۫ۥ۬ۥۚۘۗۜۛۥۚ۠ۖۘۘۤۡۘۚۧۜۘ۬۫۫ۤۤۨۘۥۜۡ۠۫۫ۦۨۧۨۙۙ۬ۗۦۡۗ۬ۗۙۨۘۚۤ۬ۥۜ۫ۡ۠ۜۧۡۧۚۡۚۙۧۛ۬۬ۨۘۘۧۧۡ۟ۥۜ۟ۥۦۡ۠ۘۤۤۢۧۙۚۡۙۧۚۢ۬ۦۜۡۘۨۡۖ۠۬ۡۡۢۧۚۡۘۥۢۘۘ۠۬ۛۡۗۙ";
                                            while (true) {
                                                switch (str9.hashCode() ^ 445447868) {
                                                    case -922273713:
                                                        str8 = "ۧۥۧۡ۬ۦۖ۫ۥۘۜ۫ۖۘۖۘۦۚۧۙ۠ۛۧۧۡۛۥۛۜۗۢۖۙۢۜۜ۫ۥۘۗۥۘۘۦۗ۬ۘۡۘۘۙۥۡۘۦۧۘۨۨۡۜ۬ۘۦۖۧۢۧۜۘ۫ۙۗۗۜۧۘۡۚ۟ۛ۟۟ۤۥۢۢ۬ۡۘۧۨۦۚ۟ۖۘ۠۫ۛۖۖۘۘۙۜۢ۬ۙۛۢۢ۫ۛۡۡ۬ۨۤۡۜۤۢ۬ۙۚۗۗ۟۬۬ۜۘۘۖ۫ۜۘ۫ۢۨۖ۫ۜۘ۫۠ۡۘ";
                                                        break;
                                                    case -420458361:
                                                        str9 = "ۚ۬ۥۚ۟ۘ۬ۧۧۚۦۧۘۧۡ۬ۘۧۧۙۙۖ۬۫ۨۡۙۤ۬۠۟ۧۜۘۚۡۘۘ۬۫۫۟ۤ۫ۨۗۚۡ۫ۙۗۥۢۙۙۦۜۤۘۘۗۘۗ۫ۘۢۧۨۦۘۚ۟ۢۘۖ۟۟ۙۚ۠ۚۖۘۤ۬ۥۖۥۗۧۛۢۤۘ";
                                                    case 1016548622:
                                                        str8 = "ۡ۬ۖۘۢۘ۬ۖۥۦۘۘۥۢۛ۟ۢۗۘۖۘۙۙۛ۟ۙۖۘۨ۟۫ۖ۟۟۬ۢۚۖۘۢۦۢۨۘ۬ۨۘۘۦۜ۠۬۠ۦ۫ۗۤۥۛۚۘۧ۠ۜۤۥۛۗۗ۟ۗۙۨۘۙ۠ۦ۫ۨۥۘۢ۠ۘۘۤۤۡ۠ۤۛۤۥۥۧۖ۟ۧۙ۟ۖۙۧۥۥۛ۫ۙۤۜۦۘ";
                                                        break;
                                                    case 2019550608:
                                                        String str10 = "ۜۖۚۜۗۙ۫ۖۦۜ۠ۡ۠۠ۖۘۖۖۥۦۛۡۘۛۙۛۚۘۦۘۛ۬ۡۘۖ۟ۚۙۗۨۜ۫ۡ۠ۨۨۙۖۚۢ۬ۙۤۨۘۦۜۥۘ۫ۡ۠۟ۘۥۘۧۛ۬۬ۗۧۙۘۖۛۥۛۙۡۥۢ۠ۜۡ۠ۛۙۗۘۥۘ";
                                                        while (true) {
                                                            switch (str10.hashCode() ^ (-1427490363)) {
                                                                case -1686208566:
                                                                    str9 = "۠۠ۥۘۘۗۖ۟ۛۚۖۙۨۘ۫۫ۜۘۜۙۥۛۡۚۘ۫۬ۛۡۛ۫ۘۨۘۖۘ۫ۤۡ۠ۗۖۘۙۗۥۘۜۢۘۡ۬ۜۖ۠ۚۡۦۘۥ۬ۘۘۧۥۦۦۥۘۥ۬ۘۛ۬۫ۢۦۢۤ۫ۜۘ۬ۖۜۘۢۡۥۘ۟ۤۡۘۛ۠ۗۢۘۡۢ۟ۘۘ۠ۚۘۖۘۦۘ۬ۚۜۦۘۜۘ۟ۙۦۘۙۨۙ۬۠ۨۘۢۙ۬ۧ۬ۛ";
                                                                    break;
                                                                case -1059330573:
                                                                    str10 = "ۨۘۘۘۢۨۦۘۖۚ۟۬ۖۦۙۤ۠۫۠۬ۘۥۜۘ۟ۥۧۘ۫ۚۨۙ۫ۗۖۚۤ۟ۙۥۘۗۨۨۘۘ۟ۛۦ۟ۤ۫۬۫ۦۖۘۘ۟ۙۚ۬ۨۡۘۢۜۡ۫ۨ۟ۘۡ۫ۧۢۤۗۛۧ۬ۥۥ۫ۙۜ۬ۡۘۘ۫ۚۛۚۚۨۦۚۡۘۨ۠ۗۛۤۚۧۤۦۘۙۚۛ۬ۢۥۘۧۢۥۘۤۢۨۤۤ۬ۥۤۢ۬ۤ";
                                                                case -749842515:
                                                                    String str11 = "۟۫ۦۘ۠ۗۨۘۨۖۘۘۖۤۦ۠ۥۘۘۤ۟ۘۘ۫ۗۨۨۤۡۧۨۚۚۡۡۘۧۧۘۢۥۚۛۥۛۨۜۧۙۚۛۤۙۡۘ۟ۤۗۜۜۚۛۙۜۘ۫ۤۤۦ۟ۡۘۧۛۧ۠۟ۜۧۜۗ۟ۗۢ۟ۖۧ۟ۥۨۘۨۗۙۜۢ۫ۛۨۡۙۢۨۤ۫۬ۢۗۖۘۚۧۗ۠ۨۘۘ۬۬ۘۘۤۘۦ۬ۘۚۛۢۦۘۧ۫ۢ";
                                                                    while (true) {
                                                                        switch (str11.hashCode() ^ (-1335078569)) {
                                                                            case -3883704:
                                                                                str10 = "ۦۢۡۥۗۡۘۢۡۘۘۚۦۡۘۘ۫ۖۘۘ۠ۨ۟ۜۙۡۡۧۥۘۦۘۤ۠۟ۜۧۡ۠۫ۥ۬ۛۖ۟ۛۙۗۡۨۚۥۛۧۚۥۚۚۜۚۙۤۤۧ۟ۘۥۤۨۘۨ۬۟ۖۙۡۥ۬ۦۢۚۘۚۨۧۘ۬ۖۡۘ۠ۢۥ۬ۡۦۘۥۦۘۚۜۡۛۛۨۘ۟ۦ۫۟ۤۜ";
                                                                                break;
                                                                            case 134767018:
                                                                                str11 = "ۨ۬ۦۙۙۘۘ۫ۗۚۡۛۜۘۥۛۖۗۢۚۤۦۨ۫۫ۗۧۦۜۘۛۨۤ۫ۖۜۘۨۧۧۙۥۘۧ۬ۘۘۨۜۥۘۨۥۦۘۨۛ۬۬ۢۦۘۙۘۧ۠۫۠ۧ۠ۜۘ۠ۛۤۥ۟ۚۥۥ۫ۙۧ۠ۙۗۦۧۡۡۥۙۡۨۖۘۨۨ۠ۛ۟ۤ۠ۚۛ۠ۦۨۘۦۜ۫ۤ۟ۘۘۥۛۜۧ۫۟ۤۧۡۙۢۤ۟ۛۙۜۚۛۛۗۖۘۥۛۘۢۢۡۜۢ۬";
                                                                            case 1442928150:
                                                                                str10 = "ۧ۬ۨۘۜۘۧ۠ۥۥۖۥۖۧۘۧۛۦۦۧۜۛۗۧۜۦۤۦۦۜۘ۬۫ۖۘۙۡۖۘۖۨۜۘۥ۬ۙۗ۬ۦ۬۟ۨۘۛ۫۫۬۬ۜ۟ۧۘۨۤۡۘ۬ۡۨۨۨۜۨۥۘۘۘ۟ۖۚ۫۫";
                                                                                break;
                                                                            case 1674902657:
                                                                                str11 = file.isDirectory() ? "ۜۨۥ۟ۧ۟ۙۘۧۘۘۨۘۘۡ۠ۛۢ۬ۤ۠ۛۧۡۗۘۘۖۗۤۨۧۙۡۧۚۤۚۡۘ۫ۥۦۥۙ۠ۥۗۗ۠۬ۡۘۤ۬ۙ۫ۥۚۖۦۧۘۛۥۧۘۢۥ۟ۦۨۦۖۚۤۤۗۙۢۨۙۘۧۦۘۤۢۜۖۜ۬ۢ۟ۘ۟ۜۡۘۤ۠ۙۤ۠ۡۨۢۥ۬ۦۢۥ۠ۧۚۗۚۥۘۜۛ۬ۨۘ۟ۦۦۘ" : "ۡۖۜۚۡۦ۟ۚۨۥۥۚۗۨۘۡ۫ۥۘۘۖۧۛۙۖ۟ۜ۫ۚۛ۠ۛۦۘۦۥۨۘ۫ۖۘۥۖۛۚۖۥ۠۠ۧ۫ۨۖۘۙۡ۬ۥۢۚ۫ۥۛ۠ۡۘ۠۠ۧۛ۬ۡۦۡۘۛۧ۟۫۟ۜۨۤۨۘۚۘۨۘ۟ۛ۟۠۟ۡۢۡۥۗ۠۫ۜ۟ۧۚۛ۬ۜ۠ۗۢۜۧۜۗۚۖۢۨۚۗۖۥۡ۫ۗۤۙۤۦۘ۫ۜۚۙۗۢۙۖۧۘ";
                                                                        }
                                                                    }
                                                                    break;
                                                                case 1186174852:
                                                                    str9 = "۫ۛۤۦۨۚۖۥۛۨۗۦۘۗۚ۬ۦۘۚۖۦۘۖ۠ۡۘۚۚۦۘۖ۫ۛۚۚۢۗۜۦۘ۫ۤ۬ۗۙۡۤۛۘۢۥۥۘۘۗۘ۟ۚۦۡۘۨۘۦ۬۟۠ۘۦۖۜۥۘ۫ۜۨۘ۟ۡۦۘ۠۬ۗۖۙۖۘ۠ۜۙۘۢۗۙ۫ۨۡۘۦۘۢۢۙۚ۫ۨۘۗۜۥۚ۫ۥۘۡۥۧۡۨۘۘۚۨۘۨۜۛ۫۟ۥۖ۠ۥۘۢۤ۬ۤۢۡۘۢۛۨۘ۟ۨۨۘۡۖ۠";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1222118984:
                                            str8 = "ۘ۠ۗ۫ۚۛۖ۫ۜۘۜ۫ۛۤۨۚۘۜۘۤ۫ۛۘۜۡۘۜۖۖۙۜۘۘۢۥۖۘۗۛۡۖۧۢۦۤۚۚۘۘۥۡۨۦۛۦۘۘۨۥۘ۠ۢۖۙۜۧۡۖۜ۠ۖۘۘۡۨۥ۬ۦۘۧۨۨۘ";
                                    }
                                }
                                break;
                            case 98629723:
                                break;
                            case 2079248663:
                                str = "ۢۧۘۘۘۚۦۘۤۡۙۚۛۡۖۦۜۢۢۥۘۨ۟ۡۘۛ۟ۜۘۨۢۢۦۦۙۥۦۙ۬ۤۥۘۥۜۜۡۡ۫ۙ۫ۦۡۖۗۧۜ۬ۧۖۘۘ۬ۖۨۜ۠ۚ۟ۖۙۢ۠۠ۖۙۘۘۖۥۗ۬ۛۦۘ";
                                continue;
                        }
                    }
                    break;
                case 2108144190:
                    str = "ۗ۟ۘۘ۫۠ۘۘۜۖ۟ۢ۟۠ۨۦۜۘۖۗۡۘۙ۬ۤۥۦۡۘ۫۫ۨۘۛ۟ۧۥۖۡۘ۫ۘ۫۟ۧۜ۫ۘۙۙۤۡۘۚۨۛۤ۟ۥۘۗ۬۬ۢ۠ۖۘ۠۠ۥۦۜۦ۬ۧۚ۠ۥۘۘۥۢۖ۫ۚۜ۠۠ۥۜۧۥۘۛۨ۟۫ۚۤ۠ۡۡۘۡ۠ۖۥۛۢ۠ۧۧۘۨۧۘۖ۬ۡۘۘۜۛۜۙۨۙۙۖۚ۫ۡۘۚۨ۟۫ۢۦۘۘ۟ۦۘۧ۠ۗ۠ۡۛۧۢۗ";
                    continue;
                case 2130130842:
                    i3 = fileArr.length;
                    str = "۫ۜۨۘۗۜۘ۫ۘۘ۟ۘۦۥۜۙۜۡۜۘۗۧ۠ۢۙۤۘ۠ۨۘ۬۫ۛۙۤ۫ۢۗۦۦ۫ۗۥۜ۟۫ۜۘۥۖۧۜۧۨۡۘۚۤۨۛۢۙۘۘۢۨۘۜ۬۟ۤۢ۠ۦۖۘۥۚۨۚۘۢۚۛۚ۟۠ۨۧۘۘۘۚۘۛۜۜ۟ۡۚۚ۟ۨۥۤۦۘۛ۫ۦۘۡۡۢۘۦۘۡۗۤۢۨۤۧۢ۠";
                    continue;
            }
            str = "۠ۜۘۘۙ۫ۜۘۤۗ۫ۜۡ۬ۧۖۧ۫۟ۢ۠ۘۨۘۨۦۥۘۡ۬ۡۘۖۖۥۘۙۦۢۘۥۦۦۘۡۤۧ۫ۗۢۤۚۡۨۘ۟ۘۡۘۗۦۙۥ۫ۜۘۚۨۦۘ۠ۗۥۛ۫۬ۙۢۡۜ۠ۙ۫ۨۢۖ۬ۜۘ۬ۨۛۥۧۥۦۗۚ۟ۤۦۘۖۘۚ۠ۧۘۥۤۖۤ۬۬۠ۙۛۗۥۘۘۡۖۚ۠ۧۨ۠ۢۡۢۡۘ";
        }
    }

    @Override // android.os.AsyncTask
    protected /* bridge */ /* synthetic */ String doInBackground(String[] strArr) {
        String str = "ۦ۬۬ۧۤۖۘ۟ۛۤۚۜۜۧۨۚۧۡ۬ۛۛۘۘۦ۫ۖۤ۟ۡۘ۠ۨۨۘۧۗۜۗۦۡۖ۬ۢۧۨ۫ۦۢۚۦۧۨۨ۫ۢۘ۟۠ۡۧۡۙۛۤ۠ۙۜۜۗۗ۟۬ۖۡۧ۫ۧۛۖ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 895) ^ 528) ^ 180) ^ 98) ^ 158) ^ 800) ^ 434) ^ 433) ^ 681) ^ 655) ^ 883) ^ 755) ^ 636) ^ StatusLine.HTTP_PERM_REDIRECT) ^ 913) ^ 303) ^ 156) ^ 821) ^ 94) ^ 827) ^ 878) ^ 882) ^ 413) ^ 815) ^ 256) ^ 429) ^ 58) ^ 317) ^ 635) ^ 76) ^ 976) ^ 1271825176) {
                case 1233086135:
                    str = "ۛۥۚۨۛۛۜۖۡۨۙۦۨۢۤۙ۠ۤۢ۬ۙ۬ۨۤۨۛۗۡۦۜۘۘۧ۫ۨۗۨۘ۠۠۫۫ۡۘۥۗۥۧۡۥۘۜۖۡۢۘۚۛۥۤۙۡۘۗۘۦۥۜۘۘ۠ۛۚۧۜ۫ۗ۟ۜ۠ۤۤۨۧۨ۬ۘ۠ۥۘۙۡۜۚۡۙۗۘۢۥۧۖۦۡۘۤۖۧ۠ۜۙۖۘ۫ۘۧۘۥۙۢۘۡۥۘ۫ۜۘۘ";
                    break;
                case 1290729939:
                    return doInBackground2(strArr);
                case 1525409043:
                    str = "۟۫ۖۘۗۛۧۥۡۨۘ۠ۦۨ۟ۨۘۘۙۜۚۚۢ۟ۨۗۦۢۚ۬۟ۢۤۢ۬ۤ۠ۥۢۗۥۙۦۗ۟ۙۨۨۘ۠ۖۚ۫۫۬۬ۖۤۙۦ۠ۖ۫ۡۧ۠۬ۛۘۥ۬ۧۢۡۡۖ";
                    break;
            }
        }
    }

    /*  JADX ERROR: JadxRuntimeException in pass: BlockProcessor
        jadx.core.utils.exceptions.JadxRuntimeException: CFG modification limit reached, blocks count: 393
        	at jadx.core.dex.visitors.blocks.BlockProcessor.processBlocksTree(BlockProcessor.java:59)
        	at jadx.core.dex.visitors.blocks.BlockProcessor.visit(BlockProcessor.java:39)
        */
    /* renamed from: doInBackground  reason: avoid collision after fix types in other method */
    protected java.lang.String doInBackground2(java.lang.String... r15) {
        /*
            Method dump skipped, instructions count: 1224
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: kentos.loader.Component.DownloadZip.doInBackground2(java.lang.String[]):java.lang.String");
    }

    public void jknfthrbvgy(String str) {
        try {
            String str2 = this.context.getFilesDir() + str;
            ExecuteElf(Deobfuscator$$app.getString(-3440729873678425929L) + str2);
            ExecuteElf(str2);
            ExecuteElf(Deobfuscator$$app.getString(-3440729826433785673L) + str2);
            ExecuteElf(Deobfuscator$$app.getString(-3440730028297248585L) + str2);
        } catch (Exception e) {
        }
    }

    /* JADX INFO: Access modifiers changed from: package-private */
    /* renamed from: lambda$onPostExecute$0$kentos-loader-Component-DownloadZip  reason: not valid java name */
    public /* synthetic */ void m245lambda$onPostExecute$0$kentosloaderComponentDownloadZip(boolean z) {
        AlertDialog alertDialog = null;
        String str = "ۦۥۙۨۨۥۘۧۚۨۘ۟ۜۦۘۧۚۤۚۖۘۡ۫ۦۘ۬ۦۦۘۧۡۥۡۜۜۘۡ۟۫ۡۚۢۗ۟ۖۧ۫ۥۖۨۘۘ۫ۙ۫۠۫ۥۘۗۚ۬ۢۜ۫۫ۛۨۢۛ۬۟ۙۦۘ۫ۗ۬ۗۛۡۨۘۖۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 341) ^ 334) ^ 734) ^ 814) ^ 950) ^ 904) ^ 327) ^ 133) ^ 84) ^ 319) ^ 848) ^ 28) ^ 191) ^ 317) ^ 630) ^ 833) ^ 958) ^ 362) ^ 452) ^ 769) ^ 11) ^ 978) ^ 72) ^ 177) ^ 775) ^ 415) ^ 983) ^ 755) ^ 270) ^ 724) ^ 30) ^ (-312749966)) {
                case -1665624536:
                    checkdonwload = true;
                    str = "۫ۗۜ۠ۢۨۗۙۦۛۦۘۚۗۥۤۛ۫ۢۥ۬ۦۜۥۖۥۛۘ۫ۜۘۢ۟ۦۡۖۤۤۦۘ۠ۥۡۘۛۛ۟ۜۥۦۘۙ۟ۦۧۧۧۦۗ۠ۘۢۖۧۥۜۙ۠ۡۘۧۤۘۛۥۨۘۨۘۜۘۗۦۦۥۚۦۘۙۖۙۘۙۦۥۧ۠ۦۛ۟ۗۧۘۛۘۖ۬ۖۡۘۜۜۦۘ";
                    continue;
                case -1138359117:
                    String str2 = "ۚۖۨ۬۠ۦۘۙۦۚۢۛۚۜۗۙۛۥۦۘۛۤ۠ۥۜ۬ۘۚۡ۠۠ۦ۫ۨۜۢۜۥۘۤۙۢۦۗ۫ۡۚۜ۠ۧۨۥۦۜۙۧ۠ۗۨۤۙۖۘۙۗۚۥۦۘۛۦۥۚۧۦۘ۫ۗۧۤ۠ۦۖ۟ۥۘ۠ۡۡۦ۠ۤۖۡۙۤ۫۟۬ۡۧۖۛۚۧۥۘ۠ۜۢۥۜۘ۟۠ۤۙ۫ۘۘۧ۟ۨ۫۠ۥ";
                    while (true) {
                        switch (str2.hashCode() ^ (-1657354508)) {
                            case -2115325186:
                                str = "ۡۡۜ۬ۚۢۗۜۢۥۗ۫ۦۧۨۘ۫ۘۨۛ۠۬ۜۘۘۜ۟۬ۗۜۖۘ۬ۥۤۢۛۢۘ۠ۢ۠ۜ۫ۧۗۛۙۥ۠۬ۚۜۘۚۤۖۖۚۙۡ۟۟ۨۥۘۜۧۢۧۧ۟ۦ۟ۙ۬ۧۥۘۢۢ۟ۤ۟ۖۘۘۤۚۨۧ۫ۜۦۥۚۖۡۙ۬ۗۥۤۤۘۘ۟ۛ۟ۛ";
                                continue;
                            case -2105448504:
                                str2 = "۫۟ۤۘۙۛۗۨۗۦۥ۬ۤۙۥۘۛۙۛ۫ۛ۬۬ۡ۠ۤۙ۬ۤۦۚۘۧۨۘۘۚۨۛۥۘۘ۬ۨۡۧۖۡۘۦۢۘۢ۫ۤ۠ۥۘۘۗ۠ۤۨۙۥۘۨۙۘۘ۠ۡۙۢۧۥۘۨۧۜۘ۠ۘۡۘۘ۠ۨۘۖۜۥۘۤۗ۫ۚ۬ۘۘۗ۟ۛ۟ۖ۫ۨ۬۟ۥۘ۫ۤۗۙ۫ۜۘۘۥ۟ۛۙۗۢۢ۫ۢۛ۫ۡۥۜۘ";
                            case 448620559:
                                break;
                            case 797192567:
                                String str3 = "ۡۛۦۥۢۡۢۚۥۧۦ۠۬ۦ۠ۤۛ۠ۡۨۜۘۥۚۘۘۤ۬ۨۛۖۥ۟ۤۖۘۦۚۢۨۛۡۘۙۖ۬ۙ۫ۦۛۨۨۡۖۘۘۧۙۥ۫ۥۡۘۜۗۥ۟ۖۘۤ۬ۢ۬۟ۨۗ۬ۦۧۧ۟ۤۨۥۘۘۦ۬۠ۖۜۥ۟ۗۗۢ۠ۜ۠ۖۘۦۘۡۖۥۡۘۘۜ۠۠ۡۨۨۤۥ۟ۤ۬۫ۙۤۤۥ۬ۘۜۜۥۘۙۤۙۧۤۡ۟ۛۙۚۧۨ";
                                while (true) {
                                    switch (str3.hashCode() ^ 849267552) {
                                        case -2007475412:
                                            str2 = "ۘۚۡۘۢۙۚۘۖۖۤ۫۠ۛۖۥۘۚۦ۟ۨۛ۬ۜۚۥۘۨۚۢ۟ۦۨۘۙۜۙۧۙۦۤۚۡۛ۟۫ۥۡۘۘۖۢ۬ۖۡ۫ۙۖۜ۠ۛۢ۫۟ۘۘ۠ۚۜۤ۟۬۬ۥۡۘ۬ۖۜۘ۫ۥۥۘ۬ۖ۬۠ۨ۫ۧۗ۫ۤۨۦۘۢ۟ۡۘۥۚۙۢۨۜۥۜۧۗۜۗۜۛ";
                                            break;
                                        case -1574766429:
                                            str2 = "ۤۘۡۤۨۦ۬۬ۥۘۡۦ۟ۚۘۧۧۙۜۘ۠ۢۤۖۜ۬ۥ۬۬ۧ۠ۡ۟ۙۛۤۚ۫ۦۥۧۘ۟ۡۖۘۨۘۜۢۜۘ۫ۧۦۘۛ۟ۙۡۙۛۨ۟ۘۘۧ۟ۘۨۢۖ۬ۥۨۘۦ۫ۨ۬ۘۨۘۤۖۦۘۗ۬ۚۜۡۙ۠ۡۜۘ۬۫۫";
                                            break;
                                        case 480772417:
                                            str3 = "ۛۜۡۤۦۡۨۧۡ۟ۨ۠ۗۜۧۢۡۦۧۜۗ۠ۛ۠ۤۛۛۨۜۘۘۚۨۘۢۚۥۘۡۗۙۧۚۘۘۤۨۛۢۚ۟ۥۡۘۙۙۤۦۖۗۢ۠ۘ۠ۥ۬ۗۢۧ۟ۙۡۘۚۖۡۘ۫ۗۘۘ۬ۖۧۙ۬ۜۙۡۧۘۛۗۙۛۥۡۘ";
                                        case 1291196418:
                                            String str4 = "ۘۥۡۘۢۢۘۘ۬۠ۨۘۜۡۘۘۧۚۨۘ۠ۨۛۨۚۥۘۜ۠ۦۡۡۢۧۖۘ۠۬ۨۡ۫ۧۡۜۘۢ۠ۤۙۧۛۘ۟ۖۘۧ۬ۧ۟ۘۦۧ۠ۥ۟ۘۡۘۚۤۖۢۚ۫ۨۧۦۖ۠ۘۘ۟ۖۥۘ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-911216891)) {
                                                    case -2005038357:
                                                        String str5 = "ۤ۟۠ۜۧۜ۫۠ۡۘۢۛۚ۠ۢۡ۟ۡ۬۟۫ۘ۠ۜۤۧۚۛۙ۠ۥۖۘۘۙۚۨ۠ۥۦۘۨۧۨۘۥۧۨۘۡۛ۠ۗۡۛۥۜۢۜ۫ۡ۬ۡۙۡۥۘۨ۟ۢۖۢۗ۫ۦۡۘۡۖۨۚۙۧۤۨ۟۫۬ۥۘۦۤۦۘۖۨۢ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ 1335006577) {
                                                                case -1061140888:
                                                                    str4 = "ۤۘۘۨۢۤۧۘۘ۟ۡۜۘۜۛۛ۟ۢۨۜۥۘۜۦ۬ۨ۠۬ۗۥۦۦۥۘۘۗۢۜۜۙ۫ۚ۟ۜۢ۠ۚۗۙ۟ۦۚ۫ۢۤۙۥۛۤۘۖۤ۟۟۬ۖ۫ۜۘۦۨۤۢۛۜۛۗۤۖۨۗۧۛ۫ۥۢۥ۫ۜۦۙۢۨ۫ۚۢۘۦۡۘۡۦۘۨ۫ۜۘ۠۬ۖۘۜۡ۫۟ۜۙ۠ۙۘ۠ۚۥ۬۟ۗ۠ۡۗۛۙۡۡۗ۫ۢۘۛۚۖۥ";
                                                                    break;
                                                                case 1135291000:
                                                                    String str6 = "ۘۜۘۜ۫ۧۖۖۛۙۗۚۖۧۥۘۘ۟ۧ۫ۙۦۙۙۜۘۤۡۖۜۢ۫۫۟ۖۚۛۖۘۨۡۨۘ۟ۗۜۥۙۜۘۙۦۤۧۜۗۢ۠۠ۤۡۨۘ۫ۦۡۘ۫ۡۘۧۢۘۘۗۛۦۘۧۖۧۘۛۖ۬ۗ۫ۤۚۧۗ۬ۢۦۘۤۢۖۘ۫ۧۥۘ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ (-549036595)) {
                                                                            case -1536572037:
                                                                                str6 = alertDialog.isShowing() ? "۟ۗ۫ۢۖۢۗۤۦۘۖۦۘۥۖۘ۬ۘۦۘۨ۟ۙۚۘۡۘۨۗ۬ۥۖ۫ۙۖۡۦۘۤۨۗۨۘۗۧ۟ۦۢۡۘۧۦۜۘ۬ۚۙ۟ۛۨۜۤۜۘۘۙۜۧۙۤۢۡۢ۠ۖۨۘ۬ۡۢۧ۠ۛۜ۬ۜ۠ۨۗۚ۫ۗۢۙۧۤۜۚ" : "ۢۤۛ۠ۗۤۧۦۦۘ۟ۗۘۘۚۖۢۥۨۘۘۗۙۙۛۤۢۨۧۦۥ۠۟ۧۧ۫ۗۘۘۡۢۨۦۨۡۥۥۚۖ۬ۥۘۘۜۦۘۢۗ۟ۗۙۛۡۛۦۘۨۧۦۘ۫ۘۧۛۖۘۜۢۚ۬ۤۤ";
                                                                            case -1490596085:
                                                                                str6 = "ۢۨۖۘ۠ۙۦۘۚۛ۠ۦۖ۠ۜۦۦۙۥ۟ۢۦۖۘۙۡۧۗ۫ۡۨۥۢ۟۫ۖۘ۟ۥۥۘۚۗۖۘۗۜۥۘ۫ۨۢۛۘۧۚۖۥۘۡ۫ۗۘۗۚۙۗۖۘۗۗۖۘۢۜۖۛ۫ۡۡۥۨۘۗۢۖۘ۟ۦۖۘ۠۟ۡۦۛۧۚۦۜۨۨۚ۫ۢ۟۟ۛۤۡۨۜۨۜۙۛۤۧ";
                                                                            case -1427529860:
                                                                                str5 = "۟ۢۚۖۖۘۙۚۡۘۖ۬ۨ۫۬ۗۧۤۢۖۡۡۘۜ۟ۙۡ۫ۚ۠۫ۨۘۛۦ۠ۙۗ۬ۡۛۨۘۛ۬ۘۗۦۢ۬ۘۧۘۚ۠ۗۘ۠ۨۘ۠ۨ۫ۦۢۙۗ۬ۤۛۜۙۡۛۘۜۛۙ۟ۤ";
                                                                                break;
                                                                            case 1854221968:
                                                                                str5 = "۟۟۟۬ۥ۬ۙۤۢۚۡۘۥۢۜ۬۟۟ۚۛۨۙۡۘ۠۫ۗ۠۠ۧۘۚۖۘ۠ۢۘۘ۫ۨۙۖ۬ۜۚۨۚۛۜۘۛۡۥۘۤۖۦ۟ۖۢ۟ۙۙۢۘۘۤۥ۬۬ۢ۠ۘۛ۠ۛۨۚ";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case 2015190899:
                                                                    str4 = "ۛۥۡۘ۫ۦۜۙۧۡۗۛۥۘۗۙۥۘۡۥۤ۠ۡۡۘۢ۟ۢۜۡۡۘۖۖۦۘۚۢۢۜۦ۟ۗۗۡ۫۠ۨ۠۫ۡۘۢ۫ۖۘ۫ۧۥۘۥۖۘ۟ۥۡۤۨۡۘۥۢۨ۫ۨ۠۟ۢۜ۟ۙۤۛۖۘۧۖۖۤۜۗ۟ۧۨۘۚۘۛۧۜۤ";
                                                                    break;
                                                                case 2033394733:
                                                                    str5 = "ۜ۫ۚ۫۟۠ۧۥۥۘۙۘۜۦ۫ۙ۠ۘ۟ۖ۠ۡۤۨۦۖۗۥۘۡۙ۫ۗۖۢۖۨۡۘۥۖۗۨ۟ۢۜ۫ۦۘۨۗۖۦۨۨۘۢۜۘۨ۬ۥۘ۠ۚۦۘۚۖۜۤۖ۠ۧۦۤۨۤۨۘۦ۫ۦۡۗۛۙ۠ۘۘۦۢ۬ۢۢۧۨۧۡۚۘۙۚۡۘۡۙ۠ۛۤۦۜۖۥۘ";
                                                            }
                                                        }
                                                        break;
                                                    case -1089621727:
                                                        str3 = "ۖۖۧۘۚۦ۫ۙۦۨۘۜۚ۫ۘۤۥۘۚ۟ۜ۟ۢۦۘۡ۫ۤۧ۬ۙۜۘۘۢ۬ۜۘۦ۬ۦۦ۫ۖۘۚ۫ۢۡۦۡۛ۫ۦۘ۟ۢۛۡۖۤۚ۬۟ۦۙ۬ۛۨۧۘ۟۬ۨۧ۫۫ۜۘۘ۫ۚۢۛۥۛۧۛۘۧ۠ۦۘۧ۫۟۠ۖ۬ۘ۬ۙۘۖۚۢۖۡۥۢۦۛۨۧۤۥۖۖۗۧۤ۬ۥ۫ۡ۫ۢۜ۫ۖۘۘۤۜۨۚۦۨۜۥۖۚۡۜۘ";
                                                        break;
                                                    case -379536158:
                                                        str3 = "ۜۜ۬ۗۛۜۖۚۡۖۨۜۘۚۡ۫ۗۛۖۘۢۡۦۚۚۥۢۤۦۘۨ۟ۨۧۨ۠ۢۢۤۥۢۤۡۗ۬۬ۨۘۜۡۢ۬ۤۦۚۙۚۗۦۛ۟ۛ۫۫۬ۤۡۛۖۘ۟ۘۚ۬ۗ۠۫۠ۤۢۙۨۘۛۤۚۘۡۜۘۗۖۜۘۢۛۜۘ۠ۡۤۖ۟۠ۘ۠ۚۤۧۥۦۖۚۨۢۥۘۥ۟ۢۙۨ۬ۙۦۥۘۛ۬ۘۢ۟ۨۘۥۗۚ۬ۡۜ۠ۡۗۖ۫ۗ";
                                                        break;
                                                    case 1872294550:
                                                        str4 = "ۚۡۜ۟ۨ۬ۡۗۚۡۨۚۛۚۙ۬ۖ۟ۡۥۘ۠ۢۜۖۨۧۧۨۜۨۡۘۦ۠۠ۥۨۚۡ۟ۘۘۘۢۦۤۘۥۜۘۙ۫ۨۛۘۡۜۘۢ۠ۘۗۢۛۚ۟ۢۘۦۘۘ۫ۜۗۚۖۘۨۗۡۗۘۘۙۛ۟۫ۢ۟ۗۛۦۗۘۘۙۢۙۧۨۡۘۢ۠ۨۘۦ۬ۚۛۖۖۨۥۡۤۗۗۧۘۛۜۘ۫ۜ۠۟۫ۢۢۜ۟ۥۢۖۘۨۜۤ";
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case -1026186186:
                    str = "ۘ۫ۙۥۡۥۘۘۤ۬ۙۦۦۡۤۘۤۢۥ۠ۗۗۖۨۤ۟۫۟ۛۖۗۤ۫ۜۧ۠ۥۢۦۥۘ۬ۜۦۘۘۤۦۧ۬ۛۗۚۨۧۙۚۘۘۧۘۚۗۧۖۚ۠ۚۜۘۨۢ۬۟ۙۨۖۚۦۛۜۨ۟ۨۡۘۛ۫ۜۘ۬ۥۡ۫ۖۘ";
                    continue;
                case -677180645:
                    this.customProgressDialog.dismiss();
                    str = "ۦ۟ۨۙۜۡۘۡۡۘۘۡۖۢۙ۠ۡۘۙۖۡۘۘۚ۫۠ۖۖۗۗۖۚ۠ۗۦۡۤۗۗ۟ۥۘۦۧۦۘۜۙۜۗۧۜۦۙۨۘۘۘۗۙۗۤۢ۫۠ۖ۟ۗۗۜ۠۫ۛۨۘۜۡۗۤۥۤۜۨۙۤۢۦ۠۬۬۫ۦ۬ۜ۠ۙ۟ۗۥۘۧۨۜۧۥۥۧۦ۠ۤ۬ۘۘۜۤۧۖ۫ۨۘۚۘۘۡ۬ۦۘۙۢۘۡۜۘۜۤۚۢ۠ۦۘۛۤۛۖۗۦ";
                    continue;
                case -657461147:
                    str = "۬ۢۘۙۘۜۡۛۛۗۢۦۘۤۦۧۘۢۡۖۘۥۡۤ۫ۖۜ۠ۙۧۛ۠ۙ۫۫ۖ۬ۢۨۘۜۥۚ۬۬ۖۘۖۦۡ۬ۗۗۚۦۘۤ۟ۦۡۨۢۨۖۛ۟ۙۦۨۙۜۛۡۛۧ۟ۛۛۜۘ۟ۜۜۘۡۨۥۧۖ۟۬۠ۖۙۦۥۘ۟ۨ۠ۡۡ۠ۤۖۚ۬ۜۦۘ";
                    continue;
                case -416078744:
                    str = "ۡۛۡۘۘ۬ۘۖۧۗۘ۫ۖ۠ۦۛۤۨۨۘ۠ۜ۟ۖۤۥۘۚۚۜۢۛۦۜۡۚۖۗۚۛۙۖۘۥۧۧۡۤ۟۟ۨۦۤۛۥ۟ۙ۠ۥۧۨۢۘ۬۠۟۬ۖۨۘۤۘۡۚۖ۠ۛۡۢۦۥۖۘۛ۟۫ۘۛۖۗ۫۫ۘۡۡ";
                    continue;
                case -356874475:
                    alertDialog = this.customProgressDialog;
                    str = "ۥۖ۠ۛۜ۟ۦۚۛ۬۟۠ۢۛ۠ۗۛۜۧۘۘۢۤۗۘۘۘۘۖۜۦۙ۠ۘۘۗۖ۬ۡۙۨۘ۬۬ۙ۬ۗۜۨۤۡۡ۟ۗۧۚۨۘۜۡ۠۬۟ۙ۠ۦۨۘۧۖۨۘ۠ۧۖۜۤۘۗۜۘۖ۫ۧ۠ۧۛۡ۬ۨۘۖۗۙ۫ۨۘۤۖۨۦۧۛۖۜۖ۠۠ۨۖۗۛۧۘۘۘۡۜۘۜۙۛۨۦۡۘۥۦۥۘۙۨۖۡۚۘۘ۟۠ۗۤۙۜۤۧۘ";
                    continue;
                case -118230734:
                    return;
                case 1111460802:
                    String str7 = "ۨۤۢۥۛۚۢۖۖۘ۫۫۬۠۠ۤۚۦۜۘۤۚۜۧۨ۫ۙۧ۠ۚۘ۫ۥ۟۬ۡ۟ۙ۫ۙۦ۟۠۟ۥۡۖۗۜۢۨ۠ۦۤ۟۟ۨۜۨ۟ۥۘۙۙ۫ۗۜۧۥۗۚ۬۠ۖۘۤۙۖ۟ۙۚۚۛۨۘۧۜۖۥ۟ۖ۬ۡ۫ۥۙۤۙۤ۟۫ۢۤۤۥۗۦۦۘ";
                    while (true) {
                        switch (str7.hashCode() ^ 1804655228) {
                            case -1893953629:
                                break;
                            case -1260787566:
                                String str8 = "ۤۗۙۗۡۚۢۚ۬۠ۥۘۚۜۧۥۖۢۢۦۡ۫ۛۧ۬ۖۡۘۧۙۙۜۚ۬ۨۢ۟ۡۖۘ۟ۚۘۘۖۛۜ۠ۦ۟ۢۖ۠ۤ۫ۖۡۦۢۛۤۡۘۜۧۡۙۘۧۘ۠ۜۛۘۨۜۘۢۖۡۘ۟ۥۙۘۡۖۙۦۡ۠ۘۗ۫ۢۗ۟ۗۗۦ۟ۧۘ۫۠ۡۗۘۛۘۧۥۗۖۨۢۧۤۢۧۡۧۘ۫ۚ۫";
                                while (true) {
                                    switch (str8.hashCode() ^ 949055180) {
                                        case -1866282257:
                                            str7 = "ۙۡ۬ۜۘۦۘ۬ۚۛۦ۬ۗۨۜۨۨ۠ۜۦۥۜۘ۟ۙۨ۟ۤۚ۫۫ۜۜ۠ۜۡۤۘۜۘۦ۠ۨۛۗۖۙۨۖۤۚۡۘۙ۟۠ۖۥۧۘۢۥۨۘۨ۠ۛۘ۠ۗ۫ۗۥۘۢ۬۟ۛۛۗۢ۬ۜۘۢۛۘۘ۠ۢ۬ۜۖۘۘۥۗ۠";
                                            break;
                                        case -1703501943:
                                            str8 = "ۘۧۢۜۤۘۘۡۘۜۡۡۥۨۜۘۖۙۖۜۦ۬۫۬ۜۗۨۘۨۨۧۚ۫۟ۛ۟ۙۦۜۤۘۡۤۚۛۜۘۦۡۡۘۛۗۡۘۛۙ۬۠ۥۥۘۚ۬ۘۘۧۖ۫ۙۨ۫ۖۙۜۥ۫ۦۘۗۗ۠۬۠ۘۡ۫۬ۡۖ۟ۙ۟ۡۘۙۜۡۘۧۨۗۜ۬۬ۖۨۥۙۗۜۘۦۗ";
                                        case -1202925598:
                                            str7 = "ۨۛ۬ۧۜۧۨۨۥۘۧۨۙۜۢ۠ۨۧ۠ۨۙۧۚۡۜۘۛۖۧۘ۫ۚۦۖۛۨۘ۫ۖۧۘۢ۠ۥۘۥۚ۫۠ۜۨۘۙۛۗ۠۠ۧۡۧۡۘۡۛ۬۠ۗ۫ۗۡۘۧۤۨۘ۠۫۬ۡۗۖۘ۟ۡۥۘ";
                                            break;
                                        case 1490676139:
                                            String str9 = "ۤ۟ۥۘۖۛۖۘۦ۫ۥۘۖۛ۫۠۠ۤ۬ۘۦۘۛ۟ۖۘۥۜۘۥ۫ۨۧۨۧۘۦۦۘۧۦۡۛۜۦۙۙۚۛۨۢۚۖۘ۠۬ۥ۠ۢۤ۟۠ۖۘۗۤ۠ۨ۬ۨۘۚۘۖۘۗۖۧۘۡۢ۬۬ۢۖۘ";
                                            while (true) {
                                                switch (str9.hashCode() ^ 1081840776) {
                                                    case -1746909421:
                                                        str8 = "ۘۖۜۦۜ۟ۥۢۛۢۡ۟ۗۛۦۘۖۥۡ۠۬ۚۙۦۘۘۘۤ۟۬ۢۢۖۖۧۘۧۗۤۥۡ۠۫ۙۜۘۘ۬ۖۘۚۗۨۘۚۗۗۤۚۥۘۜۨۨۘ۠۫۠ۗ۟ۢۖۥۡۙۘۡ۠ۢ۬ۖۨۦۘۖۥ۠۟ۖۦۖۦ۬۬ۜۥۘۛۧ۬ۡ۠ۘۘۛۜ۫۠ۛۨۘۜۤۘۘۦ۟ۖۘۙ۠ۜۘ۟ۚۤۖ۠۟۬۠ۗۤۖۦ۬ۚۙۡ۠۬۠۬ۥۨۦۖ";
                                                        break;
                                                    case -1621533347:
                                                        str8 = "ۥۜۜۤ۫ۡ۬ۡۧۘۜ۠۠ۜ۫ۧ۟ۤۘۘۛۨۨۜۖۢۖۤۨ۫ۖۧۘۥۙ۟ۙۖۖۗۚۚۡۚ۠۫۠ۡۧۗۦۡ۠۫ۘۚ۬۫ۘۦۢۘۘۨۡۛۧۛ۠۬ۘۖۘۥۘۜۗۙۘۨۗ۬ۛۘۘۜۥۘۘۡۦۘۛۖۖ۫ۜۘۘۗۦ۠ۢۨۛ۬ۛۦۘۡ۠ۘۘۛۨۛۜۧ۟ۚۛ۬ۥۜۚۢۤ";
                                                        break;
                                                    case -1377100728:
                                                        String str10 = "ۗ۫ۜۛۨۦۘۗۨۜۘۡۡۗۥۥۛۖۚۥۙۘۜۛ۠ۢ۠ۧۗۢۘۨۥۥ۬ۡۧۦۘ۟ۙۘۘۤۦۤ۬ۘۖۧۧۤۤۡۖۘۗۙۛ۫ۙۜۗۜۘۘۖ۟ۥۘ۫ۚۤۜۦۖۘۧۗۦۥۚۜۘۤۥۢۡ۠ۨ۫ۨ۠۬ۜ۫۫ۨ۠";
                                                        while (true) {
                                                            switch (str10.hashCode() ^ (-1003436448)) {
                                                                case -1981365986:
                                                                    str9 = "ۥ۫ۤۜۧۖۘۢۦۨۥ۟ۤۨ۠ۡۦۖۥۘ۫ۚۥۥ۟۠ۥۘۜۘۘ۟ۨۘۡۦ۟ۛ۫ۖۘۦۤۘۘ۬۬ۖۦۦ۠ۥۗۨۚۘۖۜۥۦۘۖۥۨۛۨ۬ۜ۟ۨۘ۫۠۟ۥ۟ۘۘۨ۠ۤ۟ۙۤۨۛۚۢۥۖۘۜۗۖۘۛۡۧۘۧۢۚۙۙۜۘۚ۟ۥۘۥۧ۠۟ۦۛۘۜۡۘۗ۬ۘۘۤۤۚۙۚۧۢۧۜۛ۫ۖۘ";
                                                                    break;
                                                                case -1567899858:
                                                                    str10 = "۠ۢ۠ۦۜۙۦ۟۟ۨۥۙ۫ۥ۬ۖۢۦۙۢۙۦۜۥۦۡۦۘۙۧۢۨۘۧۨۥۦۘ۟ۡۘۘۢۡۖ۟ۜۨۤۖۛ۬ۨ۬۟۫ۡۘۢۜۢۘ۠ۡۗۤۗ۬ۚۦۗۚۜۘ۬۬۬۟ۡۢۗۨۦ۠ۙۛ۠۠ۚۛ۫ۘۘۙۚ۟ۧۨۘ۬ۡۧۖۦۖۘۢۢۨۘۚۢ۬";
                                                                case -1473514957:
                                                                    str9 = "ۨۖۚۚۥۦ۟ۛۡۦۡۤۖۜۦۢۛۥۗۖ۟ۡۗۘۚ۠ۜۖۜۛۥۦۖۨۧۨۘۧۧۦۘۧ۟ۚ۫ۖۜۘۤۦۖۘۢۨۘۘۡۢۜۘۜ۬ۤ۟۠ۧ۬ۦ۫ۢ۠ۘۘ۠۬۫ۖ۠ۘۘۖۦۨۘۛۖۥۛۜۜۙۨۘۚ۠۬ۘۧۦۙ۬ۧ۬ۜۥۘ۟۬ۤۡۗ۫۬ۚۥۨۢۡۘ۟ۢۖۢۧۡۙۤۜۡۥۡۧۤ۬ۧ۬ۚۧ۫۟ۥۖۡۖۘۜ";
                                                                    break;
                                                                case -1067476961:
                                                                    String str11 = "ۡۜۦۘ۫ۡ۬۟ۗۖۦ۟ۨۘ۠ۡۦۡۧ۠۠ۚۧۨۦ۫ۢ۬۬ۧۨۜۥۘۦۘۙۡۜۘۘۢ۠ۗۨۡۚۜ۬ۜۧۢۨ۬ۢ۠ۛ۬ۡۘۘ۟ۢۨۡۙۦۧۖۙۜۙۥۘ۬ۢۖۜۢ۠ۧۢۢۤ۫ۛۘۖ۠ۙ۬۬ۢۢۢ۬۠۫ۤ۠ۧۖۘۖۢۙۦۘ۟ۨۧۘۚۜۨۘۙ۠ۗۛۡۡۙۦۘۜ۬ۙۢۡۨۘۜۨۘۗۦۡۗۜۨۜۜۧ";
                                                                    while (true) {
                                                                        switch (str11.hashCode() ^ 2043592081) {
                                                                            case -1893552774:
                                                                                str10 = "ۥۜۡۗۖۘۚۤۡۘ۫ۨۖۧۛۖۘۙۢۗۜۗ۬ۜۨۘ۠ۙ۠۟ۥۙۦۨۗۜۚۧۜۢۙۚۢۡۡۙۦۘۢۜۘ۟ۘ۟ۖۤۘۘۖۨۥۘۧۗۜ۫۟۬ۤۢۚۚۡ۟ۙ۠ۥۢۦۚۛۦ۠ۘۧۤۡۤۦۢۨۘۤۧۥۘۛۛۘۚ۟ۦۘۨۧۡۘ۬ۘۦۡ۠ۘۘ";
                                                                                break;
                                                                            case -738513872:
                                                                                str11 = "ۤۚۧ۟ۨۜۦۛۖۚۜۘۗۚۜ۫ۘۥۤ۫ۤۛۘۜ۫ۗۥۘۘۚۦۘۛۚۨ۬ۤۧۦۢۛۚۤۤۢۚۨ۫۠ۧ۟ۨۨ۠ۡۨۖۨۗۖ۟ۧۙۛۜۘۦۛۜۤ۟ۧۛۥۨۘ۬ۜۥ۠ۧۢ۠ۛۦۢۜۡۘۚ۬ۦۘۨۦۘۘۙ۠ۘۜۨۖۡۧۦۘ۫ۖۖۘۧ۫۟۟ۗۨۚۨۧۘۘ۟ۦ۟ۖۥۘ";
                                                                            case 672272159:
                                                                                str10 = "۟۫ۥ۟ۦۗۨۦۧۘۦۦۗۢۧۗۧ۟ۖۥ۠ۜۤ۬ۙۨۚۘۘ۠ۛۘۘۗۡۥ۬ۙۙۗۡۖۘۧۧۖۚۦۚۖ۟ۚۢۜۨۧۤ۬ۖۤۦۘ۟ۦۧۡۤۗ۬۠ۘۜۜۦۡۖۙۙۜۘۦ۫ۨۨۘۘۦۤ۬۟ۖۚ۬ۤۙۜۦۘۧ۬ۨۗۢۧۗ۟ۖۘۧۗۥ۫۠ۗۗۛۖۘۤۜۜۘۛۧ۫ۦ۠ۜ";
                                                                                break;
                                                                            case 1945217763:
                                                                                str11 = alertDialog != null ? "ۚۖۚۙ۬ۜۘۛۨۢۘ۬۬۫ۚ۠ۖ۟ۘۜۡ۫ۧ۬۠۠ۖۘۘۥۘۡۘ۟ۡۢۗۥ۫ۥ۠ۡ۬ۘۜۛۜۜۘ۬۠ۜۙۥۖۨۘۗۛۜ۬ۥۤۘ۬۬ۨۡ۟ۛۧۚۢ۬ۨۡۚ۠ۛ۟ۖۜۘۛۗۛۗۛۘۤۤۚۛۗۦۘ۟ۧۘۘۗۡۤۗ۫ۤ۫ۨۚۘۜ" : "ۦ۟۬ۤۤۜۘۦۤۡۘۥ۠ۧۢۧۥۘۖۥۥۘۢۖۖۘۧۨۛۤۚۖۘ۟ۜۘۘۨۢۖۧۢ۬ۧۜۙۜۘ۫ۢۜۦ۠۟۠ۤۖۘۜۙۗ۟ۜۘۨۨۛۡۤۡۙۤ۫ۢۨۖۦۢ۠۫ۡۨۨۚۡۘۜۙۧۤۥۥۖۡۘۘۨ۠ۤۡۚۘۢۛۨۚۙۜۦۜۜۘۦۗۜ";
                                                                        }
                                                                    }
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case -597068484:
                                                        str9 = "ۙۚۜۜ۟ۢۧۢۚۘۦ۬۬ۧۨۛۨۗۡۤۖۘۘ۬ۥۘۧۚۦ۠ۢ۟ۤۧۥۢۙۚ۟ۛۦ۟ۙۖۚۘ۟ۗۜ۠ۥۘۚ۠ۜۨۦۧۦۦۜۙ۫ۡۦۧۧ۟ۙۜ۟ۖ۫ۡ۟ۗۧۤۗۜۢۢۨۖۜۦۚۤ۟ۨ۫۠ۖۨۢۦۘۡ۫ۡۧۦۜۘۚ۠ۗۘۡۢۖۧۦۘۙۖۧ۫ۘۚۡۗۤۚ۠۫ۦۨۖ۬۫ۖۗۘۧۘۧۤۛ";
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 731624276:
                                str7 = "ۚۘۖ۟۠ۢ۠ۨ۬۫ۧۦۘۨ۫۫ۧۘ۟ۡۛ۠ۘۜۗۖۚۘۘ۫ۤ۬۟ۡۤۥۤۖۘۡۗۙۙ۠ۧۘۤۨۡۚۢۘۥۧۘۢۜۥۤۤۡۘۙۥۛۥۖۦۘۘۧۘۙ۫ۥۘۢ۫۬ۛۦۗ۟ۗۨ۟ۚۘۧۘۧۚ۠۬ۥۧۘۤۡۖۙۜۥ۬۠ۜۖۧۙۡۘ";
                            case 2084000278:
                                str = "ۤ۟ۥۗۦۘ۠ۙۥۤۧۧۖۧۛۢ۫ۦۘۗ۬۟ۚۡ۟ۨۧۡۘۚۧ۟۠۬ۢ۟۠ۥۘۦۘۜۘۦۛۘۘ۬ۛۚۧۜ۠ۦ۬ۧۛۥۡۘۛۘۡۘۗۢۖۘۚۥۛ۫ۧۡۘۗ۫ۚۗۡۖ۠ۧۘۘۨۥۘۘۚۘۖۧۙۛ۟۫ۥۘۜ۫ۦۘۖۜ۟ۡ۫ۜۚ۟ۢۚ۫۠ۧۗۛۥۘۘۡۘۚ۫۬ۙ۬ۥۢۗ۠ۢ۬۫ۖ۠ۜ۠ۡۤۦۙۖۘۡۜ۟";
                                continue;
                        }
                    }
                    break;
                case 1651136450:
                    showFatalErrorDialog(Deobfuscator$$app.getString(-3440729950987837257L));
                    str = "ۡۛۡۘۘ۬ۘۖۧۗۘ۫ۖ۠ۦۛۤۨۨۘ۠ۜ۟ۖۤۥۘۚۚۜۢۛۦۜۡۚۖۗۚۛۙۖۘۥۧۧۡۤ۟۟ۨۦۤۛۥ۟ۙ۠ۥۧۨۢۘ۬۠۟۬ۖۨۘۤۘۡۚۖ۠ۛۡۢۦۥۖۘۛ۟۫ۘۛۖۗ۫۫ۘۡۡ";
                    continue;
                case 1789145895:
                    String str12 = "۬ۛۧۢ۬ۨۨۚ۫ۗۧ۫ۡۢۨۙۙۡۧۚۘۤۚۛۨۥۘۘۜ۟ۖۢۗ۫ۘۡۜۡۦۖۛۖۜۨۙ۠ۦۘۘۢۚۘۖۨۖۚۖۖۨۧۘۙۜۦۦۘۚۜۦۥ۫ۧۤۖۘۢۧ۠ۘۖۦۘۘ۬ۖۘۨ۠ۢۦ۟ۚۘۘۘۦۘۚ۟۟ۤۡۖۘ۬ۗۥۘ";
                    while (true) {
                        switch (str12.hashCode() ^ 354888903) {
                            case -1496168270:
                                str12 = "ۢۡ۟ۖۜ۫ۚۢۚۘۛۙۧۧ۫ۚ۠۫ۜۜۘۗ۟ۡ۟۫ۥۘۧۘۙۘۙۡۨۙۡۚۖۗ۟ۜۛۗ۠ۗ۫ۙۜ۠ۥ۠ۜۨۘۨ۫ۨۗۡۧۘۢۨۨ۟ۗۥۘۘۛۗۡ۠ۘۘۗ۟۠ۤۢۤ۠ۖۜۤ۟ۡۘۚ۫۫ۤۤۜۘۜۤۜ۫ۤۡۨۥۧۚۦ۫ۡ۬۠ۢ۟ۨۘۜۦۥۘ۬ۙۢۚۤۘۤۡۙ۠ۢ۫ۤ۟۟ۨۥۜۘۗۡ۬ۤۛۘۘ";
                            case -256960107:
                                str = "ۖۢۤۖۡۘۘۖۙۘۘۧۧۨۘۧۤۨۗۧۗ۫ۤۘۜۨۡۘۘۖۘۘۤۧۘۘۛ۫ۥۙۚۗۙۥۙۢ۟ۦۘۨۥۡۘۢۛۧۙۛۜۢۛۨۦۥ۠ۙۡ۬۬ۧۢۢ۟ۚۜۗۜۘۜۙۥۘۥۜ";
                                continue;
                                continue;
                            case -178344920:
                                str = "ۨۥۖۨۗۙۨ۫ۛۜ۠ۧۤۢۨۨۘۨۘۙ۟ۗ۬ۢۘۘۘ۠ۖۘۥۗۖۜۜۜۢۢۜ۫۟ۦ۫۬ۢۤ۫ۘ۠ۛ۬ۛۨۥۦۥۗ۬ۘۘۜ۫ۘۡۢۦۘ۫ۜۜ۟ۗۦۥ۟ۘ۠ۚ۟ۢۢۜۘۜ۠ۙ۬ۢۜۙۦۘۙۛ";
                                continue;
                            case 2135983761:
                                String str13 = "ۥ۬ۢۙۖۢ۬ۛۚ۠۫ۚۤۚۨۘۙۢ۟ۨ۠ۥۘۚۚۡۘۢۦۡۘۗۤ۫ۖ۬ۧۡۖۛۖۥۜۘۥۢۨۧۙۚۧۖۢ۬ۙۤ۠۟ۦ۫ۨۘۥۥۖۦۦۚۖۚۙۛۘۢ۫۫ۨۡۡۨۙۖۗۘۧۜۘۡ۬ۖۘۧ۫ۖۜۗ۫ۤ۫ۨۚ۫ۖۥۚۧۧ۬ۡۘۡۨۢۖۖۙ۟ۡۘۗۘۖۡ۫ۡۘ۫ۚۦۘۙ۫ۤۙ۬ۥۛۡۘۗۧ۟ۜۤۖۘ";
                                while (true) {
                                    switch (str13.hashCode() ^ 1328557934) {
                                        case 1004557856:
                                            str12 = "ۤۥۥۤۤۚ۫ۡۡۙ۠۟ۡۛۨۘۚ۟ۨۧۧۖۘۗ۟۬ۡۨۦۘۧۖۥۘۦۙۘ۬ۨۨۘۛ۟ۦۚ۠ۨ۫ۥۜۘۗۛۖۦۡۛۖۖۥۡۧۛۘ۠ۢ۫ۗۛۨۡۡۚۛۗۡۦۘۗۦۦۘۗ۬ۙۛۢۚۘۥۘۜۗۦۘۖۘۜۜۖۧۥۚۙۨ۫ۗ۠ۤۡۘۖ۬ۥۘۡۖۘۡۧ۠ۤۥۗۢۚ۠ۚۤۥ";
                                            break;
                                        case 1021995270:
                                            String str14 = "ۗۢۨۘۚۙۛۖۥۦۘۜۘۛۙۚۡۚۡۦۘۙۥۧۘۡ۬ۤ۟ۗۛ۫ۚۥۗ۠ۤ۠ۙۘۤۘۙۛۖۨۘۛۖۥۛ۫ۥۘۨ۬ۢۙۥۥۗۤ۠ۜۥۘۘۜۘۢۨۡۨۖۢۛۨۙۤۥۦۜۘ";
                                            while (true) {
                                                switch (str14.hashCode() ^ (-462120150)) {
                                                    case -1548597637:
                                                        str13 = "ۗ۫ۥ۬ۤۚ۬ۖۚۦ۟ۤۗۦۤۗ۫ۨۛۧۘۧۗ۫۬ۖۘۙۧ۫ۗۖۤۙۛ۫ۢۥۦ۬ۙ۬ۚۜۦۘۘۖۦۘۤۖۘ۫ۛۙۚۚۡ۟ۜۧۡۤۖۜ۠ۢۖۚۜۨۛۗۚۨ۫۠ۢۜۛۨۙۜۦۗۜ۟۬ۨۘ";
                                                        break;
                                                    case 636596038:
                                                        str13 = "ۖۤۙ۫ۙۡۘ۬۫ۡۘۚۘۦۘۧۡۖۘۜۦ۬۬ۦ۫۬ۖۘۗۘۜۘۜۚۦۦۦ۠۫ۜۖۘۡۨۙۖۢۙۜۡۙۥۡۥۘ۟ۜۤۚۚۖۘ۟ۘ۬ۖۖۘ۟ۛۙۡۨۡۖۨ۟ۛۢۥ۠۬ۢۘۚۛۙۨۘۜۜۜۖۘۧ۠ۛۢ۠ۦۖۥ۬ۢۗۜۘۘۙۥۥۘۘۗۤۜۤۥۘۢ۟ۥۘۥۤۘۨۨۧ۠ۢ۠";
                                                        break;
                                                    case 660145853:
                                                        String str15 = "ۘۛۤ۫ۤۡۘۡۦۡۚۡۧۧۗۨۘۗۨۘ۬۬ۙۧۨۤۢ۫ۨۘۦۡۛۘۗۥۨۧۡۢۛۧۗۨۜۗۖۜ۬ۚۖۘ۫ۜۜۘ۫۬ۜ۠ۖ۫ۥۚ۫ۥ۬ۖ۬ۘۙۗۨۡۙۜۡۘ۟ۗ۬ۗۘ۟۬ۗۗۘ۟ۡۘۧۧۚۙۥۨۥۨۡۘۥ۠ۤۜۙۘۦ۬ۦۘۡۜۘۘۖۡ۫ۡۧۘۜۢۥۘ۟ۥۧۘ۟ۜۘ";
                                                        while (true) {
                                                            switch (str15.hashCode() ^ 1285759880) {
                                                                case -1391071490:
                                                                    str14 = "۟ۛۨۙۖۜۘۘۧۙ۟۠ۡۡ۬ۥۙۥۡۦۘۢۘۙ۬ۗۢ۫ۘ۠ۘۘۧۘۜۗۛۖۖ۠ۨۘۥۤۥۘ۠ۤۘۘ۫۟ۗۗ۟ۗ۫ۨۜۨۘۧۨۖۙۥۧۘۗ۬ۤ۬ۘ۬۬ۤۨۘۥۚۗ";
                                                                    break;
                                                                case -1291705578:
                                                                    String str16 = "ۘۙۜۘۦ۬ۧۢۛۘ۫ۛۛ۫ۤ۫ۤۤۖۡۛ۬ۡۢۖ۬ۡۘۘ۬ۦ۟ۤۖۘۛۧ۫ۢۚۗۨۤۖۘۤ۠ۧۚۖۥ۬ۗۦۖۤ۬۠ۦۧۘ۟ۘ۠ۢۤۥۘۜۦۡۜۦ۟۬ۘۥۘۤۖۥۘۡ۟ۙۘۥۧۘ۠ۡۤ۟ۥۘۘۢۥ۬ۦۖۦۘۦۦۘ۟۬ۢۨ۫ۗ۠ۜۦۘ";
                                                                    while (true) {
                                                                        switch (str16.hashCode() ^ (-620431364)) {
                                                                            case -1965609794:
                                                                                str15 = "ۥۨۦۤۖۥ۠ۦ۠ۖ۫ۛۖ۬ۦۘۛۢ۬۠ۛۗ۬ۚۢۨۡ۬ۥۜ۟ۗۥ۬ۖۗۡۤۜ۟ۙۥ۟ۡۧۜۜۛۨۘ۟ۜۦۘۢ۬ۖ۬۫۟ۛۛ۫۫۬ۛۥ۫۬ۧ۠ۡۘۦۙ۬۟۟ۙ۫۫ۦۢ۫ۜۙۙۗۘۧۘۖۡۛ";
                                                                                break;
                                                                            case -975365543:
                                                                                str16 = z ? "ۚۢۡۘۛۖۤۚۦۦۙۦ۬ۨۙۛۛۗ۬ۧۜۘۚ۟ۡۘ۬ۧۧۛۨۨ۫۫ۢ۠ۚۤۤۚۘۙۚۚۦۗ۫ۡۚۖۛ۫۬ۥۨۘۜۚ۫ۗۨۥۘۜۜۦۤۤۖۘۤۗۤۨۛۙۤۚۡۤ۟ۚۖ۠۫ۥ۟ۥۦۡۜۘۤۙ" : "ۜۨۜ۫ۧۛ۟ۘۨۘ۟ۡۢۚۖۘۘۜۢۨۘۡۖۡۘۗۨ۠ۨۤ۠۫ۙۖۥۦۥۘۗۘۚۜۡۡۘۧۛۢۛۤۜۨۥ۫۬ۘ۟۬ۖۤۥۨۦۘۥۢۦۘۙ۫ۦۢۨۘۛۧۧ۬ۥۖۘۦ۫ۙۨ۬ۧ۬ۘۙۢۧۘ۫ۖۚ";
                                                                            case 1289589558:
                                                                                str16 = "۠ۗۨۨۥۖۘۖۜۘ۠ۡۥۘۙۥۢۢ۫ۨۘۖۦ۬ۘۢۡۘۢۙۥۘۥ۬ۡۘۨۚ۫ۖ۬۟ۜۡۥۡۦۥ۬ۖۡۘۢ۫ۘۥۤۘۘۧۨۘۘۙۘۗۢۢۙۢۗۥۚۛۘۢۡۡۥۥ۠ۨ۬ۨۙ۠ۢۢ۟۟۟ۥۛۥۚۚ۬۬ۙ";
                                                                            case 1864896042:
                                                                                str15 = "ۡ۠ۥ۟ۥۜۙۛ۫ۖۤۛۙۤۨۙۘۜۢ۠ۘ۫۬ۜۘۚۗۥۜۧۢ۟ۛۚۧۡۖ۟ۙۖۛۛۤۚ۫ۡۙۜۗۚ۫۟ۨۧ۫ۜ۫ۘۘۙۘۗۚۚۦۤ۟ۡۥۨۛ۫ۢۙۖۤۗۧۨۚۧ۫ۘۘۥۦۜۛۦۙۨ۠ۖ۫ۥۥۘۨ۬ۦۘۤۡ۠۠ۙ۬ۖۤۨۜ۬ۧ۠ۖۙ۬۠ۘۜۗۘۘۗ۠ۜۢۡۥۘ۠ۚۨۘ۫ۦۢۚۦۧۘۦۖۥ";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case 321001337:
                                                                    str14 = "ۖ۠ۨۘۤۦۙۥۚۤۚۜۦۙ۟ۦ۬۠ۨۘۨۤ۫ۨۤۡۡۛۗۤۧۦ۠ۤۦ۬ۚۨۗۡۢۡۨۢۨ۫ۡۦۥ۠ۢۘۥۖۦۚۛۗۧۦۖۧۘۡۢۨۘ۟ۡ۬ۢ۠ۦ۟ۨۙۡۦۨۘۥۦۜۧۤۦۘۜۡۚۚ۬ۤۛۘۚ";
                                                                    break;
                                                                case 1269481822:
                                                                    str15 = "۟۠ۜۘۛۜۨۦ۬ۙۦ۬۠ۦ۬ۨۚۢۤۦۡۜۗۘ۟ۚۘۥۖۢۗۧۘۢ۫ۧۜۘۗۜۦ۫ۡۧۦۡۢۡۙۧۥۢۧۖۥ۬ۤ۫ۡ۠ۙۥۨۗۡۙۗۛۨۧۘۦۦۦۘۜۡۙۤۢۥۘۙۤۛۘۡۛ۟ۤۧۤ۟ۦ۫ۗۗ۫ۤۦۘۜۤۖۘۜۢۡۘۙۛۦ";
                                                            }
                                                        }
                                                        break;
                                                    case 1089854189:
                                                        str14 = "ۚۦۦۚۤۚۧۡۜۦۘۥۦ۬ۥۗۚۤ۬ۘۖۥۦۥۤ۬ۘۡۦۘۥۨۦۤۢۤۢۦۨۛ۫ۙ۬ۙ۠ۗۥۢۚۗۚۛ۟ۦۚۛۘۧ۫ۖۗۨۤ۫ۗۦۘ۠۬ۘۘ۟ۢۛۗ۠۟۬ۛۙ۫ۗۥۢۨۘۢ۠ۜۘۙۢۡۦۦۧۘۧۘۨۘۙۧ۬ۤۗۦۘ۠ۧ";
                                                }
                                            }
                                            break;
                                        case 1938906046:
                                            str12 = "ۥۗۨۘۤ۟ۡ۟ۘۥۘۙۨۚ۫ۢۨۡۥۧۨۚۘۘۥۤۤ۠ۛۢۧۙۡۜ۠ۚۗ۫ۘۙۥۗۧۙۖۘ۫ۗۥۘ۫ۦۡۢۡۖ۫ۥۦۡۜۧۘۦ۟ۨۘ۫ۛۗۢ۠ۚۖۘۥۙۖۡۘ۟ۡۜۘ";
                                            break;
                                        case 1965938885:
                                            str13 = "ۦ۬ۦۘۡۡۚۙۛۦۦۨۜۦۥۨۢۥۥۚۘۧۘۙۗۚ۠ۥ۬۬ۧۡۛۜۜۘۙۘۡۘ۫ۜۥ۬۫ۢۨۛۜۨۧۘ۟ۚۖۥۘ۬۫۫ۙۙ۠۟ۚۘۡۘ۬۫ۜ۠ۧۖۘۢۛۨۜۘ۫ۥۡۢۢۡۛۘۨۖۘ۠ۜۖ۟ۜ۟ۤۘۘۛۦۡۖۙۧۛۡۡ۟۟ۧۧ۫ۥۚۦۘۨ۟ۙۤۙۡۘ۬ۜۖۘ";
                                    }
                                }
                                break;
                        }
                    }
                    break;
            }
            str = "ۦ۟ۨۙۜۡۘۡۡۘۘۡۖۢۙ۠ۡۘۙۖۡۘۘۚ۫۠ۖۖۗۗۖۚ۠ۗۦۡۤۗۗ۟ۥۘۦۧۦۘۜۙۜۗۧۜۦۙۨۘۘۘۗۙۗۤۢ۫۠ۖ۟ۗۗۜ۠۫ۛۨۘۜۡۗۤۥۤۜۨۙۤۢۦ۠۬۬۫ۦ۬ۜ۠ۙ۟ۗۥۘۧۨۜۧۥۥۧۦ۠ۤ۬ۘۘۜۤۧۖ۫ۨۘۚۘۘۡ۬ۦۘۙۢۘۡۜۘۜۤۚۢ۠ۦۘۛۤۛۖۗۦ";
        }
    }

    /* JADX INFO: Access modifiers changed from: package-private */
    /* renamed from: lambda$onPostExecute$1$kentos-loader-Component-DownloadZip  reason: not valid java name */
    public /* synthetic */ void m246lambda$onPostExecute$1$kentosloaderComponentDownloadZip() {
        File filesDir = this.context.getFilesDir();
        File file = new File(filesDir, Deobfuscator$$app.getString(-3440729998232477513L));
        final boolean z = false;
        try {
            z = zip4j(file.getAbsolutePath(), filesDir.getAbsolutePath(), m81pw());
            String str = "ۧۥ۠ۖۗۤ۟ۛۢۧۨۨۨ۠۠ۧۚۜۙۘ۟ۜۘۘۜ۬ۡۥۛۖۦۗ۟ۙۙۖۘۚۙۧۡۘۖۘۙۥۧۘۙۤۖ۬ۛۚۜۜۨۗۢۜۧۤۦۥۡۙۛۤۦۚ۟۫۫۟ۖۘ۫۠ۢۖ۬۟ۢۤۤ۬ۘۧۘۙۛۛۡۜۘۡۙۨۘۤ۬ۜۚۜ۟۟ۚۘۘ";
            while (true) {
                switch (str.hashCode() ^ (-1803541294)) {
                    case -1585603918:
                        str = "ۙۤۚۡۚۘۘۥۦ۫۟ۖۗۘۨۡۥۗۨۘۛۖۘۧۥۜۘۡۙۡۘۘ۠۫ۘۤۛۨۨۤ۬ۗۘۤۥۖۖ۠ۦۘۙ۬ۘۚۡۖۢ۬ۛۦۨۦۘ۬ۚۚ۟ۜۥۙۗ۬ۧ۫ۥۧۛۗۡۥۡ۬ۢۗۢۗۛۥۤ۟۠ۘ۠ۘۧۢۘۧۙۚۧۚۛۤۡۘۘۗۖۦ۟ۙ";
                        break;
                    case -1380769684:
                        break;
                    case -99133815:
                        String str2 = "ۛۡۡۘۙۚۖۘۘۛۘۘ۫۟ۖۡۧۘۘ۠ۜۘۖۦ۬ۢۡۦۡۢ۟۬ۙۜۘ۠ۧۡۘۡ۫ۘۧۧۤ۬ۤۡۤۧ۠ۤۜۘۗۘۦۘۙ۠ۦ۬ۚۨۥۛۦۘۛ۟ۛۛۛۦۘ۬ۚۧۧ۫ۦۥۧۚ";
                        while (true) {
                            switch (str2.hashCode() ^ 1377936098) {
                                case -1929878258:
                                    str = "ۡۥۨۘۧۥۜۘۛۢۜ۫۬۟۠ۜۦۘۡۛ۬۟ۧ۬ۥۦۨ۠ۘۜۤۘۧ۫ۗۧۦۖۛۢۖۙ۫ۜۜۡۗۨۥۚۗۖۚۧۤ۬ۦۧۘۘۢ۬ۡۘۙ۠ۚۙۨۜۦۖۖۘۥۥۧۘۨ۫ۖۘۚۦۛۤۢۡۘ۟ۥ۬ۛۜۥ۫ۤۖۦۨۚ۬ۜۜۖ۬ۢۦۧۛۗۢۤۦۗۖۧۥۦ۠ۨۚۖۙۡۘ۟۟ۗ";
                                    continue;
                                case -1347338423:
                                    str = "ۙۜۦۗۥۖۘۢۨۧۘۖ۠ۙۧۥۚۦۨۛۡ۟ۘۗۨۢۗۘۨۚۧۚۙۗ۫ۗۡۚۜۤۖۜۘ۫ۧ۫ۨۘۡۧۘۘۡۗ۫ۜۛۚۧۗ۠ۙۤۢۧۦۤۖ۟ۘۥ۟۟ۖۦۚۖۖۘ۠ۜۚۖۜۛۨۡ۟ۡۘۜ۠ۥۚۢۚۧ۠ۢۥ۬ۥۚۦۘ۫ۡۧۘۥۛۤ۟ۨۘ۫ۦۜۘۤ۫ۙۦۛۤۖ۫۫ۘ۬ۢۗۨۘۚۙۨ۟ۗ۫";
                                    continue;
                                case -132188669:
                                    str2 = "۠ۘۖۖۘۖۘۨۤۚۡۛۚۢۙۘۘۨۙۜۘۙۖۨۘۥۜۥۘۜ۠ۤۙۢ۫ۗ۠ۗۡۢۗۙۖۥۜۢۨۘۗۡۢۦۘۢۧۨۧۗۘۨ۬۟۠ۡۜۡۗۢۛ۠ۦ۫ۦۡۜۙ۬ۨۘۧۖۨۨۜۜۘۗۧۡۘۡۢۦۘۜ۫ۦۘۨۧۛۙۧۖۧۚۨۘۡۦ۫ۤۜۗۢۚۗۢۛۡۗۥۡۥۚۜۧۙۦۘ۠ۨ۬ۖ۠ۨۚۤۖ۟ۤ۟۟ۛۢۥۘۘ";
                                case 1328726349:
                                    String str3 = "ۡ۬ۘۖۖۗۧ۫۬۫ۤۧۦۜۘۘۘۖۗۜۢۘۘۢ۟ۖ۬ۡۧ۫ۛۜ۟ۙۤۛۤۨۖۖۗۢۦۧۨۦۗۛۡۦۘۜۢ۬ۜۖۧۘۤۥۛ۬ۥۖۦۨۚۥۘۘۤ۬۬ۨ۟ۛۛۛۗ۬ۥ۬ۛۛ۠ۙ۬ۨۘۥۘۨۦۨۘۥۢ۫ۧۘۥۨۥۘ۟ۤۦۘۙۥۜۘ۟ۤۖۙۨۥ۠۠ۡۘۤۜۙۢۖ۟ۗۜ۫ۘۢۗۘۛۛۡۧۘۘ۬ۚ";
                                    while (true) {
                                        switch (str3.hashCode() ^ 1903657837) {
                                            case -1589184850:
                                                str3 = "ۘۖۡۘۧۚۛۨۥۘۘۙۚۜۖۖۛۙۖۧۤۢۛۦۘۦۨۘۘۜ۟۫۟ۜۡۦۛۡۤۡۙۨۘۜۘ۬ۗۦۘۡۦۜۘۛۖۗۨۘۜۘۗۡ۟۟ۡۙۙ۟۬ۤۙۖۡۗۜۚۡۘۘۦۚۥۘۨۥۢ۬ۜۤۧۛۥۘ۫ۙۖ۫ۡۖ";
                                            case -1569105913:
                                                str2 = "ۙ۟ۚۜۢۢۜۛ۟ۘۙۦ۟ۘۘۥۙۨۘۥۢ۬۫۟ۗ۠ۨۗۥۡۘۘ۫ۢۥۘۥۤۢۦۢۗۡۦۨۗۙۖۤۤۨۘۛۨۡۘ۬ۡۜۛ۟ۡۤۜۜۘۤ۫ۖۘۖۗۤۧۖۘۘۜۛۘۘۢۡۜۦۜۥۗۙۘۘۥۖ۬ۥۤۜۚۥۥۘۡ۬ۡۘ۟ۛۤۜ۠ۦۘۙۤۨۚۤۖ";
                                                break;
                                            case -379806215:
                                                str2 = "ۥۗۤۧۦۥۘۙ۟ۥۧ۫ۥۘۚ۬ۘ۬ۡۗۦۘۖۡۖۥۘ۠ۙۜۘۖ۠۬۠۬ۤۢۜۧۘۨۦۖۘۡۤ۬ۙۥۥۗ۟ۖۘ۟۟ۡۧۖۧۘۥ۟ۡۙۙ۟ۤۘۜۚۘ۫ۨۜۘۘۥۨۜ۠ۘۘ";
                                                break;
                                            case 193606277:
                                                String str4 = "ۖ۬ۨۗۗۘ۟ۨ۫ۦ۫ۜۙ۫ۥۧۧۤۦۤۡۥۦۘۘۚۘ۫ۚۛ۬ۖۘۦ۟۠۫ۤۤۨۜۦۢۥۗۦۘ۟ۗۢۚۖ۟۠۬ۡۘۧۨ۫ۨۥۦۥۨۦۚۤۖۘۤ۠ۘ۟ۚۜۘۤۥ۟۟ۙۨۖۚۤۗۙۤۤۚۘۨۧۨۤۡۖۘ۫ۧ۠۠ۗۘۘۨۦۛۛ۠۠";
                                                while (true) {
                                                    switch (str4.hashCode() ^ (-1853942331)) {
                                                        case -1614445492:
                                                            str3 = "ۛۖۛۨۚۚۜۙۥۘۨۖۧۧۘ۬ۘۗۡ۫ۗۘ۟ۨۘۨۜۤۢ۟ۜۘ۟ۦ۫۬ۖۡۘ۬۫ۨۘۤ۟ۗۖۘ۫ۢۢۗۢۖۖۘۘۧۧۖۗۖۘۢ۫۫۟۟ۘۘۥۢ۬ۖ۬ۡۘۘۥۖۘۢۘۨۗۛۨۘۘۚۜۘ۫ۥۚۛۥۤۥۢۤۛۡۘۜۦۥۜ۫ۚۙۥۖۘۜۘۘۨ۟ۥۢ۫ۡ۬ۙۤۥۦۘۖۦۜۚۙ۟۫ۧۚۤۜۧۜۥۦۘۛۖ";
                                                            break;
                                                        case -1467233789:
                                                            str3 = "۬ۨۜۘۡۢۗۙۚۤۛۛۙۚۦۖۘۢ۠ۚۘۡۖۡ۟ۘۘ۫ۤۤۗۙۜ۠ۡۢۖۙۖۘۜ۫ۥۘۙۦۙ۫ۡۙ۠ۙۥۘ۠۟ۘۤۢۨۘ۟۬۠ۢۚۧۚۥۦۛۛۛۚۡۜۘۦۗ۫۟ۘۧۘۧۛ۠ۚۨ۟ۘ۫ۡۘ۫ۙۦۖۧۦۘ";
                                                            break;
                                                        case -393074217:
                                                            String str5 = "ۖۤۖ۟۟ۖۘۚۢۖۦۧۚۨۧۡۢۡۢۗ۬۟ۡۖۨۙۦۥۗۗ۟ۧۙۦۡۤۨۘۜۘ۟۫ۙۥ۟ۘ۬۫ۙۦۧۘۨۚۦۘۖۦۦۡۧۨۨۥۢ۠ۥۖۥۤۚۡۥۨۘ۬ۗۦۙۨۥ۫ۗۨۘۦۜ۟ۢۢۨۘ۬۫ۙ";
                                                            while (true) {
                                                                switch (str5.hashCode() ^ 1097693206) {
                                                                    case -419602250:
                                                                        str5 = file.exists() ? "ۦۡۢۛۡۥۘۢۤۨۘۧۥۧۘۦۧۘۘۚۨۚ۟ۦۘۤۦۙ۬ۗۘ۫۟ۧۢ۫ۨۘۖۚۛۨۖۜۘۢ۫۬ۨۥۘۥۧ۫ۜۥ۬ۙۖۖۡۜۜۘۗۚۢ۟ۘ۫۬ۘۛۤۖ۟ۖۦۘۘۜۘۙۙۚ۠ۢۢۙۧۨۘۥ۟ۦۘۧۗ۫ۙۧۨۗۡۨۘۢۗ۠ۢۛۤۘۛۘ" : "ۧۙۦۘۜۢۗۖۜۖۘۘۡۙ۟ۨۖۘۚۤۢۚۜۘ۠ۧۤۙۜۡۘۧ۠ۜۚۡۢ۫ۡۘ۟ۖ۫ۗۥۥۘۖۜ۟ۘۡۦۘۤۘۨۘۖۦۛۧۦۛۤۨۢۘۨۗۨۤ۠ۜ۠۠ۙۛۘۨۦۧۘ۟ۗۙۡ۟ۢ۫۠ۤۙۡۥۨ";
                                                                    case -175137848:
                                                                        str4 = "ۙۖۨ۠ۚۤۡۗۡۘۘۛۗۚ۬ۚۘۚۜۡ۠ۡ۠ۜۡۙۖۘۥ۬ۙۙۚۧۜۘۦ۬ۡۘۛۧۤۛۦۥۙۢۥۚۜۥۧ۬ۨ۫ۤۜۘۧۦۥۘۙۛۘ۟۠۬ۤۜۛ۟۟ۜۘۗۨۨۘۦۖۙۛ۬ۥۘۤۛ۬ۤۨ۫ۧۙۥ";
                                                                        break;
                                                                    case 1228397717:
                                                                        str5 = "ۜۛ۫۬ۛۦۘۡۜۢۙۦ۬ۗ۫ۙۙۢۡۘۙۤۙۤ۫ۨۤۘ۟ۘۨۘۦ۬ۜۤۘۖۘ۟ۧۨۘۥۛۘۘۧۤۨۘ۠ۢۡۜۥۘۘۘۖ۬ۖۛۖۨۜۦ۠ۥۥۤۖ۠ۖۥ۬ۜۘۡۘ۫ۧۢۨۘۤۢ۠ۚۧۜۥ۟ۚۥۤۡۗۦۦۗۧۖۘۥۗۖ۟ۢۚۙۥۦۜۗۧۛۚۥ۬ۘۘۢ۟ۥۜۦۨۘۥۡۖۘۙ۠ۘۘ۬ۚۡۘۜۜۜۖۛ";
                                                                    case 1809139070:
                                                                        str4 = "ۦۜۜۘ۫ۤۧۧ۬ۜ۫ۜۖۡۘ۠ۤۜۘ۫ۦۙۘۜۚۛۛۢ۬ۛۦۘۚۦۚۤۡۘۨ۬۫ۥۡۡۘۢ۟ۜۦۡۖ۬۠ۗ۬ۖۛۗۘ۬۬ۧ۬ۘۤۡۖۘ۟ۙ۠ۧۦۡۡ۫۠۫ۢۜۢۛ۟ۨۘۗۦۘۘۗۛۜۘۜۗ۫ۗۛۥۘۤۦ۫ۨۘ۟ۙ۬ۘۗۢ۫ۖۖۛۡۗۡ۠ۗۡۘۘۘ۠ۤۜۘۛۢۚ۟ۤۙۤۖۜۨۚۜۘۢ۫ۥۘ";
                                                                        break;
                                                                }
                                                            }
                                                            break;
                                                        case 1532257318:
                                                            str4 = "ۗۛ۟ۛۧۥۘۘۦ۬ۥۘۜ۟ۦۧۘۦۘۖۡۧۤۛۗۜۘۡۧۖۘۗۦۦ۬ۧۙۛ۠ۧۨۨۘۖۗۜۜۚۦۘۥۨۤۗۤۢۨۘ۫ۢۡۙۧۦ۠۬ۖۦۥ۠ۙ۟ۛۥۘۢۙۛ۟۬ۜۘۖ۬۫ۗۡۡۘ۠ۜۤۚۢۚ۬ۙ۫ۦۗۦ۬ۢ۟ۖ۫ۚۡۜۘۘۛۥۥۘ";
                                                    }
                                                }
                                                break;
                                        }
                                    }
                                    break;
                            }
                        }
                        break;
                    case 1109575563:
                        file.delete();
                        break;
                }
            }
        } catch (Exception e) {
            e.printStackTrace();
        }
        new Handler(Looper.getMainLooper()).post(new Runnable(this, z) { // from class: kentos.loader.Component.DownloadZip$$ExternalSyntheticLambda1
            public final DownloadZip f$0;
            public final boolean f$1;

            {
                this.f$0 = this;
                this.f$1 = z;
            }

            @Override // java.lang.Runnable
            public final void run() {
                String str6 = "ۚۘۜۦۛۘۡۨۚۖۙۗۛۥۢ۟ۖۜ۬ۦۙۦۚۖ۟ۦۧۘۡۛۡ۠ۨۘۦ۬۫ۥۜۘۘۜۖۘۘ۟ۧۢۚۙۙۡۛۢۗ۬ۙۤۗۢۖ۫ۡۤۡۘۚۚۘۘۛۙۢ۟ۤۖۘۚۨۗۡۨۤۢ۠ۜۘ۠ۡۤۙۛ۟ۦ۟۠";
                while (true) {
                    switch ((((((((((((((((((((((((((((((((str6.hashCode() ^ 565) ^ 867) ^ 32) ^ 344) ^ 279) ^ 981) ^ 723) ^ 786) ^ 652) ^ 478) ^ 973) ^ 509) ^ 901) ^ 574) ^ 537) ^ 154) ^ 748) ^ 196) ^ 765) ^ 707) ^ 718) ^ 296) ^ 841) ^ 835) ^ 658) ^ 531) ^ 791) ^ 998) ^ 136) ^ 960) ^ 847) ^ (-2138799537)) {
                        case -440484862:
                            str6 = "ۡۖۚۡۤۥۖۥ۫ۘۛۥۗ۬ۤۚۢۨۙ۬ۥۘۛ۫۟ۤ۬ۧ۬۬ۤۖۨۧۖۤ۟ۡۦۗۘ۬۬ۤۨۡۘۘۙۧۦۡۤۜۚ۟ۛۦۜ۬ۚۧ۟۠ۖۘۤۚ۟ۧۥۨۛۧۖ۬ۙۘۛ۬۟ۗۙۘۖۡۥۘۙۛۦۥۜۘۘ۠ۘۥۘۡۧۚۖۦۥۢۛۛۨ۟ۧ";
                            break;
                        case -242746484:
                            return;
                        case 957676206:
                            this.f$0.m245lambda$onPostExecute$0$kentosloaderComponentDownloadZip(this.f$1);
                            str6 = "۬ۛۧ۠ۖۘۡ۠ۗۛۡۘۚ۫ۖۘۜۙ۫ۡۡۘۛۥ۫ۦۗۛۜۘۦۘۡۛۨ۬ۚۖۘۖۥۘ۬ۨۦ۫ۗۨۘۢۛۛۤۧۙۗۙۖۘۘۗۥۘۡ۠ۛۖۨۡۨۢۙۡۨۗ۫ۗ۫۬۫ۛۨۛۥ۫ۛۧۦۢۗۢۧۙۚۢۡ۬ۙۗ۫ۥۙۙ۬۬ۖۡۧۚ۠ۦۘۢۛۜۘۖۙۘۢۦ۬ۡ۠ۖ۠۟ۗ۠ۤۥ۠۠ۢۛۤ۠ۧۜۥۘۚ۟ۖ";
                            break;
                    }
                }
            }
        });
    }

    @Override // android.os.AsyncTask
    protected /* bridge */ /* synthetic */ void onPostExecute(String str) {
        String str2 = "۫ۦۙۢۢۚ۬۟۟ۛۗۘ۠۫۬۠ۧۡۘۖۛۚ۫۬ۡۥۤۖۢۖ۫ۗۖۖۢۡۢ۫ۤۡۘۥۘۨۘ۬ۡۘۡۨۥۢۦۘۘ۫ۡۜۡۛۡۦۡۥۜۘۘۘۘ۫ۧ۟ۤۢ۟۟ۙۡۢۘۘۨۙۥۘ۫ۥ۠ۥۘ۠ۖۡۜۘ۬ۥۨ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 294) ^ 82) ^ 32) ^ 43) ^ 437) ^ 620) ^ StatusLine.HTTP_PERM_REDIRECT) ^ 554) ^ 538) ^ 25) ^ 920) ^ PointerIconCompat.TYPE_TEXT) ^ 112) ^ 770) ^ 624) ^ 256) ^ 363) ^ 935) ^ 412) ^ 808) ^ 823) ^ 956) ^ 844) ^ 240) ^ 341) ^ 160) ^ 354) ^ 489) ^ 194) ^ 67) ^ 851) ^ (-547433879)) {
                case -1474874995:
                    str2 = "۫ۨۧۘۧۦۦۘ۠ۚۡۤۡۛۢۧ۠ۤ۟ۢۦۥۜۛۤۦۘۘۙۖۘۗۙۥ۟ۜۘ۠۠ۜۥۥۗ۟۫ۧۦۤۚۨۤۘۘ۟ۙۘۘۗ۬ۥۘۡۡۜۗۦۗۗۥۘ۟۠ۥۤۙۚۦۚۖۦۘۘ";
                    break;
                case -1468152861:
                    onPostExecute2(str);
                    str2 = "۠ۖۡۘۗۧۜۧۘۗۙۡۛۖۤۜ۟۟ۨۘۚۢۦۛۤۢۛۧۘۘۛۚۥۘ۟ۢۨۘۚ۫ۦۘۨ۠ۦۘۥ۫ۙۤۡۘۘ۬ۡۥۛۙۥۘۡ۬ۤۖۧۘۚ۟ۜۥۜ۬ۘ۟ۡۧۜۧ۟ۜ۬ۤۖۘ۫ۤۜۘۚۖۖۘۙۥۨ۟۟۬ۘ۟ۢۘۖۨۘۨۧۤ۬ۙۖۘۢۤۦۘۧ۟ۨۜۥۘ۫۠ۘۘۡۨۧۘۜۙۥۥۗۤ۟ۨۦۘۢۡۡۥ۬ۖۙ۫ۤۢۙۘ";
                    break;
                case -792463587:
                    return;
                case 1874613454:
                    str2 = "ۘ۫ۛۖۢ۠ۨۜۘۘۧ۬ۛۚۘ۬ۧۖۦ۟ۤۖۚۢ۫ۙۥ۠ۙۢۥۘۘۚۧۨۘۨ۟ۡۖۧۚۚۙۘۘۜۤۡۤۚۗۥۘۜۘۧۡۙ۟ۡۧ۟ۙۦۧۗ۠۬ۚ۫ۛۥ۟ۚۥۚ۬ۚۥۤۤۥۘۦ۟ۛۛۖۥۨۧۤ۫ۡۤ۟۫ۙ۟ۦ۠ۙ۠ۥۘ۫ۜۦۚۖۗۥۨۘۥۙۦۛۧ۬۠ۘۘۘ";
                    break;
            }
        }
    }

    /*  JADX ERROR: JadxRuntimeException in pass: BlockProcessor
        jadx.core.utils.exceptions.JadxRuntimeException: CFG modification limit reached, blocks count: 353
        	at jadx.core.dex.visitors.blocks.BlockProcessor.processBlocksTree(BlockProcessor.java:59)
        	at jadx.core.dex.visitors.blocks.BlockProcessor.visit(BlockProcessor.java:39)
        */
    /* renamed from: onPostExecute  reason: avoid collision after fix types in other method */
    protected void onPostExecute2(java.lang.String r11) {
        /*
            Method dump skipped, instructions count: 1092
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: kentos.loader.Component.DownloadZip.onPostExecute2(java.lang.String):void");
    }

    @Override // android.os.AsyncTask
    protected void onPreExecute() {
        LinearLayout linearLayout = null;
        int i = 0;
        GradientDrawable gradientDrawable = null;
        ImageView imageView = null;
        LinearLayout.LayoutParams layoutParams = null;
        TextView textView = null;
        LinearLayout.LayoutParams layoutParams2 = null;
        LinearLayout.LayoutParams layoutParams3 = null;
        AlertDialog alertDialog = null;
        String str = "ۖ۠ۘۥۙۦۢۗۖۘ۠۬ۗۚۘۜۢۢۜۘۚۛۥۘۧ۟۠ۖۡۡ۫۫۫ۙ۫ۜۚۙۧۚۤۖۧ۠ۦۥۜۘۚۖۢ۫۟ۥۡ۟۫ۨۤ۫ۥۘ۟ۥ۠ۥۙۖ۬ۦ۟ۗۢۖۘۘۚۢۡۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 276) ^ 146) ^ 724) ^ 139) ^ 280) ^ 583) ^ 884) ^ 826) ^ 571) ^ 270) ^ 465) ^ 895) ^ 595) ^ 355) ^ 330) ^ 751) ^ 940) ^ 765) ^ 27) ^ FileUtils.FileMode.MODE_755) ^ 296) ^ 414) ^ 705) ^ 850) ^ 264) ^ 660) ^ 686) ^ 868) ^ 231) ^ 415) ^ 357) ^ (-1126036207)) {
                case -1925657342:
                    layoutParams3.topMargin = m82dp(this.context, 12);
                    str = "ۜۖ۠۠ۨۡۘ۟ۜۖۘ۟ۚۚۛۖۜۢۤۛۗۚۜ۟ۘۘۧ۬ۥۥۛۖۘ۬ۧۖۘۖۗۨۘۥۨۧۥۘۜۛ۟ۘۘۤ۬ۖ۬ۖۧۢ۟ۘۘ۠ۧ۟۟۫ۧۤۘۚۚۜۗۤ۟۠ۦۗۙۘۚۥۘ۟۟ۤۤۙۙۨۦۘۖۦۙۦۛۡۜۗۨۘۖۖۧۘۗۛۜۘۡۡۦۘۙۗۘۘ۠ۢۜۘۙۦۧۢۙۥۥۦ۠";
                    break;
                case -1853981346:
                    String str2 = "ۖۢۥۘۥۨ۟۟ۡۡۘۢۨۨۘۚ۬ۦۘۢۧ۫ۥۢۖۧۛۦۘۜ۠ۧۚۨۘۛۛۡۘۨۘۥۘ۟ۛۡۛۜۥۘۛۢۘۢۗۚۤۛۡۘ۫۬ۚ۟ۖۛ۬ۡۦۗ۫ۗۧۗۘۘ۬ۤۗۗۨۘۡ۠ۜ۠ۙ۫ۨۨۙ۫ۖۚۘ۟ۛۜۜۢ۬ۚ۠ۙۡۗۡۙ۫۠۬۟ۥۖۥۘۛ۟۠۫ۜۨۛ۬ۦ۟ۦۥۨ۬ۛ";
                    while (true) {
                        switch (str2.hashCode() ^ (-1771315642)) {
                            case -1726612773:
                                str = "ۘۤۦۦۡۦۘۥۚ۫ۡۧۦۢۗۡۘۗ۠ۜۢۛۨۜ۟ۛۖ۫ۤۚۧۧ۬ۘۘۤۛۢ۫ۦۘۨۙۘۘۚۤۘۘ۬۠ۜۘۤۡ۬ۘۚۦۘۥۥ۫ۨۚۥۜ۫ۨۘ۠ۛۖۘۖۜۛ۬ۥۡۘۙ۬ۢۖۖۢۜۚۘۘۤۜۛۡۗۖۘۙ۠ۨۚۤۚۚۧۖۨۡۖ۟ۥۘ۟ۚۘۘۗۖۖۘۗۧۘ۫ۧۗۛۜۜۚۦۥۘۚۨۡۘ۫ۛۥۘۘ۬۫ۛۦۥۖۤۜ";
                                continue;
                            case -638607467:
                                String str3 = "ۗۤ۫۠ۙۘۘ۠ۗۦۦۖۘۗ۟ۗۛۤۘ۫ۛۘ۟ۛۡۤۡۘۙ۟ۜۘ۫۫ۜۘ۬ۙۥۘ۟ۛۤۡۧۖۦۢ۫ۖۖۙۗۤۥۢۨۘۨۨ۠ۛۙۛۙۤۡۘۚ۠۟ۦۛۡۧۗۛ۟ۙۚۜۜ۠ۖۘۡۘۘۤ۬۟ۚۢۧۗۖۗ۠ۜۗۖۜۜۡۖۦ۟ۢ۠ۗ";
                                while (true) {
                                    switch (str3.hashCode() ^ 955139607) {
                                        case -372946010:
                                            str2 = "ۦ۫۬ۥۛۦۘ۫ۥۙۚ۠ۗۗۧۖ۬۬ۥۘۥ۫ۘۖۙ۟ۢۗۙۚۨۨۘ۟ۥۢۧۖۘ۬ۗۡۘۘۙ۫ۥ۫ۤۚۤۛ۟ۙۡۘ۫ۜۘۤۡۨۜۤۘۢۦ۫ۚۜۨۘۨۛۛۖۘۧ۫ۚۜۢۨۘۢ۟ۜۘ۠ۨ۟ۛۖۖۤۤۡۗۘۚۢ۫ۖ۫۫ۥۘۘۘۨۘۨ۫ۖۘۚۖۖۘۥۨۥۙۚۛۨۡۖۖ۠۬";
                                            break;
                                        case -82343331:
                                            str2 = "ۘۚۙۥۡۖۘۛۙ۠ۘۧۖ۫ۡۘۦۦۘۘۨ۬ۨۘۥۦۛ۟۠ۗ۬۬ۙۚۙۦۘۘۗۖۤ۟ۖۘ۟ۢ۬ۙۢۘۘۖ۬۟ۖۢۥۘ۫۬ۨۘۤۚۙۡۦۘۧۗۡۘۛۨۖۘۦ۬ۜۘ۫ۛۤۨۜۦ۫۫۟۠۠ۙۛۙۜۧۦۘۜۡ۫ۨۢ۫ۥ۫ۨۘۡۛۘۘۧ۬ۜ۫ۜۘۜۖۤۘۢ۠ۖۢۜۙۦۜۤۗ۫ۚۤۤۛ۫ۦۘۤۗۗۖۛۨ";
                                            break;
                                        case 669153033:
                                            String str4 = "۠۟ۖۘۛۡۦۜ۫ۘۘۥۥ۫ۘۗۡۘۢۜۥۘۚ۬ۖۧۚۜۘ۫۬ۧ۬۬ۦۗۚۡۘۜۚۘ۬۬ۙۦۗۙۥۖۦۘۘۛۜۘۤۤۜۢ۟ۖۙۢۥ۬ۧۦۦ۠۟ۤۧۗۗۦۘۛۧۜۛۖۧۘۨ۟ۙۗۤۥۙۤۤۨۦۥ۫ۗۢۘ۫ۦۢ۟ۖۨۢ۬ۚۛ۠ۦۖۘۛۤۡۜ۟ۨ۟ۢۤۖۙۨۥۢۤۜۧۡۘۦۦۥۛۖۨۘۘ۬۟ۗۨۘ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 613415163) {
                                                    case -2063489677:
                                                        str3 = "۫ۜ۬۠ۧۨ۬ۢۚ۫۠ۚۥۢۛۗ۠ۗ۬ۙۘۡ۬ۤۘۚ۬ۦۥۚ۠ۧۜۤۥۜ۫ۥۜ۬ۖۨۘۙ۟ۜۨۥۘۗۥۦ۬ۘۚۜۜۚۥۗ۫ۥ۟ۙۗۜ۬ۤۨۛۧۧۙۤۘۘ۠ۛ۠ۚ۠۬۟ۙۘۧۦۧۗۚۥۤۡ۬۫۬ۨۘ۟ۘۡۥۛۧۖۢۨ";
                                                        break;
                                                    case -1820590672:
                                                        str3 = "۟ۦۜۘۙۥۜۗۘۘۦۙۤ۬۠ۙۥۙۚۛ۠ۧۥۛۦۡ۠ۚۤۥۦۘ۫ۥۥ۠ۦۦۘۡۢۦۘۦۦۖۚ۟ۨۘۡۨۧ۟ۘ۠ۗۥۦۘۙ۠ۘۛۛۦۘۤۖۘۘۨۖۗۙۢۦۘ۫ۡۧ۬ۥۘ";
                                                        break;
                                                    case -1373970561:
                                                        str4 = "ۥۛۢ۟۟ۡۘ۠ۦۖۘۗۖۨۘۡۙ۫ۜۤۚۗ۟ۜۦ۠ۡۜۙۗ۫ۖۘۤۡۦۘ۠ۖۦۨۥ۫ۡۛۚۘۖۗ۟ۨۥۛۖۤۙۜۛ۬ۛۦ۬ۦۥۚۘۤۘۦۜۗ۟۬ۧۚۢ۠۫ۡۤ۟ۢ۬ۦ۟ۤۜۡۙۖ۟ۖۢۧۗۡ۟ۗ۟ۘۤۖۖۦۨۜۗ";
                                                    case -1313091720:
                                                        String str5 = "ۧۘۨۡۧۢۨ۬ۨۘۧ۬ۧۦۧۜۘۨۚۖۘۢۦۦۘۡ۠۫ۢۘۙ۠۫۬ۘۤۧۚۧ۫ۙ۫ۘۧۢۢۙۛۛۡۘۧۛۥۨۗۗ۠ۢۜۗۖ۟ۢ۠ۜ۫ۖۛۤۛ۬ۥۘۡۤۡۘۙۗۦۘ۠۬ۙ۟ۧۖۖ۠ۜۘۘۨۡۘۖۨۥۘ۠۬ۥۘ۟ۨۘۘۤ۠۟ۗ۟ۜۚۢ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ (-1656594442)) {
                                                                case -1104962475:
                                                                    str4 = "۫ۜۚۜۜۖۘۥۢ۬ۗۦۨ۟ۦۦۘۗۢۦۘۙ۫ۘ۠۠ۧۥ۫ۚۙۨۦۡۨۚ۠۠ۦۙۦ۠ۘۥ۫ۡ۫ۙۚۧۦۖۥ۠ۗۛۘۤۡۨۜۨۡۖۜۘۗۗۨۘۡۜۛ۬ۧۨۘ۫ۤۤۦۧۜ۬۬ۖۘۜۥۖۘۦۥۥۦۗۦۘ۟۟۫۟ۗۜۘۨ۬ۛۘ۟ۜۘۜ۟ۦۙۖۜۗۛۜ۬ۦۖۘۗۜۨ۟ۚۤ";
                                                                    break;
                                                                case -586922253:
                                                                    String str6 = "ۚۜۡۘۚۚۤ۟ۦ۬ۥۦۤۘۗۢۥ۠۫ۖۧۘۘ۫ۨۘ۠ۛۦۘ۟ۜ۠ۘۢۦۥۢۖۥ۫ۦۘۤۢۨۘۚۢ۬۠ۨۤ۟۟ۥۘۙۨۨۧۢۘۚۘۡۜ۟ۡۘ۠ۤۤ۬ۧ۟ۜ۬ۖ۟ۡۡ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ 2073298073) {
                                                                            case -1803149841:
                                                                                str5 = "ۛۘۘۘۚ۬ۧ۫ۗۘۘۤۙۤۖۜۚۧۖۖ۟۬ۘۤۡۘ۬ۙۨ۫ۨۦۘۚ۬ۢۜ۟ۘۜۗۦۘۤۘۖۢۨۧۘۡۘۦۘۛۨۖۨۨۖ۫ۢۡۘۧۧۖ۬ۜۖۘۨۦۧ۟ۘۗۖۜۦۘ۟ۧ۬ۦۜۤۨۡۧۘۡۚۚۥۧۘۖۨ۠ۜ۬ۦۘۥ۟ۦۜۜۥ۫ۨ۟ۨۤ";
                                                                                break;
                                                                            case -141584735:
                                                                                str6 = "ۢۚ۬ۨۙۨۘۚۤۦۘ۬ۧۡۘۢۗۙ۟ۡۖۘۧۥۜ۫ۙۨۥۡۤۜۧۘۧۛۗۤۘۦۚۙۦۘۢ۠۬ۧۨۦۘۙۢۗۡۦۦۘۦۘۨۘ۟۟ۙۚۤۗۖ۟۟ۚۨ۠۬ۙۛۢ۬ۖۢۗۖۘ۟ۧۙۧ۫ۚۗۦۦۗۡۘۧۥۡۨۤۗۜۗ۠ۘۙۜ۟۠ۖۖۚۥۘ۫ۡۢۥۡۘۢۗ۠ۗۛۛ۠ۢۥ";
                                                                            case 1072564382:
                                                                                str5 = "۟ۖ۫۬ۦۥۘۚۖۦۛۨۡۢۜۗۗۧۘۘۛۘۜۘ۫ۗۜۡۨۘ۬ۤۡ۫ۜۚۡۜۘۘۡ۫ۥۢۦۡۘۙۗ۬ۥۨۦ۬ۡۖۧۛۗ۫ۡۖۢۘۦۡ۠ۦۘۚۚۡۖۨۙۙۥۥ۠ۦۛ۬ۧۦۘۨۙۢۛۜۖۘ۠ۡۘۖۘۘۢۛۡۘ۠ۜۡۘۚۥۥۘۛۢۧ۬ۢۖ";
                                                                                break;
                                                                            case 1353041631:
                                                                                str6 = this.customProgressDialog.getWindow() != null ? "ۗۘۧۘۨۧۜۜۚۤۜۙ۟ۚ۠ۦ۫ۚۘۗۖۡۚۛۗۖۥۧ۠ۗۥۦ۠ۘۤ۟ۥۘۧۚۖۢۛ۠ۨۤۥۧۚۚۢ۟ۙۦۘۢۦۡۤۘۥۜۧۘۡۙۛۜۘۤۗۖۜۡۜۘۗۢۧ" : "ۨ۬ۡۘۙۦۛ۟۬ۥۦۢۛۚۦ۠ۙۦۧۘۘۥۢۘ۟ۨۘ۟ۛ۬ۙ۬۟۠ۜۡۨۧۜۘۖ۬۬ۗۚ۠ۥ۬۠۟ۧۘۧۗۜۘۢۡۜۘ۟ۢۚۧۗۚۧۙۧۜۗۖۘۥ۟ۨۘۛۡۡۘۨۨۘۘۖۚۛۖۦ۬ۚۚۥ۬ۡۜۦۘۧۧۘۘ۬ۨۦۦۢ۬ۚۦۖۡۛ۫ۙۡۘۨۚ۠ۗۧۥۘۦ۫ۤۜۦۧۡۨۧۛۥۘۘۙۘۙۨۥۥۡۦ";
                                                                        }
                                                                    }
                                                                    break;
                                                                case -349581486:
                                                                    str5 = "ۜۙۨۘ۫ۘۗۧۡۧۘۚ۫ۦۘ۬۠ۡۤۡۧۗۥۡۘۖۤۧۨ۟ۘۘ۟ۖۢ۬ۥۨۘۨۧۙۨۛ۬ۡ۠۬ۜ۬ۖ۟ۚۥۜۘۨۘ۫۬۠۬ۜ۬ۨۘۗۢ۠ۜ۬۫ۦۙۨۤ۟۫ۨۗ۬ۙۢۗۖۘۦۘۥۘۢۙۙۡۘۜ۟۬";
                                                                case 830269528:
                                                                    str4 = "ۤ۫ۘۘ۬ۚۜۘ۟۟ۗ۟ۦۥۢۗۤۢۤۘۘ۫ۥۡۧ۫ۦۘۦۚۡ۬۫ۧۢۦۘۜۚۗۢۗۘۘۤۤۨ۠۬ۡۘۢۗۡۘۚۗۦ۬ۗۥۧۚ۟ۙۚ۟ۜۜۘۘۚۦۜۜ۠ۜۥۥۘۗ۫ۖۚۤۦۘۜ۫ۡۖۜۗۘۢ۫ۗۢۘۛۗۛۡۜۘۗۜۜۛ۫ۦۜۥۨ";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1571642246:
                                            str3 = "ۜۤۥۗۗۖ۟۬ۤ۬ۧ۫ۤ۟ۚۜۦۥۘۥۖۘۗ۬ۥۜ۠۫ۘۤ۫۟ۜۥۘۖۖۘۦۚۦ۠۟ۚۘۡۚ۫ۛۛۗۚ۫ۢ۠ۨۘۤۡۧۘۛۥۚۨ۬ۦۖۗۖۜۦۥۢۥۡۗۨۖۘۡ۟ۥۡۘۘۧۗۜۘۖۥۨۥۥۡۡۢۘۘۛ۫ۡۙ۬ۢ۬ۧۨ۟ۤۥۚ۬ۗ۠ۨۦۘۢۢۥۙۧۡۤ۠ۗۢۜ۠ۦۤۖۘۜۖۛۡۧۗۡۙۜ";
                                    }
                                }
                                break;
                            case -471457180:
                                str = "۠ۖۢۘۜۖۘۘۡ۬ۚۥۨۘۛ۫ۢۨۚۧۧۨۚ۬ۜۤۛۦۖۘۦۤۖۘۤۛۧ۬۠ۦۘۡۜۢۖ۟۠ۤۖۘۘ۫۬۫ۜۗ۬ۨ۬ۧ۫۬ۦۘۙ۠ۜۨۡ۫ۢ۟ۘۘۗۚۧۥۚۧۚۡۢۜۘۖۘۤۙۚۘۙۤ۟ۚ۟ۛۡۖۗۡۘۘۦ۟۟ۨۦۜ۬ۛۜۖ۟ۗۚۗۙ۟ۘۡۖۦۦ۫۠ۗۘۜۛۨۖۙۨۢۧۧۚ۫ۙۥۘۦ";
                                continue;
                            case -191776533:
                                str2 = "ۙۨۦۙۥۥۘۖۗۢ۟ۚۤۜ۠۫ۛۤۙ۟ۘۖ۠۠ۜۘ۬۠۬ۨۘۤۙۛ۬ۡ۬۠ۡۖۦ۫۬ۜۘۧۧۖۘۤۦۜۘ۟ۖ۠ۤ۠ۤۜۘ۬ۢۨۛۚ۟ۡۘ۟۠ۚۥۚۜۘۡ۟۫ۡۜۥۘ۠ۥ۬ۧۘۤۜۙۙۦۚۡۘۜۖۦۘۤۢۗۤۥۙ۟ۨۜۘۙ۠ۚۢۗۡۛۡۤ۠ۧ۬ۡۡۖۨۨۡۘۨۦۜۘ";
                        }
                    }
                    break;
                case -1811595788:
                    gradientDrawable = new GradientDrawable();
                    str = "ۡۖۤ۬ۡۨۘۛۘۛۧ۠۠۬ۛۘۘۗۦۨۘۜۜۘۘۢۙۦۦۙۙ۫ۦۦۘۖۢۖ۬ۦۡۘۢ۫ۢۤۢۜ۟ۢۦۙۡۛۢۖۧۘ۬ۘۚۥۨۤۙۧۗ۟ۚۙۜۗۘۤۘۖۢ۫۟ۡۚ۬۫ۢۦۘۙۢۙۗۜۙ۬ۦۘ۠ۨۡ";
                    break;
                case -1682784696:
                    textView.setLayoutParams(layoutParams2);
                    str = "ۥۜ۫۟ۖ۬ۚۗۥۘۦۨۙۘ۠ۘۘۤۨۘۖۗۚۢۢۦۘ۫۟ۧۨۜۤۥ۠۠ۚ۬ۨۘۜ۠۫ۨۖۗ۬ۘۘۙ۫ۤۗۘۥۡۖۙۚۢۖۘۨۖۚۙۥ۫ۛ۟ۜۘۨ۬ۧۡۥۥ۫۫ۛ۫۠ۘۤۥۘۦۦۦۘۢۖۜۜۧۗ";
                    break;
                case -1650937053:
                    linearLayout.addView(imageView);
                    str = "ۢۥۖ۫ۡۗۙۥۘۧۙ۬ۛۗۧۧۥۦۘۗ۠ۚۖۙۖ۟ۦۥۘۗۢ۫ۤۛۡۘۜۧ۫ۥۧۖۘۖۧۧۧ۫ۛۚۛۥۘۦ۟ۙ۟۬ۨۨۗۘۦۖ۫ۦۤۛ۬ۛۛۖۦۚۧۡۘ۟ۜۤۛۗۨۨۦۜۚۛۘۘۛۢۙۢۡۚۚۙۖۘ۟ۖۙۨ۠ۘۘۢۗۨۘۧۘ۠";
                    break;
                case -1539683546:
                    gradientDrawable.setColor(-1);
                    str = "ۨۛۙ۠ۗۥۘۙۡۖ۠۠۬ۖۨ۠ۢ۠ۘۢۚۘۤۖ۠۬ۦۖۜۘ۬۠۠۠۠ۦۖۘۚۚۡۚۧۦۘۤۙۦۘۚ۫ۡۚۛۡۘ۫۫۫ۖ۬۬ۥۤۧۖۙۛۖۥۘۡۧۦۧۦۧۘۛۥۧۖۡۖۘ۟ۦۙۘۨ۬ۘ۟ۘ۠۫ۜ۬ۛۧۚۘ۟۬ۗۗۘۨۜۡ";
                    break;
                case -1398668728:
                    this.progressBar.setIndicatorColor(ContextCompat.getColor(this.context, C0931R.C0932color.color0024));
                    str = "ۤۙ۟ۨۨۢۤۧۡۘۜۦۜۛۧۖۘۤۘۡۘۖ۠ۘۘ۠ۛ۫ۖۦۘۘۜۡۙۡ۫ۛ۬ۦۜۘۦۚۘۖۢۥۘۛۚۙۤۧۦۘۤۖۘۘۦۛۗۚۘۘۘ۟ۦۗۗ۟۟ۡۙۦۜۡ۬۠ۡۦۘۢۧۡ";
                    break;
                case -1392193833:
                    this.progressBar = new LinearProgressIndicator(this.context);
                    str = "ۡۙۘۢ۟ۥۥ۬ۦ۬ۛۢۥۖ۫ۙۨۛۗ۫ۘۘ۠ۦۨۨۜۜۘۦۢۦۘۗۗۨۘ۫ۗۢۙۘۦۘۥۖۗۗۥۨۥۛ۟ۢۨ۟ۦۗۦۘۗۥۢۙ۬ۖۘۢۥۗۙۨۘ۟ۡۤ۠ۙۖۘۥۥۛۜ۠ۥۚۛۜۦۥۜۘۢۥۤۥۡۥۢۡۦۜۤ۬ۘۖ۫ۡۨ۬ۨۘ۫ۗۦۢۨۘۘۧۙۦۘۘۛۦۘ۠ۖ۠۟ۙۘۘۖۗۦ۫ۦۗ۬ۖۘۛۢۦۘ";
                    break;
                case -1282189543:
                    alertDialog.show();
                    str = "ۜۥۦۖۥۨۘ۠ۘۜۢۨۘ۟ۧۖۘ۟ۨۡۧۛۢۛۤۛۡۖۘۨ۫ۖۚۛۧۢۗۛۜۖ۬۬ۥۛۘۧۘۡۘ۬۟ۨۡۘۘۖۘۤ۠۠ۦۙۖۥۢۧۖ۠ۥۧۛ۟۬ۚۘۘ۬ۢۜۘ۬ۢ۫ۨۧ۠ۘۨۡۘۘ۫۠ۙ۠ۙۨۖۘ۟ۚۡۘۡۗۘۘ۠ۙ۠ۗۧۘ۟ۚۖ۟ۘۘۖۦۢۦۛ۟ۨۧۦۡ۟ۢۢۥۥۘۗۛۡۘۦ۟۬ۛۚۢ";
                    break;
                case -1076043733:
                    this.progressBar.setIndeterminate(true);
                    str = "ۡۛۖۘۢۗۢۡ۟ۘۥ۠ۘۢۚۛۥۥ۟ۦۥۤۚۦ۬ۡۘۧ۬ۖ۟ۘ۬ۘۡۛۥۜۧۘۤۢۥۘۡۜۗۧ۬ۛۚۜۦۖ۠ۛۨۜۗ۬ۥ۟ۧ۟ۡۘۥۗۘۖ۫ۥۧۢۤۜۨۡ";
                    break;
                case -1047091913:
                    this.customProgressDialog = alertDialog;
                    str = "ۙۚ۬ۘۤۗۛۗۦۘۗۦۡۘۜۘۚۧۥۤۖ۠ۨ۬ۢۙۨۜ۠ۨۖ۠۫ۤ۟ۢۡۦۘۘ۟ۦۘۛۗۨۢ۫ۦۘۧۙۚ۫ۦ۟ۚۧۢ۫ۙۤۗۘۛ۬ۛ۠۠ۗۡۘۨۗ۟ۤۡۜۦۧۤۖۖۦۘۖ۠ۤ۬۫ۙۚ۟۠ۦۘ";
                    break;
                case -1046928042:
                    layoutParams = new LinearLayout.LayoutParams(m82dp(this.context, 64), m82dp(this.context, 64));
                    str = "ۡۜۨۜۜۥ۠ۤ۟ۘۗۥۖۗۘۘۨۖۧ۫۫ۨۘۖۙۧۦۖ۬ۗ۟ۥۗۛۖۨۛ۠۠۫ۦۘۛۧۚ۟ۢۜۘۘۤۥۘۦۥۖۘۥ۠ۥۗۘۧ۫ۦ۠ۨۦ۬ۙۥۙۥۤۦۧ۟۟ۖۥ";
                    break;
                case -1046568306:
                    this.progressBar.setLayoutParams(layoutParams3);
                    str = "ۦۜۖۘۙۤۚۖ۬ۚۢۚ۠ۙۘۧۘ۬ۜۨۤۖۖۘۢۧۡۙ۫ۦۘۧ۫۟ۤۢۙۚۧۨ۬ۗ۠ۘۛۨۜۗۥۘۘۛۦۘۥۧۘۦۘۛۢۡۙ۫ۥ۠۬ۗ۬ۜۖۗ۫ۜۨۘۗۘۖۘۖۢۛۘۢۨۗ۬ۥ۠۫ۛۚۥۧۘۥ۟ۨ";
                    break;
                case -995166564:
                    layoutParams.topMargin = m82dp(this.context, 20);
                    str = "ۤۗۖۦ۟ۜۘ۫۬ۦۖۦۚ۫ۨۥۛ۠ۦۘ۬ۡۜۘۢ۬ۚۢۥۖۘ۠ۢۨۘۜۦۥۘۡۧۡۘ۬ۧۡۧۥۤۖۦۜۘۨۗۖ۠۬ۜۜ۠ۤۚۘۧ۟ۥۨ۠ۚۜۧۘۛۨ۬ۗ۟ۤۤۘۡۨ۠ۛۜ۫ۗۖۛ۬ۛۧ۟ۜۦۥۦۚۨۨۘ۟ۧۦۖۧۥۘۨ۫ۥۘ۠۬ۖۘ";
                    break;
                case -943219873:
                    linearLayout.setPadding(i, i, i, i);
                    str = "ۥ۬ۨۡۧ۠۫۫ۦۤۜۤۘۖۘۡ۠ۨۖ۠ۚۜ۫۫ۘۙۗۦۦ۠ۗۦۧۦۙۙ۟ۖۦۢۚۛۡۢۨۘۥ۫ۙۖۛ۟ۡۧۦۘۥۧۘۧ۫ۨۘۙۙۖۜۨۤۡۧۨۘۡ۟ۧۚۧۖ۟ۙۜۧۘۤۦۤ۟ۗۘۜۢۙۜ۠ۧۘۡ۠ۢۖۧۘ۟۬ۜۚۥۡۘ";
                    break;
                case -617299445:
                    linearLayout.setBackground(gradientDrawable);
                    str = "۬۠ۗۡۢۛۙۦ۫۟ۤۦۙ۫ۥۜۢۨۘۙ۬۬ۚۘۙۤۥۖۘۧۙۡۘۡ۠۠۫۬ۤۤۚۚۤۡ۠۬ۤۦۘ۬ۗ۬ۡۤۦۛۗۜۖۘۙۖۘۦ۠ۛۢۥۘ۟ۚۛۚۛۙ۟ۦ۫ۢۘۥۖ۟ۖۥ۟ۨۢۚ۫۫ۡۥۡۡۖ۫ۧ۬ۖۘۘۦ۠۠ۦۜۜ۬ۡۘ۟ۖۗۦ۬۬ۖۤۡۤ۠۫ۚۗۚۙۤۖۙۡۢۖۡۖۘۢۗۗ";
                    break;
                case -545641280:
                    linearLayout.setOrientation(1);
                    str = "ۦۨۦۘۙۤ۫ۗۦۛۙۚ۬۬ۙۙ۫۟۫ۦ۠ۘۗ۫ۥۘۚۤۨۘۨۛۖۤۤۙۦ۫ۖۘ۠ۗۧۗۖۜۘۢ۫ۡۘۨۦۦۘۙۧۖ۬ۡۖ۟ۛۘۘۥۤ۠ۗۚۨۢۘۘۤۜۛۘ۟۫ۡ۠ۤ";
                    break;
                case -163576573:
                    textView.setText(this.context.getString(C0931R.string.str0022));
                    str = "ۛۦۨۛۜۥۚۖ۠ۚۗۧ۟۫ۗۚۡۘۤۜۘۖۚۜ۟ۦ۟ۗۧۛۘ۟ۥۢۘۛۡۖۘۦ۠ۙۛ۫ۖۘۧۦۖۘۗۛۚۘۤۚۖۧۘۛۖۖۘ۠ۤۛۙۚۖ۟ۤۖۙ۠۟ۛ۠";
                    break;
                case -154525523:
                    linearLayout.addView(this.progressBar);
                    str = "ۙۖۖۡ۬ۨ۫ۙۥۛۜۘۚ۠ۥۘۤۛۖۘۤ۬ۨۛۥۜۤۛۢۜۦۖۨۦۘ۬ۚۨۢۛۨۘۛۛۗۜ۫ۨۡۢۖۘ۫ۘۨۘۤۤۢۜۜ۫ۗۜۦۜ۫ۥۚۜۘۚۚۜۙۥۚۧۙۜۜ۬ۙۥۚۤ۠ۡۙ۫۟ۦۘۤۜۨۥۡۘۛۢۦۘۛ۟ۜۘ۟ۙۜۡۙ۠۟۬ۘۦۗۜۚۙۧ۫ۛۦۜۛۢۗ۬ۚ۬ۦۧۘۢ۫ۦۚ۟۠ۛۦۛ";
                    break;
                case -127740023:
                    imageView.setImageResource(C0931R.C0933drawable.draw008a);
                    str = "ۗۛۤۛۢۜۘۥۖۖۖ۟ۡۘۜۤۖۡۘۙۖۖۘۙۘۧۘ۫ۡۗۦۡ۠ۗۙۦۘۡۛۘۘۧ۠ۥۘۛۘۘۨۛۜۡۨ۫ۤۨ۬ۧۨۖۖۤ۬ۨۗۨ۫ۙۥۘ۫ۘۨۘۗ۫ۨۘۙۗۨۘۖۢۧ";
                    break;
                case 73287405:
                    gradientDrawable.setCornerRadius(m82dp(this.context, 4));
                    str = "۬ۨۘۘۗ۫ۦۖۢۘۘ۠۠ۛۥۡۛۡۨۗ۬۫ۨۘۛ۬ۡۚۘۙۖۡ۫ۤ۠ۨ۬ۘۘۘ۠ۦ۬۠ۘۘۥۥۙۘۦ۠۠ۛۧۜۜۜۥۘۘ۟ۙ۠ۢۨ۠ۦ۫ۨ۬ۦۙۘۡۤۥ۫ۛۧۨۙ۫۫ۥۖۙۧ۠ۡ۬ۙ";
                    break;
                case 485990249:
                    this.progressBar.setTrackColor(Color.parseColor(Deobfuscator$$app.getString(-3440730182916071241L)));
                    str = "ۧۘۛۢ۫ۡۡۦۥۘۤۘۡۘۨۧۙۡۘۚۢۘۦۘ۟ۚۢۘۘ۬۫۬ۧۙۜۘۧۗۧۨۤۦۙۜۜۘۤۤۡۜۧۜ۟ۦۨۘ۠ۨۦ۟ۗۧ۠ۗۚ۫ۨۜۘۚۥ۬ۙۡ۬ۛۨ۟ۘۦۧۢۧۥۘۡ۬ۜۘ۫ۥۗ۟ۛۘۗۘۘ";
                    break;
                case 505569948:
                    textView.setTextColor(ViewCompat.MEASURED_STATE_MASK);
                    str = "ۙ۟ۗۗ۠۬ۢۖۥۜۛۚ۟۠ۨ۠۬ۘۦۢۛۤۨۨۘ۬ۧۘۘ۬۬ۨۘۛ۫ۙۜ۫ۛۡۙۡۜۛۡۡ۟۟۬۬ۖۙۧۜۢۙۘۧ۟ۖ۟ۧۖۘۨۨۘ۟۠ۚۡۦۘۦۤ۟ۡۗۦۢ۫۠ۜۢۡۘۡۜۚۨ۠ۡۛۥۡۘۚۚ۬ۥۜۡۜۡۧۘۗۗۨۘۗۛۡۡ۠ۚ۫ۙ۬۫ۨۢۦۙ۟ۤ۟ۜۖ۠ۜۡۢۘۘۦۨ۟ۤۘۘۙۜۤ";
                    break;
                case 506029835:
                    this.customProgressDialog.getWindow().setBackgroundDrawable(new ColorDrawable(0));
                    str = "ۘۤۦۦۡۦۘۥۚ۫ۡۧۦۢۗۡۘۗ۠ۜۢۛۨۜ۟ۛۖ۫ۤۚۧۧ۬ۘۘۤۛۢ۫ۦۘۨۙۘۘۚۤۘۘ۬۠ۜۘۤۡ۬ۘۚۦۘۥۥ۫ۨۚۥۜ۫ۨۘ۠ۛۖۘۖۜۛ۬ۥۡۘۙ۬ۢۖۖۢۜۚۘۘۤۜۛۡۗۖۘۙ۠ۨۚۤۚۚۧۖۨۡۖ۟ۥۘ۟ۚۘۘۗۖۖۘۗۧۘ۫ۧۗۛۜۜۚۦۥۘۚۨۡۘ۫ۛۥۘۘ۬۫ۛۦۥۖۤۜ";
                    break;
                case 768090023:
                    imageView.setLayoutParams(layoutParams);
                    str = "ۢۗۡۘۢ۠ۦۘ۠ۤ۠ۖۚۢ۬۫ۨۧۙۧۧۖۨۘۚۘۧۥۙ۠ۚۧۘ۫۟ۘۖۥۧ۫ۛ۬ۘ۫ۛۨۜۡۦۛ۬۫۠ۥۖ۟ۡ۬۬۫ۤ۫ۜۦۥ۬ۗۦۘۖۦۦ۟ۡ۫ۖ۬ۢۧ۬ۘ۠۬ۥ۟ۘۗۙۘۡۛۦ";
                    break;
                case 840431800:
                    linearLayout.addView(textView);
                    str = "ۡۢۙ۬ۢۦۘۦۤۨۘ۟ۧۖۘۘۗ۟ۡۢۘۚۗۖۗۤ۟۠ۙ۫ۨۧ۬ۙۧۖۘۖۡۜۘۖۗۥۘۥۘۦۗۡ۬۠ۙۖۥۗ۬ۨۚۜۘۗۚۚ۫ۙۛۖ۫ۧۧ۬ۨۘۘۖۥۘ۠۫ۥۘ۠ۘۙ";
                    break;
                case 871490862:
                    linearLayout.setGravity(1);
                    str = "ۨۖۨۥۘۢ۟ۦۦۘ۠ۚۜۘ۠ۧۗۛ۫۬ۤ۠ۤ۫۟ۡۧۥۙۤۥۙۛۢۛۥۧۜۘۧۥۜۘۛۜۜۨۡۗۚۢۦۘۜۢۥۜۖ۬ۙۚۘۨۤۥۘ۬۟۟ۙۤۦۨۖۜۢ۟ۜۦۥۗۗۛۨۘ۬ۧ۬۫ۖۢۚ۟ۦۘۖ۬ۡۘ";
                    break;
                case 972864068:
                    i = m82dp(this.context, 12);
                    str = "ۛۗۜۘۨۨۘۧ۠ۥۘۢۗۦ۫ۚۤۨۦ۟ۘۦۨۘ۠ۖۧۡۢۥۙۗۡۘۘۜۘۘۨۢۘۙۧۖۘۗۜۧۘۦ۟ۜۘۧۖۖ۬ۨۥ۫ۚۨۛۗۥۘۡ۟ۡۘۙۛۡۘۨ۫۫ۢۛ۟ۢۧۚۤ۫ۛۘۦۦ۬۠ۡۘۗۦۡۙۤ۟۬ۘۡۘۦ۬۬ۢ۫ۘۘۨۥۚۙۜ۫ۘۘۦ";
                    break;
                case 1028541945:
                    layoutParams3 = new LinearLayout.LayoutParams(m82dp(this.context, 120), -2);
                    str = "ۥ۬ۛ۟ۛۧۙ۟۠ۘۧۖۘ۟ۘۖۘۘۖۘ۠۠ۙۡ۟ۙۤۛۖۧۢۡۧۡۖۖۡۘ۬۬ۘۨۚۥۗۘۘ۫ۢۙۦۜۨۘۢۧ۬۟ۡۦ۬۬ۥ۫ۗۧۥۧۖۜۤۖۚۧۖۘۧۤۢۛۦۦۘۗۛۤ۟ۡۘ۠ۙ۠ۥ۟ۡۘۢۙۥۢۨۛ۫ۘۖۥۗۦۘ۠۟ۘۘ۠۬ۦۦۜۛ۟۫۫ۜ۠ۨۢۖۘۛۦۗۖۤۘۦۡۥۘ۬ۚۗۢ۟ۚ";
                    break;
                case 1100775713:
                    linearLayout = new LinearLayout(this.context);
                    str = "ۚۡۖۘۚۘۨۢۥۧۘ۟۬ۚۧۢۚۙۦۨ۠ۧۘۘۦ۫ۗۙۖۢ۫ۘۜۤۥۛۖۜۖۘۘۨۗۚ۟ۦۢ۬ۜ۟ۦ۟ۧۗۥۘۡۚۖۘۛۢۗۚۡۜۘۛۡۗۖۨ۠ۥۖۥۘۡۢ۫۬ۨۨۘۦۢۖۛۨۧ۫ۦۨۘۤۗۥۚۗۨۛۘۚۚۗۘۘۦۨۦۗۖۜۤۥۥ۬ۛۖۨ۫ۨۘۥۦۡۛۙۨۘ۫ۤ۠ۨۤ۟۬ۚۢۚۚۡ۫۬ۨ۫ۘ۟";
                    break;
                case 1136292212:
                    textView.setTextSize(14.0f);
                    str = "ۢۤ۬۟ۦۜۨۚ۟ۤۜۘۖ۫۟ۙۗ۬ۘۤۨۘۛۖۥۘۛۧۧۚ۟ۦۤۤۧۨۙ۫ۗۡ۬ۛۜ۟۬ۛۢۚۜ۟ۤۙۤۗ۬ۙۘۢۤۢۚ۬ۙۖۦۥۘۗۚ۟ۥ۫ۦۦۜۙۧۜۜۚ۫۟ۢ۫ۜۘۗۥۘۜ۠۫";
                    break;
                case 1291177568:
                    textView = new TextView(this.context);
                    str = "ۤۦ۟ۛۡۧۘ۟۠۫ۙۦۥ۠ۥۦۘ۬ۡۜۘ۬ۛۦۖۧۦۤۡۜۘۙ۫ۙۨۛۦۘ۟ۘۧ۫۟ۧ۫۫ۦۧۦۦۘۛۛ۫ۜۛ۠۠ۜۜۖ۠ۚۢۨۘۚۧ۠ۘۖۡۧ۬ۧۚۘ۠ۡۘۤۛۢۖۡۖۢۛۡۗۙۛۧۘۚ۫ۜۗۥۗۚ۟ۘۘۧ۟ۥۤۖۘ";
                    break;
                case 1322902230:
                    alertDialog = new AlertDialog.Builder(this.context).setView(linearLayout).setCancelable(false).create();
                    str = "ۡۦۜۘ۬ۧ۫ۚۨ۬۟ۥۘۘۚۗۘۨۦۘ۬ۦۦۘۤۘ۟ۖۧۘۘ۟ۦۤ۬ۦۘۘ۠ۗۨۘۘۘ۫ۨۧۡۘۚۤۜۘۙۘۖۧ۟ۥۘۡۚۡ۫ۦۧۘ۬۠ۘۥۦۙ۠ۜۨۤۥ۬ۢ۠ۢ۟ۤۘۡۖۦۙۚۤۥۗ۫۫ۡۥۘ۬ۜۗ۠ۨۧۘۛۦۙۤۥۤۡ۬ۢۨۗۜۢۦۙۡۤۚ۫ۤۖۤ۟ۦۘۦ۫ۨۘ";
                    break;
                case 1371440878:
                    str = "ۚۜۨۗ۫۫ۗۧۚۥۙۚۜۡۘ۫۬ۥۘۦۜۘ۠ۜۘ۫ۗۦۘۛۖۖۢۦۦۘۛ۠ۤۨۡ۫۫ۙۥۘ۟ۘۜۘۦۤۙۦۥۨۘ۫ۖ۬ۨ۠ۙ۠۫ۙ۬۫ۗۦۡۘۘۡۢۡ۬ۘۖ۫ۚۥۜۖۘۗۜۗۘۗۘۘۘۨۘۥۥۥۘۖ۟۫ۘۨۧۚۜۥ۬ۨۦۘ۟ۚۡۘۛۚۘۙۖۘۙ۟ۖۛۚۡ۠ۜۚ";
                    break;
                case 1689014367:
                    this.customProgressDialog.getWindow().setLayout(m82dp(this.context, 220), -2);
                    str = "ۢۛۨۘۤۨۖۘۛۘ۬ۥۛۤۜۜۜۘۧۗ۠ۡۧۖۘۨۢۢ۬ۖۨۥۚۘۘۛ۬ۙۙۨۡۘۜۚۜۘ۬ۡۥۘ۠ۙۥۘ۬ۧۙۡۢۨۨۨۙۛۧۘۘۢۦۗۚۢۥۘ۫ۥۤۨۡۨ۟ۗۗ۫ۦۤۧۖۧۖۨۘۘۗ۫ۚۚۛۥۨۧۘ";
                    break;
                case 1727696404:
                    layoutParams2 = new LinearLayout.LayoutParams(-2, -2);
                    str = "۠ۥ۟ۖۚۗۥۢۖ۬۠۬ۤۖۧۘۛۙۦۘۙۛ۠ۖۤۖۘۧۘۢ۫ۤۢ۬ۦۜۜ۫ۚۜۤۢۢۗۤ۠ۨۘۚۖۡۦۗۡۘۥۤۗۜۜۘۛ۟ۢۚ۠ۨۘۡۤ۬ۗۥۘۤۧۡۛۧۨ";
                    break;
                case 1759486723:
                    layoutParams2.topMargin = m82dp(this.context, 10);
                    str = "ۨۘۚۜۙۥۤۦۥ۫ۚۧ۬ۥۢۧۦۖۘ۟۬ۦۘۗۖۤۖ۬ۧۥۦۧۧۜ۟ۨ۬ۗۛۧۖۦۘۘ۬ۨ۠ۚۦ۟۫ۙۗۦۙۗۨۙۜۘۦۖۧۧۖۦۘۚۨۢۛۨۢ۠ۙۤۛۤۚۤۦۘۘۧۘۘ۫ۘۜۦۤۗ۫ۘۗۨۘۚ۬۠۫۟۫ۜۗ۫ۤۛۖۘ";
                    break;
                case 1865480420:
                    return;
                case 1874756791:
                    imageView = new ImageView(this.context);
                    str = "ۚ۬ۢۖۢۘۘۜۦۜۘۗۛۧۚۜۙۙۦۜ۟۠۬۫۠ۨۘ۟ۚۗ۟ۗۦۘۚۚۥۘۛۜۦۘۦۘۨۘۡۜۨۘۨۢۗۜۙۘۘ۠ۚۙۘۤۤ۬ۦۥۘۢ۫ۛۨۛۚۨۡ۬۟ۢۗ۬ۖۜۖۜۢۡۘۗۤۚۚۨۨۜ۬ۦۡۢۨ۫۟ۦۘ۟ۜۛۛۦۨۘۡۖۚۘۨۧۘۜۚۖ۟ۦۨۘۢ۠۫ۨۛۖ۬۫ۘۥۨۥۧ۬ۥۢ۬ۛۥۥۨۧۨۘ";
                    break;
            }
        }
    }

    @Override // android.os.AsyncTask
    protected /* bridge */ /* synthetic */ void onProgressUpdate(String[] strArr) {
        String str = "ۜۨۧۧۗۥۧۛۙۛۛۙۤۗۦۘ۠۫ۖۘۘۛۡ۫۫ۖۤ۠ۧ۬ۦۜۘۨۙۦۘۤۘۢ۟ۥۖۤ۟ۜۡ۫۫ۦۖۜۨ۬ۚۦۤۚۙۤۢۖۖۘۖۥۖۖۢۛۧۦۦ۬ۘۘۤ۟ۜۘۤۛۛۚۦۖۡۨۚۤۦۥۘ۫۫ۦۘۢۚۦۘۡۢۨۘۡۚۛۥۘۢ۬ۚۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 100) ^ 40) ^ 173) ^ 656) ^ 529) ^ 477) ^ 238) ^ PointerIconCompat.TYPE_WAIT) ^ 9) ^ 666) ^ 138) ^ 198) ^ 883) ^ 813) ^ 670) ^ 580) ^ 771) ^ 11) ^ 974) ^ 49) ^ 959) ^ 638) ^ 967) ^ 187) ^ 411) ^ 880) ^ 333) ^ 738) ^ 957) ^ 398) ^ 100) ^ 1112285077) {
                case -595060386:
                    str = "۫ۤۤۗ۬ۗ۟ۨۥۗۘۡ۟ۨۦۘۖۢۦۦۘۘ۟ۨ۬ۧۚۨۤۡۨۨۡۥۦۦۘ۬ۘۥ۠ۛۦۘ۫۫۠ۤۗۙۛ۟ۥۘۧۤۛ۫ۜۚۧۥ۟ۙۨۡۘۘۙۡ۠ۜۦۘۘ۠ۦۜۘۢۚۢۘۛ۬۟۠ۖ۟ۤۡۘۧ۠ۢۦ۠ۜۙۢ۬ۢ۟ۜۢۘۥۖ۬ۙۖۘۦۘ۬ۨۘۘۥ۟ۨۘۜۚۦۘۖ۠ۜۘ";
                    break;
                case -246551041:
                    str = "ۡۨۙۙۨۖۘ۟ۜۜۜۘ۟ۙۖۛۡۥ۠ۚۛ۠ۢۗۗۘ۠ۘۛۚۡۦ۬ۢ۟ۗۢۙۘۙۛۚ۫ۘۖۘۡۥۘۚۨ۬۟ۤۦۦۤۛ۠ۦۛۢۧۨۧۨۘ۫ۗۘۨۡۡ۟ۧۥۥ۠ۖۘۛۥۦۗۚۤۡۦۨۙۦۜۗۜۚۡ۫ۢۨۜۢۤۛ۠۫ۗ";
                    break;
                case -2918056:
                    return;
                case 461888875:
                    onProgressUpdate2(strArr);
                    str = "ۧۘۧۢۨۦۜۨ۫ۙ۬ۖۡۖۖۘ۟ۘۡۘ۟ۢۖۢۡۡۘۖ۬۟ۖ۟ۚۨۧ۟ۘۨۘۘ۫ۘۗ۠ۥۙۖۧۡۢۦ۬ۡۨۡۘ۬۬ۢ۟ۙ۠ۧ۟ۚۛۡۘۚۡۙۤۚۥ۬۬ۨۧ۬ۜۘۧۦ۫ۛۡۨ۬ۚۘۘۨۤۛۙۚ۟۬۫ۙۡۧۦۥۚۡۘ۬ۡۛۥۘۤ۠ۨۥۘۢۨۛۜۤ۠ۨ۫ۜۘۗ۫ۥ";
                    break;
            }
        }
    }

    /* JADX WARN: Can't fix incorrect switch cases order, some code will duplicate */
    /* renamed from: onProgressUpdate  reason: avoid collision after fix types in other method */
    protected void onProgressUpdate2(String... strArr) {
        String str = "ۘۧۗۚ۬ۛ۬۫ۜۘۚۧۘۘۨۖۛ۫ۡۡۢۗ۬ۨۜۛ۟۫ۥۘۙۜ۠ۨۧ۬ۢۨۜۙۚ۬ۧۢۦۦۜۗۢۜۜۢۥۜۛۛۨۘ۠ۛۨۙ۠ۦ۬ۥۨۘۗۧ۫ۛۥۜۚۛۦۘۘۗۙۧۢۘۨ۟۠۫ۦۤۖۘۘۙ۟ۘ";
        while (true) {
            switch (str.hashCode() ^ 1331656635) {
                case -1873364797:
                    return;
                case -1454940449:
                    LinearProgressIndicator linearProgressIndicator = this.progressBar;
                    String str2 = "ۥۗ۟۠ۦۘۜۚۛۤۖۧۗۥۘۢۤ۬۠۠ۚ۟۫ۨۘ۬ۜ۠ۖۢۤۙۧۚ۬ۜۥۘۡۥۨۙۡۡۘۚ۟ۘۘۚۨۛۥۡ۟۬ۢ۠۫ۢۘۘۜۜۦۡ۠ۨۘ۫۬ۖۘۢۧۢ۠ۖۖۘۦ۟ۥۘۦۜ۬ۛۡۚۤۦۘۡۖۧ۟۟ۥۧ۬ۘۘ۠ۨۗۗۘۨۘۙۛۙۗۤۨۘۢۨۡ۟۬ۢۦۛۘۘۢۨۗۛ۫ۘ";
                    while (true) {
                        switch (str2.hashCode() ^ 1116228850) {
                            case -1670578270:
                                String str3 = "ۤۙۡۘۛ۠ۧ۬۟۬ۢ۠ۗ۠۬ۛۖۘ۟ۦۧ۬۫ۗۢۗۜۘۗۢۤۥۚ۟ۡۗۨ۟ۦۧ۟ۧ۬۠ۡۘۢۙۘۘ۟ۘۙۥ۬ۛۚۤۙۤۖۡۧۛۙۛ۠ۥۡۙۗۨۙۥۦۡۘۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-1062601480)) {
                                        case -416040192:
                                            this.progressBar.setIndeterminate(false);
                                            break;
                                        case 629500502:
                                            str3 = "۫ۧ۫ۙۧ۠ۧۦ۬۟ۚۢ۫ۢۧۖۡۤۨۦۘۙۦۖۘۥ۟ۚۖۖۨۘ۠ۗۨۤۖۚۤۥۦۘۗۡۚۦۤۜۘ۫ۦۜۘۛۥۥۚۨۢۤۡۙ۫ۨۤۢ۠۬ۤۖۘۧۢۧۤۨۧۘ۠ۥۡۙۙۘۘ۬۠ۤۜ۫ۜ۠ۦۧ۬ۗۨۙۖۡۡۡۘ۠ۦۥۖۘۘۧۘۖۘ";
                                            break;
                                        case 1636630676:
                                            String str4 = "۫ۜ۬ۖ۬ۨ۟۬ۖۤۤۛۧۧ۟ۙۡۛ۟ۧ۬۠ۚ۫۠ۜۖۚۨۘ۟ۛ۫۠۬ۘۘۥۡۖۘۨۙ۠ۤۛۛۧ۟ۥۚ۟ۖۘ۫۬ۦۘۙۤ۠۠ۜۗۚ۠ۨۘۚۘۢۖۥ۟ۢۚۘۛ۟۠ۡ۫ۜۨۚۢۡۖ۠۬ۗۧۘ۟";
                                            while (true) {
                                                switch (str4.hashCode() ^ 806941940) {
                                                    case -1445768519:
                                                        String str5 = "ۜۖۖۜۜۙۥۡۙ۠ۛۨۘ۫ۘۚۨۡ۫ۗ۫ۥۘۘۛۦۧۢۛۛۙۘۡۦۜ۬۠ۨۘ۫ۙۘۤ۟۠ۙۨۧۘۘ۟ۦۛۧۛۙۨۧۘۖۤ۠ۥۛۨۘۦۤۙ۟ۦۡۘۧۜۡ۬ۡۜۛۙۖۘ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ 1999494862) {
                                                                case -1412999276:
                                                                    str4 = "۠۬ۥۢۤۨۘۚ۟ۘۘ۬ۚۥۧۢۘۘۤ۠۠ۨۘۡۘۢۦ۬ۧۢۚۧۥۧۗۜۡۙۥۡۛۡۗ۟ۗۜۡۜۧۘۥۛ۬ۦۦۦۢۥۜۘۨۧ۬ۚۢۜ۫۠ۧۢۡۡۛۚۦۘ۠۫ۨۗ۟ۛ";
                                                                    break;
                                                                case -1248698379:
                                                                    str5 = "۬ۛ۠ۜۥ۬ۙۤ۠ۚ۠ۥۜۧۚۛۨۤۖ۟ۖۛۖۙۡۧۜۘۖ۟ۜۖۨۜ۫ۥۧ۠ۗۨ۫ۨۥۘۢۛۦۘ۬ۥۘۧۛۢۗۘۘ۬ۤۜۘۖۚۨۜ۬ۡۢۦۜۘۡ۟ۥۘۦ۠ۖۘۨۧۡۘۤ۠ۚۢۥۜۘۙۖ۠ۙۜۛۦۢۙۘۜۘۘۘۡ۟۬ۗۜۧۥۘ۫ۚۘۘۢۜۦ۠ۢۥۘۦۢۚۧ۟۟ۧۧۜ";
                                                                case 405688604:
                                                                    str4 = "ۜۢ۠۬ۤ۬ۢۖ۫ۚ۟ۡ۟ۦۚۤۡۡۘۢۖۦۧ۫ۧۦۘۦ۫ۜۘ۫ۖۘۧۧۡۘۜۢۤۡۡۥۘ۠ۙۧۥۤۥۛ۟ۥۘ۫۠ۨۘۢ۫ۤۙۨۨۧۜۘۧ۫ۘۦ۠ۦۨۥۧۚۜۡۘۡۥۘۘ۟ۦ۫۠ۖ۫ۦ۟ۡۡ۠";
                                                                    break;
                                                                case 1742252114:
                                                                    String str6 = "ۜۙۨ۟ۖۨۧۜۘۡۧۧۘۙۡ۟ۤۢ۠ۧۤۛۡ۫ۘ۫ۦۘۦ۫ۖۘ۠ۡۘ۫۫ۡ۫۫ۦۘۡۨۘ۟ۚۗۤۛۦۘۙ۠ۛۦ۫ۥۘۨۛۥۡۦۜۘۢۛۜۘۡۥۡۘۥ۫ۧۚۖۛۦۖ۬ۘۡ۠ۙۢۥۖۤۙۢۜۦۘۨ۠۫ۚ۟ۖۘۧۥۦۘۢ۠ۨ۠ۢۜۙ۟ۨۡۡۡ۠ۜۘۘ۟۬ۗۡۡ۬ۖ۬۠";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ (-2098954342)) {
                                                                            case -1689518640:
                                                                                str5 = "ۧ۬ۦۜۡۘ۫ۧۖۗۦۘۥۗۨۙۡۘۧۙۗۛۢۨ۠ۢۡۦ۫ۤۤۦۨۘۙۨۚۛۥ۟ۚۡۥۖۥۙۧ۠ۦۘۘ۫ۨۘۥۥۖۘ۬ۛ۟ۛ۠ۖۡۜۛۙۖۧ۬ۛۥۨۘۥ۟ۡ";
                                                                                break;
                                                                            case -14974396:
                                                                                str6 = "ۢۦۚ۬۫ۦ۫۬ۡۘۜۜۗۚۜۘۛۤۛۨۧۜۛۖۡۙۥۗۚۡ۟ۡۧۜ۟ۦ۠۟ۡۢۦۜۘ۟ۧۨۙۘۖۘۡۜۡۥۙۤۦۤۦۚۧۤۤۧۤ۬ۨۘۨ۬ۜۧۡۚ۠ۦ۫ۘۨۖ۟ۡۘۘۙ۬ۗ۬ۡۖۥ۬ۦۖۧۘۡۜۢۥ۫۬۫ۤ۟ۜۦۧۘ۬ۚۖۢ۬ۘۙۘۦۘۡ۫ۘۦۛ";
                                                                            case 516017243:
                                                                                str5 = "ۖۦۜۘۧۘۧۡ۟ۖۤۦۚ۠ۡ۫ۛ۫ۡ۫ۖۥۦۘۢۧۥۘۨۡۨۡۜۥۘۖۜ۫۫ۢۦۘۧۗۤ۫ۦۙ۟۫ۦۘۦۡۙۧ۫ۖۘۤ۬ۛۗ۟ۦۦۖۙۜۘۦۘۦۙۡۘ۬۠ۦۢۤۨ۠ۖۧۧ۫ۡ۠۠ۚۘۗۜۙۗۙ";
                                                                                break;
                                                                            case 1159274041:
                                                                                String str7 = "ۥۖۥۘۙ۟ۘ۠۠۟۟ۦۢ۟ۜۥۘ۠۬ۜۛۨۚۨۛۧ۠ۧۘۧۘۚۚۢۨۘۖۤ۬ۥۖۦۖۛۙۧۖۡۘ۫۬۠ۖۙۥۘۧۛ۟ۢۤۖۘۛۥۙۜۦۧۥۚۚۦۢۖ۬ۖۘۨۤۥۢۖۤۗۖۧۘۥۜۚۚۥۨ۟ۤ";
                                                                                while (true) {
                                                                                    switch (str7.hashCode() ^ (-249235805)) {
                                                                                        case -61142222:
                                                                                            str7 = linearProgressIndicator.isIndeterminate() ? "ۤۡۦۘۢۜۘۥۧ۟ۦۗۨ۬۬ۨۨۨ۬ۜۦۚۗۥ۬ۦۘۚۙ۟ۖۤۙۨۦۧۖۢ۠ۧۤۚۦۘۛۥۥۘۢ۬ۘۧ۬ۡۙۥۥ۬ۙۤۡۜ۟ۡۚ۟ۗۛ۬ۜۥۥ۟ۗۤۨۤۨۥ۫۠ۘۘۛۖ۬۠ۚۡۘۜ۟ۜۘ۠۫ۧۤۨۥۜۘۙۤۖۧۜۨۦۘ" : "ۢۢۜۘۡۖ۫۠ۢۙ۠ۜۧۖۦ۫ۥۛۘۥۖۥۖۧۧ۫ۧ۟ۙۡۖۨۗۖۘۢ۬ۥۜۘۥۘۧۨۙۡۗۦۘۧۜۖۦۧۜۚۡۖۜۤۛۢۜۜ۬ۦۘ۠ۛۤۡۤۚۦۚۢۛۨۧۘۡۧۦۘۡۘۧۘۨۦۨۘۙۥۡۚۖۖۡۙۢ۠ۧۡۘۥ۟ۛۚ۟ۜۢ۬ۦۘۘۜ۫ۥۚۨۖۧۘ۟ۤۨۨۖۘ۠ۗ۫ۦۜۜۗ۠ۜۥۙۗۦ۠ۖ";
                                                                                        case 324746951:
                                                                                            str6 = "ۨ۠۠ۛۜۢ۫۟ۢۖۚۖۥۧۚۧۛۢۛۛۨۤۡۨۘ۫ۡۖۙۦۖۘۚۘۡۚۡۗۡۤۥۘۦ۠ۢ۠۠ۗۡۖ۫ۧۧ۠ۛ۠ۤ۬۫ۡۘ۬ۖۦۘۤ۬ۢۗ۟ۖۘ۫ۜۘۘۡ۠ۧ۬ۖۜۘۨۖۥۘ۟ۤۖۡ۟۫ۘۥۤ۬۫ۥۘ۫ۖ۬ۥۛۨۥۦۡۘ۟ۦۨ۬۠ۢ";
                                                                                            break;
                                                                                        case 629039950:
                                                                                            str7 = "۠۟ۢۢۥۡۘۡۙۗ۟ۧۘۗۢۨۖۧۨۢۙۢۦۚ۠۠ۦۛۧۢۨۨۤۦۦۨۨۤۧ۟ۜۦۙۧۦ۠ۜۙ۬۬ۛۦ۫۟ۤ۬ۘۡ۠ۜۥۘۥۚۥۘ۫۬ۢۖۜۨۘۘۡۗۙۧۜۘ۟۫ۛ۟ۖ۬ۦۖ۟ۡۚۘ۫ۢۧۛۨۧۘۘۦۘۘۛ۫ۧۦۗۙۚۛۨۥۖۘۧۡۡۘۚ۠ۖۤۡۘۘۤۨ۫";
                                                                                        case 870294383:
                                                                                            str6 = "ۛۚ۬ۤۛۡۘۘۦۜ۫ۗۜۘۢ۫ۛۙۗۜۢۖۘۘۢۦۦۘۢ۟ۘۘ۫ۥۧ۠ۨۡۢۡۡۘۨ۟ۚۚۦۨ۬ۨۖ۫ۤۡۧ۟ۥۘۥ۠ۛۤۢۦۨۗۨۘۘ۫ۡۘ۬ۚۤۗ۟۟ۤۥۘ۬ۥۚ";
                                                                                            break;
                                                                                    }
                                                                                }
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case -822970549:
                                                        str4 = "ۡۡ۬ۦۨۦۘۡۜۨۘۙۥۙ۠۬ۛۨۚ۟ۙۜۦۘۨۥۢۦۙۚۦۥۜۨ۫ۨۘۤۙۜ۬ۥۚۘۙۡۤۨۘۧۙۧۨ۬۫ۦۖۘۨۨۨ۟ۢۡۘۦۨ۬ۥۨۡۘۧۛۜۘۨۙۦۘ۠ۡۧۤۗۤۨۧۖۘۙۚ۠۠ۖۥۘ۟ۥۧۦۡۖ۟ۜۡۙۖۘۡ۬ۗۤۘۖۘۛۛۖۤۢ۬ۨۗۛۜۗۧ۬ۧ۫ۤۖۡۘ۫ۙ۬ۚ۠ۖۘۥۡۨۘۖ۬ۘ";
                                                    case 107509754:
                                                        str3 = "ۢۙۡۘۖ۟ۦۘۨۤ۟ۜۥۚۥۥۡۚۨۥۘ۬ۜۥۘ۬ۙۜۜۡۧۥۢۖۘۥ۫ۨۛۦۡۤ۠ۚۦ۫ۨۘ۟ۘۡۗۗۛۘۨۢۗۜ۬ۚ۠ۢۛۖۨۘۜۙۖۘۨۦ۬ۥۨۥۘۢ۫ۥۚۨۗ";
                                                        continue;
                                                    case 716339116:
                                                        str3 = "۬ۦۖۢ۠ۡۘۧ۬۟۟ۗۜۘ۬ۗ۠ۧۖۖۘۡۘۤ۟ۨ۟ۤۥ۬ۦ۫ۗۤۥۗۥۢۤۛۨۦۛۡۨۘۦۡۧ۟ۢۘۤ۠۫ۤۜۤۛۜۦۘ۟۬ۖۨ۫۬ۧۥۖۘۨ۬ۦۢۚۚۦۖ";
                                                        continue;
                                                }
                                            }
                                            break;
                                        case 1765169610:
                                            break;
                                    }
                                }
                                try {
                                    this.progressBar.setProgress(Integer.parseInt(strArr[0]));
                                    return;
                                } catch (Exception e) {
                                    return;
                                }
                            case -988193330:
                                str2 = "ۛۚ۬ۥۜۙۚۗۗ۟ۙۡ۬۟ۥۘۗۡۦ۬ۛۢۖ۠۟۫۠۟ۨۜ۠ۙۧۤۛۨۥۡۗۘۘۥۤۤۜۨۢ۠ۡۥۘۙۤۦۢۡ۟ۨ۫ۧۘ۟ۡۘ۫۠ۚ۫ۗۛ۬ۢۚۢۥ۟۟ۛۦۘۧ۬ۥ۫ۙۢ۟ۘۗ۬ۤۚ۠ۛۨۘ۠ۗۥۜۜۥۘۨ۟ۖۜۦۡۘ۫ۡ";
                                break;
                            case -656243858:
                                return;
                            case 1432952482:
                                String str8 = "ۦۗ۫ۢۛۦۙ۫ۥۘۜۜ۬ۙۦۨۦۤۚۜۘۨۙۦۘ۠۬ۢۨۜۗۗۜۦ۟ۖ۬ۛۖۘۥۧۦۤۢۢۤۙۙ۠ۖۧۘۦۧۜۦۚ۫ۡ۬ۘۘۗ۬ۜ۫ۖۥۜۨۨۘۗۘۤ۠۬ۛۥۙۜۢۘۡ۟ۨۘۘۚۖۖۘۗۦۗ";
                                while (true) {
                                    switch (str8.hashCode() ^ (-1844660301)) {
                                        case -1774167476:
                                            str2 = "ۥ۫ۢۚۦۤۤ۫ۘۘ۟ۚۨۘۡ۫۫۬۬ۚۚۤۦۖ۠ۨۘ۬ۚۙۧۥۘۘۧۥۢۖۘۧۧۦ۟۟ۨۢۖۗۡۖۢۗۗۥۛۘۢۚۜۛۢۗۚۡۘۨۡۢ۬ۥۘۘۙۢ۟ۧۡ۠ۚۤ۫ۡۦۘۘ۟ۡۘۘۘۗۢۛۧۢۜ۫ۘۥۨۦۚۚۦۗۜۗۧۚۥۘۧ۠ۥ";
                                            continue;
                                        case 598401962:
                                            String str9 = "ۙۦۡۘۨۧۥۘۙۡ۠ۧۛ۫ۜ۫ۚۨۨ۠ۚ۠ۜۘۡۥۖ۬ۤۨۛۚۦۘۢ۬ۡۘ۫۠ۙ۠ۜ۠ۤۦۢۡۧۘۥۨۤۨ۫ۡۜۘۦ۠۟ۘۘۤۥۜۚۤ۬ۧۜ۠ۚۧۤۤۜۛۛۦ۠ۨۦۚۜۘ۟ۦ۟ۘۖۡۘۦۙۡۖۢۨۧۚۡۧۥۘۧۘۘۢ۬۠ۛۜ۬ۚۜ۫۟ۢۚۦۚۛۡ۬ۙۗ۫۫ۗۧۦۘۛ۫۫۫ۛ۟ۜۤۜۘ";
                                            while (true) {
                                                switch (str9.hashCode() ^ (-1909895089)) {
                                                    case -1632707093:
                                                        str8 = "ۨ۬ۤۦۢۤۢۥۘۢۦ۫ۖ۠ۛۜۗۜۥۢۚۛۢۖ۟ۡۘ۫ۡۥۘۜۚۧۡۦۚ۟ۧۡۚۧۗۖۘۘۧۧۡۖۥ۬ۗۤۖۚۘۛ۫۠ۤۜۡۦۢۥ۠ۛۨۧۦ۟ۘۤۡۧۘۚۛ۫ۘۛۢۨۘۤ۟ۨۨۥۧۚۨۖۘۘۖۖۘۥۗۙۡۘۧۘ۟ۤۥ۠ۘۡ۬ۘۘۗۜۜۤۖۤۛۚۜ";
                                                        break;
                                                    case -1268785379:
                                                        String str10 = "ۦۥۥۘۡۥۡۢۚۦۘۛۥۨۘۤۗۤۚۧ۫۠ۨۡۘۚ۟ۗۘۘ۟۠ۡۜۘۗ۟ۖۘۤ۠ۦ۫ۦۤۙ۫ۥۙۗۡ۫ۥۗۛۢۥۘۦ۫ۘۜۦۖۘۗ۫ۧۡۤۖۘۙ۠ۜۘۨۛۨۦۧۥ۠ۛۘۘ۠ۥۗۧۦۥۨۥۥۘۜۨۗۚۖۥ";
                                                        while (true) {
                                                            switch (str10.hashCode() ^ 1419648930) {
                                                                case -880656671:
                                                                    str10 = "ۙۚۨۨ۟ۖۛۨۢۜۦۦۘۨۧۦ۬ۖۜۘ۟ۗۦۘۖۙۗۜۨۤۤۗۜۘ۠ۜ۟ۦ۟۫۬۠ۖ۟ۡۤۖۖۧۘۥۢۘ۟ۡۘۥۨۧۘ۬ۜ۠ۛۥ۬ۡ۟ۗ۟ۧۨۘۦۘۛۡۨۘۙ۟ۥۥ۠۬ۜۚۡۘۧ۠ۚ۠ۡۧۡۢۡ";
                                                                case -245007249:
                                                                    str9 = "ۥۤۛۙۧۗ۫ۢۜۘ۠۠ۖۗۨۦ۬ۖۧۨ۫ۧۡۤۡۘۥ۬ۗۚۚۡۘۦۢ۬ۤۢ۫۟ۘۧ۟ۥۛۖۥۖۧ۠ۚۧۜۨۨۨۜۧۜۘ۟ۥۡۘۗۙ۠ۢۧۜۘۢۙۗۤۘۦۦۖۘۗۘۘۘۚۚۜۧ۫ۛۙ۠ۨۙۤۤۘۙۦ۟ۙۦۘۨۥۜۥۜۛۗۚۛۗۦ۠ۨۥۘ۠ۘۤۙ۬ۤۨۡۡۖۙ۬ۨۦۚ۠۬ۙ۠ۨۥۘ۟ۤ۟";
                                                                    break;
                                                                case 1539659729:
                                                                    str9 = "۫۫ۚۡۡۧۡۡۡۘۚۦۨۘ۠ۜۜۘ۬ۙ۟ۦ۫ۙ۫۫ۤ۠ۙۖۙۜۘۡۖۡۖ۠ۧۛۥۜۚۡۜ۟ۚۡۘۨۚۢۡۚۙ۟ۘۘ۟ۦۨۘ۫ۜۢۜۥۦۜۨۚۖۙۡۘۧۖۥۘۙۦۙ۟ۚۘۘۙۗ۟ۚۡۨۦ۠ۚۧۙۖۡۖۛۚۖۧۥۤۥۘۛۘۧۘۧۖۥۘ۠۬ۡ۟ۤ۟ۨۢۡ۫ۜ۬ۥۗۜۗ۠ۙۗۦۘۤۜۥۘۚۜۜۘۦۖۨ";
                                                                    break;
                                                                case 1664219619:
                                                                    String str11 = "۫ۨۚ۬ۤ۫ۦۙ۬ۦۧ۬۬ۘۨ۫ۗۜۗ۫۟ۙۘۚۖۘ۟۟ۨۥۢۛۥۗۧ۟۠ۤۡۙ۠۠۟ۦۘۜۡۥۘۢ۠ۛ۠ۚۜۤ۠۫ۗۙۗۡ۬ۦۘۘۨۖۢۛۙۖ۬ۘ۫ۨۘۡۢۖۘۧ۫ۦۘ۟ۖۛ۟۬ۥۘۡۡۡۡۘۘۘۘۙ۟ۡۚۖۘۖۥ۬ۨۘۥ۫ۖۢۦۖ۬ۡۙۦۘۤۤۨۛۘۡۢ۠ۖۜۙ۠ۚۢۨۗۥ۠ۧ";
                                                                    while (true) {
                                                                        switch (str11.hashCode() ^ (-1719413237)) {
                                                                            case -1063064258:
                                                                                str11 = linearProgressIndicator != null ? "ۘۚۧۥۖۘ۫ۤۜۘۧۚۢۘۦۢۖۜۗۙ۫ۥۦۨۨۘۙۧۛۛ۬ۤ۫ۡۥۘۙ۫ۜۛ۬ۙ۟۠ۙۖۤۘ۫۬ۘۘ۠۫ۤۖ۫ۤۚ۫ۘۨۦۤۙۛ۟ۜ۫۟۬ۤۧۗۧۥ۟ۦۢۡۤۘۘ۬ۛۘۡ۟ۡۘۥ۫ۜۘۢۤۘ۠ۗۢۡۡۛۡۨ۠ۜ۠ۨۦۧۨ۟ۢۤۛۗۦۢ۠ۧ۠۠ۨۘۘۘۢۙ۬ۜۛۨۘ۫ۨۗۤۘۨ۟ۗۥۘ" : "ۢۘۢۡۥ۫ۢۢۚ۠ۛۥ۬ۢۖۘۚۥۥۛۘۥ۟ۡۖۘ۠ۚۛۖۗۤۖۦۛۤۜۢۥۚۤۤۚۦۢۘۜۘۨۗۜۨۙ۫ۚ۟ۨ۬ۛۜۘۧۤۦۥۢ۬۬ۤ۠ۢۗ۠۬۫ۦۘۙۖۤۦۡۖۘۚۦۢۛۜۜۘۙۧۢ۟۫ۛۦۚۘ۬ۧۖۘۢۙۘۘۙۤۨۘۢۤ۠ۧۧۖۘۡ۠ۤۨۖۙ۬ۢۤۢۡۙۦۦۙۛ۬ۢۖ۫۫";
                                                                            case -552410428:
                                                                                str11 = "۬۠ۘۥۜۨۡ۬ۘۤ۫ۘۘۛۤۥۘ۠۠ۦۘۖۗۚۚۖۘۚۜ۠ۧ۫ۘۘۤۤۖ۠ۨۡۘ۫۬ۖۘۖ۬۟ۜۢۘۡۤۙۙۚۧۤۦۗۚۜۘ۫۫ۡۖۨۘۗ۬ۨۘ۬ۡۖۚۙۥۥۚۗۦۤۘۜۢۛۦۡۤۛۨۥ۟ۖۨۦ۟ۡۘ۬ۖۘۚۧۧۖۧۘۙۥۚ";
                                                                            case 448945096:
                                                                                str10 = "ۙۖۗۚۜۜۘ۠ۧۜۘ۬ۨۗۘۡۙۙۧۘۜۥۧ۟۟ۜۘۨۡۨۗۜ۠۠ۡۤۤۡ۠ۜۘۘۙۡ۫۟ۘۖۤۘۖ۫ۧۤۨۖۘ۬۫ۗۛۨۧۘۚۤۨۤۖۗۘۤۦۘۤۚۧ۫ۛۥۘ";
                                                                                break;
                                                                            case 874760276:
                                                                                str10 = "ۡۘۧۜۘۨۗۜۛۨۦۤ۟ۘۜۘ۠ۚۛ۟۫ۚۡ۟۫ۖۥۡ۠ۙۤ۫ۛۚۡ۟ۖۘۗۨۘۧۤۦۘۛ۟ۜۘۦۤ۟۟ۗۜۛۤۡۘۖۗۨۘۘۡۥۘۦۛۜۘۡۦۤۙ۬ۗۙ۟ۙ۫ۗۥۤ۠ۨۙۢ۫ۙۦۖۗۨۛۦۘۜ";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case -463385808:
                                                        str9 = "۟ۚۛۨۖۘۜۚۛۢۦۥ۬ۦۖۘ۫ۖۚ۠ۡۧۘۖۖ۫ۦۖۛۗۥۘ۟ۦۚ۫ۨۗۧۡۨۘ۫ۨۨۡۨ۟ۘۥۧۘۙۥۥۢۦ۠ۦۢ۠۫ۨۤۨۖۘۚۤۜۚۖۘۗۛۥۘ۠ۥ۟";
                                                    case 1403345688:
                                                        str8 = "ۤۧۡۘ۟ۤۖۦۢۜۘۛۦۥۥ۫ۜۘ۬ۨۨۘۤۙۡۘۥۤۧ۬ۧۖۗۛۚۥ۫ۜۛ۟ۜ۬ۦۢۦ۠ۖ۫۠ۘۘ۟ۖۦۘۥۦۥۙۤ۟ۦۥۜۘ۠ۜۙۨۘۥۡۥ۬۬ۛ۬ۥۛۜ۬ۙ۠ۙۜۘ۠ۙۘۘ۟ۨۘۛۦۦۘۧ۟۬";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1443126604:
                                            str2 = "۬ۚۘۘۥۦۘۘ۬ۨۧۘۜۖ۬ۧۛ۬۬ۥ۫ۤۖۤۧۛ۠ۛۙۨۜ۟ۘ۫ۢ۠۫۟ۧۜۘۧۨۦۘۚۙۛ۠ۢۙۘ۬ۚۤۧۗۨۖۨۘ۟ۖۙۙۘۘۢ۠۬ۖۨۙۚۖۧۘۦۤۡۘۨۙۡۘۨۖۥۡۡۡۛ۬ۗۥۜۦۘ۫ۛ۠ۙۤۨۘۤۢ۠۠ۦۚ۫۠ۘ";
                                            continue;
                                        case 1455193111:
                                            str8 = "ۜۖۜۘۤۚۜۧۥۘ۟ۥۘۙۧۘۘۘۘ۬ۗ۟ۨۘۢۛ۫۬ۚۧۧ۠ۥ۬۬ۜۗ۟ۡۡ۬ۥۙ۟ۛ۟ۛۜۚۛۚۙۧۡۢۜ۠۬ۙ۫ۙۧۤ۟ۜۧۙ۠ۖۘۧۨۡۘۡ۠ۘۗۡۦۤ۬ۛۖۧۜۘۨۖۖۘۨۛۗۢ۬ۤۖۡ۠ۙۘۤۧۤ۟ۡۡۘۦ۬ۤۜۥۧۘۜۚۗۨۙۛۜۜۡۚۙۜ۬ۘۜۘۨۥۜۘ۫۠ۤۚۥ۫ۤۖۗ";
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 114869834:
                    str = "ۧۤۚۘۚۜۘۜۤۜۙۚۢۚۙ۟ۛۚ۫۟ۤۡۘۤۜۨۘۧۙۥۘ۫۠ۖ۬ۗۘۘ۟۬ۡۙ۬ۧ۬ۦۡۚۦۨۘۗ۫ۡۗۨۖۗ۬۟ۘۦۨۘۖۗۥۧ۫ۡۗ۫۬ۗ۫۫ۖۗۜ۫ۗۘ۟ۛ۫ۡۥۖۘۜۧ۬ۜۢۜۚۘ۠ۙ۟۟ۙۛۖۙ۬۠ۦۤۡۘ۠ۧۥۘ";
                    break;
                case 538147815:
                    String str12 = "ۢۥۖۘ۫ۢۛ۟ۛۖۘۤ۫ۦ۠۟۫ۚۚۤ۫ۜۜۧۥۘۘۧۨۘۡ۠ۦۘۜۥۡ۬ۧۦۚۜۨۘۤ۫ۙۧۙ۟ۙۢ۬ۨۚ۫ۤۦۦۧ۫ۘ۠ۖۗۥۙۘۘ۟ۡ۬ۜۗۢۥۡۦۛ۬۠ۚۢۨۚۘۤ۫ۜۖۚۙۧۨ۟ۙۜ۫ۛۤۘ۠ۖۚۜ۫ۨ۠ۧ";
                    while (true) {
                        switch (str12.hashCode() ^ (-1872250554)) {
                            case -1336973182:
                                str12 = "ۡۙۦۘ۟ۧۚۡ۟ۚۙۨۖۘۖۖۜۘۡۢۘ۬ۛۖ۬ۖۘۘۧۙ۬ۛۖۡ۬ۚۤۚۧۨۧۗۨۡۧۗۤۘ۠ۦۜۘۚۥۢ۬ۙۚۗۚ۟ۡ۫ۦۦۜۦۗۤۖۘ۫ۤۜۦۘۘۘ";
                            case 273601217:
                                str = "ۧۚۡۘۚ۟ۗۘۜۨۢۨۘۚ۫ۜۘۗۢۖۘۜۚۖۘۤۜۢۘۦ۟۟ۗۧۨۜۗۗۗۚۥۛۖۘۧۡ۟ۥۛۥۘۢۘۖۘۧ۟ۡۖۦۧۗۚۗۘۥۡۨۜۙۢۖ۬۠ۢۚۙۦۦۘۢۖۨۥۜ۬ۤ۟ۢۙ۫ۚۦۜۖۧۚ۫";
                                continue;
                            case 452140637:
                                String str13 = "ۦۧۜ۫ۖۧۘ۟۟ۨۘۢۛۙۤۜۨۘۗ۟ۢ۟۬ۥۚۡۖۘ۠ۦۡۘۚۜۜۨۘۘۙۥ۟۟ۗۨۥ۟ۘۘۢۡۤۥ۟ۜۦۥۥۘۥۗ۟ۜ۫ۙۙۘۦۘۧۡۖ۫ۦۜۢۙۦۜۨۦۘۥۥۨ";
                                while (true) {
                                    switch (str13.hashCode() ^ 587418993) {
                                        case -1555862008:
                                            str12 = "۟ۘۢ۠ۨۘۘۦۚۙ۫ۛۙ۫ۢۗۤ۠۫ۦۘ۫ۗۡۘ۫ۢۢۛۡۤۨ۟ۜۨۧۡۖۘۥۘۥۢۡۘ۠ۚۡۘۘۡۖۗۦ۫ۢۚۦۘۖۧۡ۟ۘ۬ۦۗ۟ۜۙ۠ۜ۟ۜۢۛۦۗ۫۠";
                                            break;
                                        case -901649738:
                                            String str14 = "ۡ۬ۖۤۛۗۨۦ۟ۙ۟ۡ۟ۗۢۤۨۘۙۥۘۘۤۥۤۤۥۜۘۙۖۤۜۨ۟ۥۨۘۘ۫ۦۨۘۢۨۡ۫۬ۙۦۛۚ۬ۧۘۙۚۡۧۘۦۙۥۘۛۤۘۘۡ۫۫ۚۥۥۘۙۤۡ۫ۤۙ";
                                            while (true) {
                                                switch (str14.hashCode() ^ (-1777868281)) {
                                                    case -1830563816:
                                                        str14 = "ۙۖ۬ۗۨ۬۫ۛ۫ۢ۠ۢۘ۬ۘۘۧۚۘۘۜۖۦۧۡۤۖۡ۫ۧ۠ۖۤۤۧ۬ۛۦۗۨۡۗۖۘ۠ۛۙۛ۫ۘۘۚۚۦۘ۟ۖۥۘ۬ۖۢ۟ۦۥ۬۫ۘۘ۠ۧۨۜۧۥۘۤ۠ۤۛ۟ۦۧۜۥۖۢۙۤۢۡ۬۫ۜۡۘ";
                                                    case -685086611:
                                                        str13 = "۬ۜۜۖۜۦۘۥۘ۬ۤۗۜۘ۫ۨۨۖۛۡۘۚۧۜۚۗۡۥ۠ۡۘۙۥۦ۫ۜۖۛ۬ۗۜ۠ۚۜۘۛۢۜۡۘۢۦۧۘۦ۫ۥۘۗۖۨ۠۠ۡۘۖۨۗۡۗۜۜۜۘ۟ۗۤۢۖۗۘۦۧۛۥ۠ۧۨۘ۫ۘۢۛۨۧۘ۟۫ۛ";
                                                        break;
                                                    case -596744108:
                                                        String str15 = "۫ۘۧۘۛۦۖۘۡۢۡۥۡۧۤۚۧۨۥۜۥ۠ۥۜۤۡۙۙ۬ۢۖ۬ۘۡۛۙۛ۟۟ۢۛۘۙۨۜۚۘۛۢۥۜۘۘۘ۠ۧۙۨۘۥ۟۬۠ۨ۬ۨۢۜۜۙۦۙۖۨ۫ۙۥۘ";
                                                        while (true) {
                                                            switch (str15.hashCode() ^ (-921612587)) {
                                                                case 163251985:
                                                                    str14 = "ۙۖۛۖۜ۟ۗۗۗ۟ۨۢۘۢۨۙۜۛ۠۠ۥۤ۫ۜۘۛۗۜۡۥۙۛۙۤۡ۠ۚۦ۟ۖۚۧۖۘۗۗۘۛۡۧۘۨ۟ۦۘۦ۬ۘۘۙ۫ۜۢۡۛۗۦ۬۫ۦۛۛۦۦۘۥۡۗ۫ۦۘ۟ۗۦۢۛۘۗ۫ۙ۟ۙۘۘۦۡۛۥ۬۫ۘ۫۠ۜۡۥ۫ۘۘۜۢۗ";
                                                                    break;
                                                                case 163896351:
                                                                    str15 = strArr.length > 0 ? "۬ۙۖۛۛۦ۫ۗۥۤۡۗۥۤۛۥۛۤ۠ۧۘۧۘ۫ۖۦۡ۫ۖۘۗۦۨۘۨ۫ۦۘۨۙۧۧۖۡۥۥ۠۬۠۠۟ۘۘۦۦۖۘۧ۠ۦۚۡۗۧۜۥۖۙۚۖۨۥۘ۠۟ۦۦۗۚۧۖۘۘۥ۠ۜ۠ۦۢۗۡۜۘ۬ۖۚۙۙۥۘ۟ۧۘۜۨۥۥۖۧۢۜۦۘۢۖ۠ۡ۠ۢ۬ۥ۫ۖۘۘۧۚۚۘ۟۟ۨۚۤۡۡۨۦۘ۫۬۫" : "ۦ۫ۧۘۜۨ۬ۤۨ۬ۘ۠۟۫ۚ۬ۘۘۜ۟ۨۘ۟ۚۧۖۙۛ۬ۢ۫۫ۜۡۧۨۘۘ۟ۘۖۘ۟ۧۦۘۛۗۢ۫ۨۡۘۥۜۥۗۙ۠ۛۦۘۡۗۢۚۖۜۘ۠ۦۡۜۚۧ۠ۜۖۧۜۘ";
                                                                case 1237714289:
                                                                    str14 = "ۡۧۙ۫ۛۜۘۨۜۖۦۚۚۡۦۡ۟ۜۖۜ۫ۙۙۖۤۦۛۡ۟۟ۦۘۧۨۧۧۖۖۙۥۧۘۙۗۢۚ۫ۦ۬ۖۤۦۦۢۧۦۜۘ۫ۙ۟ۤۙۛ۟ۚۘۨۚۤ۟ۧۦۘۘ۠ۛۘۥۗ۬۟ۤۧۡۘۘۖ۟ۦۨ۬۠۫ۛۘۧۛۖۡۛۜۗۘ۬ۡۦۗۙۤ۟ۚۛۖۚ۫ۗۘۗۥۘ۟ۙۛۤۤۖۘ";
                                                                    break;
                                                                case 1897262810:
                                                                    str15 = "۟ۡۡۘۙۖۚۙۗۘۖ۫ۡۘۖ۬ۖۢۖۤۗۡۜۘ۟ۖۘۥۖۗۡۛ۫ۧۤۜۥ۟ۨ۟ۧ۟ۨۥۗۘۧۘۘۤ۫ۦۤ۫ۗۤ۫۠ۧۜۨۢۖ۟ۙۧۧۦۚۦۚ۬۟ۨۖۚ۠ۨۜۛ۫ۦۦۢۧ۫ۗۜۘۤۡۘۘۘ۟ۦۘ";
                                                            }
                                                        }
                                                        break;
                                                    case 994720463:
                                                        str13 = "۟ۗۚۨ۠ۙۙۖ۫۬ۥ۠۟ۨۚۖۗ۠۠ۙۖۘۜۗۖۘۚۚۢۗۜ۫ۡ۟ۖ۟ۨۦۢ۫ۤۢۥۤۛۖۗ۬ۘۨۤۛۜۤۦۗۦ۫ۦۘۨۧۦۢۛۖۛۢۙۜۘۘۛ۬۬ۙۘۢۖ۬ۥۖۗۖۜۡۡۧۨۖۨۘۥۘۧۘۛۢ۟۟ۛۚۙۡۚۦۘۘۥۙ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -385469471:
                                            str12 = "ۦۚۜۦۥۥۤۨۨۚۛۜۘۧۥۡۘۡۛۚۘۡۥۗۤۥۘۧۖۘ۠۠ۤۨۦۨۘۗ۠ۛۗۡۖۡۡۘۚۥۙۤۨ۬ۥۢۦۘۜ۫ۙۗ۟ۚۨ۫ۜ۬ۧۚ۬ۖۨۨۤۖۘ۟ۛ۬ۜ۠۠ۛۜۦۖۖۘۘۚۜۖۘۙۙۨ۟ۘۘۘۙ۠۬ۢۗۦۘۥ۠۬ۨۢۦ۠ۢۚۦۥ۟ۘۚۙۜۡۚۢۛۧۤۡۢ";
                                            break;
                                        case 721250124:
                                            str13 = "۬ۗۘ۠ۘۧۥۘۗۢۥۘۚۨۖۘ۠۫۬ۡۦۤۧۛۡۥۗ۠ۗۡۖۗۘۢۨ۬ۨ۟ۦۛۗۥۜۘۡۗۨۧۨۚۥۖۘۢ۠ۤۢۖۜۙۡۥۖۖۛۖۖۗۦۗۥۘۨۗۖۧۤۥۘۗ۫۟۠ۙ۬ۗۨ۟ۡۖۦۙ۠ۧۘۤ۫ۧۛۖۨۤۗۖۚۚۢۖۘۗۙ۬ۨۢۧۧ۟ۤۢۡۥۤۤ";
                                    }
                                }
                                break;
                            case 1848424282:
                                str = "ۢۛۘۘۘۤۡۘۛۖۛۥ۟ۢۥۛۡۘۦۤۨۦۡۘۜ۬ۥۘ۬ۗۜۙۦ۬ۙۥۘۖۙۦۘۚ۬ۘ۟۬ۢ۫ۨۖۡۘ۬ۜۜ۬۟ۤۤ۟ۤۜۨۗۧۚۛۚۜۚۖۘۗۧۧۤۦۦۦۗۘۜۥۨۘۧ۫ۘۘۥ۠ۡۙۥۤۥۨۦۘۚۡۨۢۥۨۘ۠ۚۖۘۘۙۥۘۥۤ۫";
                                continue;
                        }
                    }
                    break;
            }
        }
    }
}
