package kentos.loader.utils;

import android.content.Context;
import android.content.DialogInterface;
import android.graphics.Typeface;
import android.graphics.drawable.GradientDrawable;
import android.os.Build;
import android.os.Bundle;
import android.widget.Button;
import android.widget.LinearLayout;
import android.widget.TextView;
import androidx.appcompat.app.AlertDialog;
import androidx.appcompat.app.AppCompatActivity;
import androidx.core.content.ContextCompat;
import androidx.core.view.PointerIconCompat;
import androidx.core.view.ViewCompat;
import androidx.recyclerview.widget.ItemTouchHelper;
import com.google.android.material.card.MaterialCardViewHelper;
import kentos.loader.C0931R;
import okhttp3.internal.http.StatusLine;
import org.lsposed.lsparanoid.Deobfuscator$$app;
/* loaded from: classes2.dex */
public class ActivityCompat extends AppCompatActivity {
    public static final int PERMISSION_REQUEST_STORAGE_LEGACY = 100;
    public static final int REQUEST_MANAGE_ALL_FILES = 101;
    public static final int REQUEST_MANAGE_UNKNOWN_APP_SOURCES = 200;
    public static final int REQUEST_OVERLAY_PERMISSION = 5469;
    private static ActivityCompat activityCompat;
    private boolean isPermissionFlowActive = false;

    /*  JADX ERROR: JadxRuntimeException in pass: BlockProcessor
        jadx.core.utils.exceptions.JadxRuntimeException: CFG modification limit reached, blocks count: 540
        	at jadx.core.dex.visitors.blocks.BlockProcessor.processBlocksTree(BlockProcessor.java:59)
        	at jadx.core.dex.visitors.blocks.BlockProcessor.visit(BlockProcessor.java:39)
        */
    private boolean areAllPermissionsGranted() {
        /*
            Method dump skipped, instructions count: 2226
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: kentos.loader.utils.ActivityCompat.areAllPermissionsGranted():boolean");
    }

    /* renamed from: dp */
    private int m74dp(Context context, int i) {
        float f = 0.0f;
        String str = "ۧ۫ۦۥۛۨۘۜۙۘۘ۟ۚۙ۫ۡۘۧ۫ۥۘ۠ۗۧۤۗۘۤۥۡۘۤ۫ۖۘ۠ۗۦۘۢۚۥۡۥۖۗۘۡۨ۟۫ۘ۬۫ۖۨۗۖۜ۬ۙۚ۠ۙۘۘۤۦۦۥۤۗۖۖۘۡۘ۟ۗ۟ۛۜۧۘۚ۬ۡۜۦۛۤۦۜۘۖۤۖ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 989) ^ 767) ^ 885) ^ 377) ^ 237) ^ 264) ^ 120) ^ 497) ^ 887) ^ 164) ^ 526) ^ 398) ^ 520) ^ 827) ^ 932) ^ 565) ^ 220) ^ 943) ^ 956) ^ ItemTouchHelper.Callback.DEFAULT_SWIPE_ANIMATION_DURATION) ^ 850) ^ 131) ^ 87) ^ 605) ^ 140) ^ 649) ^ 133) ^ 436) ^ 925) ^ 819) ^ 324) ^ (-1305666128)) {
                case -1519361204:
                    str = "ۢۖۜۜۘ۬ۦۥۨ۟ۡۥۘۢۢۨۙۚۥۚۖۘ۟۠۫ۢۚۜۘۤۖۜۜۡۜۛۚۢۜۙ۟ۘۛۦۘۥ۠ۜۘۗۗۦۘ۫ۘ۫ۜ۬ۡ۫۫ۢۘۜۘۙۛۨۧۘۨۤۜۥۜۖۘۦ۫ۨۡ۫ۨۜ۬ۘۘ۠ۙ۬ۤ۟ۦۘۧ۫ۖ۬ۢۘۘۨۦۡۥۙۡۛۨۜۘۜۚ۟";
                    break;
                case -358593900:
                    f = context.getResources().getDisplayMetrics().density;
                    str = "ۧۤۜۢۨۘۘۧۤ۟۠ۗۦۡۖۧ۫ۘۗۥۨۘۘۡۨ۬۫۟۠ۨ۬ۦۘۤۖ۫ۙۙۧ۫ۦۖ۫ۙۢۨۧۧۗۜۘۡ۠ۖۜۢ۟۬۬۫ۥۦۜۛۙۨۘۘۧۥۘۖ۫ۘۘۗۡۦۢۧۘۘۨۛۖۘۡۘۘۘۜۥۥۛۘۧۘۗۨۜۘ";
                    break;
                case 249036910:
                    return (int) Math.ceil(i * f);
                case 475416035:
                    str = "ۢ۬ۚ۠ۘۘۘۘۥۛ۟۬ۧۛۨۢۛۥۘۢۥۛۜۨۦۘۤۤ۟ۗۤۜۘ۬۟ۨۢ۬۟ۛۖۥ۫ۚۢۙۢۘۘۜۢۘۚ۫ۚۚ۫ۢ۫۠ۗۡ۟ۢ۫ۦۘۥ۟۟ۖۖ۟ۚۤۜۧۖۗ۠ۨۚۖۘۥۘ۠ۜۖۥۡۦۘۦۜۘ";
                    break;
                case 1778177029:
                    str = "ۘ۫ۨۤۦۨۦۚۖۡۤۦۖۗۚۜۤۧ۫۫ۖۘ۠ۗۖۘۙۧۘۘ۬۟ۨۘۢ۫ۖۥۡۘۙۤۛ۠ۙۘۚۗۛ۫ۚ۫۬ۛۘۢۧۚۜۘۘۥۛۢۛۨ۫ۨۗ۬ۚۧۗ۫ۘ۠ۜۧۥۘۖۗۢ۠ۦۜۨۘۡۙۥۨۘ۬ۦۨۘ۠ۘ۬ۢۥۢۖ۟ۥۘۨۗۙۧۨ۫";
                    break;
            }
        }
    }

    public static ActivityCompat getActivityCompat() {
        while (true) {
            switch (((((((((((((((((((((((((((((((("ۙۤۧۡۗۨۛۨۘۜۢۨۙ۬ۛۥۚ۟ۡۦۥۘۚۨۥۘ۠ۥ۟ۗۖ۬ۤۚۢۙ۟ۧ۫۬ۥۤ۬ۢۙ۟۠ۦۦۧ۫ۘۘۚ۫۬ۖۜۗۢۦۜۛ۟ۗۦۘۚۖۜۛۘ۟ۛ۬۬".hashCode() ^ 815) ^ 432) ^ 657) ^ 122) ^ 829) ^ 166) ^ 115) ^ 253) ^ 567) ^ 439) ^ 769) ^ 35) ^ 786) ^ 711) ^ 244) ^ 831) ^ 416) ^ 122) ^ 484) ^ 171) ^ 756) ^ 340) ^ 536) ^ 167) ^ 322) ^ 376) ^ 56) ^ 414) ^ 554) ^ 208) ^ 334) ^ 233159742) {
                case -478971969:
                    return activityCompat;
            }
        }
    }

    private void onAllPermissionsGranted() {
        String str = "ۘۚۦۡۖۡۘ۬ۥۨۤۢۛۚۗۗ۠ۛۦۥۜ۠۟ۘۘۘۙۡۜۘۙۨۦۘۤ۠ۡ۫ۦۧ۟۠۬ۜۥۛۡ۠ۖ۟۬۬۠ۙۨ۫ۥۖۤ۬ۖۘۦۧۡۧۘۘۨۛ۫ۨۛۤ۟۫۠ۢۡ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 778) ^ 724) ^ 38) ^ 598) ^ 173) ^ PointerIconCompat.TYPE_CELL) ^ 543) ^ 57) ^ 814) ^ 88) ^ 811) ^ 359) ^ 798) ^ 936) ^ 861) ^ 298) ^ 7) ^ 787) ^ 870) ^ 417) ^ 960) ^ 389) ^ 661) ^ 672) ^ 682) ^ 293) ^ 131) ^ 448) ^ 626) ^ 419) ^ 262) ^ (-244376058)) {
                case -2053883284:
                    String str2 = "۠۬ۙ۬ۢۦۘ۟۠۫۫ۗۦۛۙۦۘۛ۟۫ۡۡۘۡۡۨۘۗ۠ۖۘ۫۫ۙۜۨۖۘ۫ۤۘۚۦ۟ۡۗۦۗۤۢ۟ۥۧۘۖۜۜۘۛۨۧۧۛۢۢۙ۫۠۠ۚۧۚۚۚۖۢۗ۟ۦۤ۫۟ۚۥۦۘۢ۟ۧۡ۠۟۟ۨ۬۫ۖ۠ۡ۟ۘۦ۬ۛ۟۫ۚۙ۟ۥۘۛ۟ۗۨۗۤۥۘۘۡۧۙ۠ۘۘۧۗۧ";
                    while (true) {
                        switch (str2.hashCode() ^ (-899201406)) {
                            case -1654221300:
                                str = "ۧۤ۫ۢۦۢۨۚۖۘۤۢۤ۫ۚ۫ۧۖۜ۟ۛ۠۟۫ۘۧۜۛۚۜۥۡۥۘۘۥۧۘۢۡۙۥۧ۟ۨۙۧۛۙۢۢۗۛۗۙۖۛۜۨۘۜ۫ۢۧۡۨۢۢۦۧۧۘۙ۬ۜۜۤۖۜۘۗۢۘ۠ۘۡۡۗ۟۫ۨۤ";
                                continue;
                            case -1433062778:
                                str2 = "ۡۧۦۘۖۧ۟ۖۥۦۘۢۛۜۤۤ۫ۢۡۜۢ۠ۡۖۘۘ۬ۘۖ۬۫ۤۘۚ۫۬ۥۘۚ۟۫ۖۙ۬ۘ۟ۚۙۧۤۥۘۦۘ۟ۤۦۛۘۖ۫ۤۡۘ۫ۦ۬ۧۜۘۦۗ۠ۡۦ۫۠ۥۜۗ۟ۚ۫ۖۡۘۗۛۤۦۨ۬ۘ۬ۖۘ۟ۚۦۜۚۘۘۥۦۨۥۥۛۜۤۘۚ۫ۡ۫ۢۤۚۧۗۧ۠۫ۖۥۥۡۘۨۧۚۗۡۧۛۢۦۘۘۧۦۘ";
                            case -277357823:
                                String str3 = "ۤ۟ۨۜ۬۟ۡۗۨۘۡۧۡۡۙۥۘۘۘ۟ۚۗ۠ۜ۠ۛۡۧۖۘۘۧۥ۬ۡۘۘ۫ۧ۠ۙ۫ۥ۟۟۠ۖۙۢۦۜۘۦۦۦۖۡ۫ۢۗ۬ۤۦۨۘۤۡ۬۠ۥۥۘۦۘۖۡ۟ۙۘۜۗۤ۟ۨۘۘۡۙۤۛ۠ۤۡ۟ۘ۠۠ۦۨۡۜۛۥۙۖۧۦۜ۟ۚۘۦۘ۬ۘۤۦۦۨ۫ۢۧۘ۟ۙ۟ۨ۫";
                                while (true) {
                                    switch (str3.hashCode() ^ 950777178) {
                                        case -1161000642:
                                            str2 = "ۜۦۤۨ۬۬ۢۧۨۘۗۙۨۘۢۘۢ۫ۥۦۘۛۗۥۙۥۡۜۜۥۡۨۘ۟ۜۥۘۜۦۜۘۙۜۘ۠ۜۚۖۧۥۘۚۙۡۙۖۗۚۙۥۙۖۜۘۨۚۦۘۨۦۘ۟ۢۖۘ۠ۥۜۗۚۖۘۨ۟ۧۧۙۖۘۙۥۡۘ۠۫۫ۦۜۜۜۧ";
                                            break;
                                        case -425886598:
                                            str3 = "ۦۦۗ۠ۦۨ۠ۗ۠ۛۦ۬۠۠ۤ۫ۧۘ۬ۖۘۚۡۘۚۢۦۘۤ۬ۖۘ۬۟ۖۘۛ۟ۙۦۗۗ۠۫ۗۚۖۡۦۨ۬۫ۧۖۘۜ۟ۦۙۘۤۤ۟ۘۙۧۜۘۡ۟ۥۤ۫۫ۚۙۡۢۗۙۥۢ۬ۚۢۧۦۙۘۘۛ۠ۖۘۥۢۙۨۥۨۤ۫ۚۗۡۢ۟۫۠ۡ۫ۛۡۤ۟ۤۖۜۘۙ۟ۖ۬ۚۨۦۜۧۤۙۢۚۤۘۘۚۖۘۛۜۡۘۛۥۘۘ";
                                        case 558215768:
                                            String str4 = "ۙۜۛۙۘۡۘۤ۟ۛۥۨۘۜۤۗ۟ۜۘۘۦۚۘۘ۫ۡۤۦ۬ۜۘۘۨ۠ۦۘۜۘۚۖۘۘ۬ۗۖۧۨ۬ۤۘ۬ۚۤۛۚۡ۟ۚۜۨ۠ۖ۬۠ۨۨ۠ۜۧ۠۠ۡۛۢۦۛ۫ۛۥۦۨۘۙۛۥۧۘ۬ۦۤ۫ۡ۟ۚۢۨۜۙۛۖۡۜۗۜۘۥۥۡۛ۬ۜۘ۠ۖۖۘۡۘۧ۬ۜۜۥۡۦ۟۟ۛ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-1626816276)) {
                                                    case 391066758:
                                                        str3 = "ۘۘۘۗۨۥۚۗۨۘۗۗۡ۠ۘۥۢۦۧۛۖۘۚۚ۟ۦۤۜ۬ۖۡۛ۬ۘۥۢۨۡۢۜۘۨۜۥۧۜ۠ۜۨۧۘۥۥۧۜۖۛۧۨۚ۟ۖۧۘۘۚۥۖۦۖۘ۫ۦۡ۟۫ۜۘۘۥۖۨۙ۟ۨ۟ۨۘۗ۬ۜۡۥۖ۟ۖ۫ۧۗۙ۠ۦۦۤۤۖۘۤۦۢۡ۟۫";
                                                        break;
                                                    case 697430174:
                                                        str3 = "ۚۚۤۚۥۨۨۥۡۘۙ۠ۢۘۘۜۘۜۥۥۘۜ۟ۨ۟۠ۛ۬ۗۢۙ۫ۜۘ۫ۡۘۘۙۢ۫۬ۨۥۘۧۤۖۢۦۙۘۢۖ۬ۙۦۘۧ۬ۜۘۦ۬ۥۘۤۤۖۘۗۙۙ۬ۥۧۜۧ۫ۙۗۡۘۧ۬ۦۤۦۘۘۨۗۢۖۨۦۘۚۦ۠۬ۦۧۗۚۦۧ۬۠ۜۡۜۘۛۢۦۡۦۚ";
                                                        break;
                                                    case 1488820359:
                                                        String str5 = "ۜۚۡۘۥۦۦۘۤۜۨۘۥۘ۟۬۬ۚۙۨۘ۟ۨۢ۬ۦۥۗۥۨۘۘۗۜۢۗۘۖ۠ۧ۟ۛۜ۟ۢۗ۬ۡۚۖۧۗ۫ۚ۫ۘۨۖۧۢۨۘۡۚۧۥۛ۬۟۬۫ۤۚۖۧۥۘۨ۫ۖۧۨ۠ۖ۟ۨۘ۬ۤۢ۠۫ۘۘۥۢ۫";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ (-854345874)) {
                                                                case -1835714796:
                                                                    str4 = "ۤۦۘۘ۟ۤ۫۠ۨۖۚۨۡ۠ۜۨۘ۟ۗۚۥۤۨۧۛۜۙۦۥۘۙۛۗۖ۟ۧۥۘۚ۟ۙۡۘۚۖۘ۟ۘۘۘۘ۟۫ۙۨۖۘ۬ۧۛۙ۟ۡۘۛۖۖۘۚۦۚۘ۟ۙۨۥ۫ۗۘۢۜۙۖۘ۠۟ۥۘۖۚ۫ۦۘۨ۟ۥۤۤۨۘۡ۫ۛۢۦۖۘۛۘ۬ۗۢۛ۬۫ۨۘ";
                                                                    break;
                                                                case 424118513:
                                                                    str4 = "ۖۦۥۘ۬ۤۨ۬ۢ۟ۖ۟ۖۘۡۚ۟ۨۚۦۛۘۥۘۜ۟۟ۡۡۥۨۧۙ۬ۗۥۘۦۤۧۧ۫ۖۜۨۨۘۙۖۡۨۙۨ۫ۖۘۜۛ۫ۖۤۘۘۜ۟۟۫۟ۡۘ۫ۤۦۗۖ۠۫ۜۛۡۖۡۘ";
                                                                    break;
                                                                case 1025244175:
                                                                    str5 = "ۗۛ۬ۛ۟ۖۘۚۗۙۛۤ۫ۜۥۖۘ۫۟ۨۘۡۘۥۢۜۦۘۖۥۦۘۖ۠۫ۡۧۨۘ۫ۢ۬ۛۗۘۧۗۦۢۥۥۘۗ۬ۜ۫ۜۧۜ۬ۥۘۡۖۘۛ۠ۖۢۨۤۘۛۖۦ۫ۤۧۜۧۘۢ۠ۘۥۘۦ۟ۢۛۢۚۡۘۛۚ۟ۖ۟۟";
                                                                case 1145857382:
                                                                    String str6 = "۠ۚۖۚ۟ۧ۟ۡۦ۬ۜ۟ۨ۬ۥۘۚۗۢۦۥۘۙۘۧۜۥۜۘۜۜ۠۟ۡۢۤۤۦۘۛۜۜۚۛۡۘۙ۟ۥۘ۟ۧۛۙ۠ۡۘۘۧۥۙۛۢۧ۫ۖۘۦۧ۟ۦۤۖۘۥۥۡۘ۟ۗۡۘۖۦ۬ۘ۫ۜ۬ۘۘ۠ۖۨۘ۠ۡۦۘۗۢۨ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ 1278102084) {
                                                                            case -1163740107:
                                                                                str6 = this.isPermissionFlowActive ? "ۗۙۦۘۤۖۦۘۜ۠ۜۘ۬۟ۘۘۧ۠۠ۤۨۨۘۜ۬ۡۚۚۡ۟۬۠ۘ۬۬ۦۜۛۘۤۡۘ۟ۙۘۥۘۜۘۦۨۗۤۖۥ۫۟ۜۘۜۥۨۢ۟ۗۗۧۤۢۨۗۥۨۘ۫ۙۘۘۡۜۗۛۖۚۜ۫ۘۨ۬ۥۘۦۖۧۘۤۦۨۘۗۛۧ۬ۦۖۘۖۜۥۘ۬ۧ۫ۧۙۡۤ۬ۜ۠ۘۘۖۥۖۘۢۛۥۘۙۛۤۡۤۚۡۥۢۤ۬ۚۡ۟ۥۛۨ۠ۚ" : "۬۟ۥۜ۬ۢۜۧۜۖۥۜۛۚۙۧ۟ۥ۫ۦۚ۠ۡۙۘۚۖۘۘۦۢۘ۠ۡۘۛۨۛۙۧۜ۬ۤۦ۬ۧۥۘۥۘۜۘۗۥۖۘۢۙۙۜۨۛۚۙ۫۬ۗۗۧۛۦۘۚۚ۟ۧۚ۠ۨ۬ۨۘ";
                                                                            case 500683341:
                                                                                str5 = "ۗۖۘۗۢۥۘ۠ۙ۬ۜۡۢ۬۟ۚۙۨۜۘ۬ۛ۬ۧۧۨ۬ۦۤۢۥ۫ۥ۟ۦۛۤۖۘۡ۟ۧۨۡۘ۟ۤۤۖۙۡۜ۟ۘۘۢۨۡۘۜۨۘۢ۫ۡۘ۬ۛۧ۫ۦۜۘۙۗ۬ۧۦۧۘۙۛۥۘۡۘۡۘۨۖۢۥۜۘ۬۬ۡ۫ۛۗ";
                                                                                break;
                                                                            case 1223148838:
                                                                                str6 = "ۡ۟ۦۤۧۨۘ۬ۚۧۨۘۜۢۡۦۘ۫۠۠ۧۤ۬ۧۡۘ۫ۛ۬ۡ۫۠ۤۥۛۚۨۦۤۡۢۜۨۘ۫ۤۡۘۖۤ۟ۦۧۥۘۨۘۙۛ۬۬ۧۛۘۖۚۖۖۡ۟ۗۥۛۡۗ";
                                                                            case 1575156686:
                                                                                str5 = "ۧۥ۫ۧۚۤۦۡۘۢۖۥ۬۠ۢۢۤۤ۠۬۫ۧۗۜۢۜۡۘۥۨۘۢ۬ۦۘۡۨۗۘۖۡۤۢ۟ۘۦۡۘۡۛۘۗۤۤۢۡۖۘۗۚۧۧۗۗۜۘۖۘ۬ۗۡۧ۟۟ۖ۬ۗ۠۬ۜۢۤۡ۟ۧۗ۬ۘۤ۬ۜۗ۫ۦ";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 1509634671:
                                                        str4 = "ۡ۫ۤ۟ۡۨۜۘۙۚۥۘۘۨۙۢۜۘۘۢۘ۟۬۬۟ۥۢ۠ۗۥۖۘۚۥ۟۬ۧۦۘ۫۠ۤ۬ۨۘ۠ۙۖ۟۫ۖۘۥ۠ۡۢ۬ۙۙۗۨۛۨۜۘۙۡۨۧۚۜۖ۠ۦۘۘۢۡۖۥۜۘۜۖۘۘ۠ۙۡۘ۟ۤۥۘۡۦۤۖۖۦۘ۠ۖۜۘ۠ۢۖۛۥۛۦۛۜ۠ۨۜۘۡ۫ۙۥ۟ۧ۬ۜۦ۫۬ۛۧۦۦ";
                                                }
                                            }
                                            break;
                                        case 1515091366:
                                            str2 = "ۡۜ۬ۡۖۘۖ۟۠ۗ۟ۘۦۡۢۚ۟ۦۘۚۢۡۙۜۘ۬ۥۨۗۘۧ۟ۙۜۨۖ۠ۨۘۤۨۜۥۙۨ۬ۛۘۧۘۧۡۘۘۡۡ۠ۖۤۜۢۙ۫ۜۛۜۘ۠۬ۖ۫ۜۡۘۙۘۧۘ۟ۘۜۘۧۢۡۢۗۥۘ۬ۨۘۗۡ۬۫۟ۦۘۘۡۦۥۥ۠ۚ۫ۨۨ۬ۘۘ۟ۘۘۛۡۨۘ۫ۜۡۛ۟ۤ۬ۛۦۘۢۖۘ";
                                            break;
                                    }
                                }
                                break;
                            case 899515892:
                                str = "ۥۙۨۘۡۗۜۘۚ۬ۨۘۜۚۜۘۗۛۥۘ۟ۙۙۖۛۦۘۙۦۨۘ۬ۚۥۘۡۢۗۚ۬ۙۘ۠۟ۘۥۘۘۥۦۘۧ۠ۥۘ۟۬۬۫ۛۛۢۚۙۛۘۦۦۥۨۚۜۖۗۘۖۘۢۡۨ۫ۢۖۘۘۤۚۖۜۦۛۙۧ۟ۘ۟ۢۨۘ۠ۗۖۜ۠ۡۨۢ۬ۖ۫ۦ۟ۖۜۘۗ۫ۨۘۙۗ۫ۘۚۖۘ۠ۘۚۢۢۖۢۙۧۖۧۘۧۥۘۘ۫ۦۘ۟۫ۦ۟ۦۖۘ";
                                continue;
                        }
                    }
                    break;
                case -1311387665:
                    System.exit(0);
                    str = "ۧۤ۫ۢۦۢۨۚۖۘۤۢۤ۫ۚ۫ۧۖۜ۟ۛ۠۟۫ۘۧۜۛۚۜۥۡۥۘۘۥۧۘۢۡۙۥۧ۟ۨۙۧۛۙۢۢۗۛۗۙۖۛۜۨۘۜ۫ۢۧۡۨۢۢۦۧۧۘۙ۬ۜۜۤۖۜۘۗۢۘ۠ۘۡۡۗ۟۫ۨۤ";
                    break;
                case -335398720:
                    str = "۬۠۫ۦۗۦۘۙۙ۟ۘۦۥۥۛۚۜۘۛۚۨۘۧۢۤۛۙۗۖۥۧۤۖۜۢ۟ۛۙۛۥۘۖۖۦۘۥۚۗۖ۠ۦۙۚۜ۫ۤۥۡۤۙ۬۠ۥۧۥۦ۟ۥۧۘۢۙۦۛۢۤۙ۟ۥۢۥۜۛۥۡۢ۠ۘۘۜ۫ۨۘۖۦۜۜۗۨۡۘۘۚۥ۠ۨۦۡ۟۟ۨۘۛۘۡ۬ۨۧۜۗۢ۬ۙۡۘ۟ۖۥۘۚۢۜۘ۟ۢۧ۠ۢۡۗۢۜ۫";
                    break;
                case 1425749788:
                    return;
                case 1757767392:
                    finishAndRemoveTask();
                    str = "ۛۜۛۢۤۦۘ۬۟ۜۘۚۦۦ۫ۙ۟ۨۦۙ۠ۨۦۥۛ۫ۨۦ۫ۜ۟ۘۚۡ۟ۦۘۘۨۦۘۦۡۨۘ۬ۘۨۘۖ۟ۜۥۜۜۦۦ۫ۧ۬ۛۜۙۖۘۘۘۜۜۡۘ۟ۡ۬ۘۨۥۤۥۜۥۗۡ۬ۛۡۙۖۜۜۢۛۢۚۦۡۧ۠۬ۨۛۡۗۥۢ۫ۙۧۚۧۗ۬ۦۚ۠۠ۨۥ۟۠۫۫ۗۨ";
                    break;
            }
        }
    }

    /*  JADX ERROR: JadxRuntimeException in pass: BlockProcessor
        jadx.core.utils.exceptions.JadxRuntimeException: CFG modification limit reached, blocks count: 363
        	at jadx.core.dex.visitors.blocks.BlockProcessor.processBlocksTree(BlockProcessor.java:59)
        	at jadx.core.dex.visitors.blocks.BlockProcessor.visit(BlockProcessor.java:39)
        */
    private void requestNextSpecialPermission() {
        /*
            Method dump skipped, instructions count: 1262
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: kentos.loader.utils.ActivityCompat.requestNextSpecialPermission():void");
    }

    private void showCustomPermissionDialog() {
        LinearLayout linearLayout = null;
        TextView textView = null;
        TextView textView2 = null;
        AlertDialog alertDialog = null;
        GradientDrawable gradientDrawable = null;
        int i = 0;
        int i2 = 0;
        Button button = null;
        String str = "۟ۨۦۘ۬ۦۨۦۤۥ۬ۦۖۘۛۥۢۚۢۡۘ۫ۚۤۛۢۘۢ۫ۦۘۜۨۦ۬ۖۡۘۥۜۤۧۜۧۖۛۥ۬ۗ۫ۗ۫ۡۘ۠ۨۡۦۧۧ۬ۛۢۙۨۥۘۘۜۥۘ۫ۢۗۨۢۚۢۜۜۘۜۘ۟ۤۢۘۘۙۘۥ۟ۥۨۢۜۖۘ۠ۦۥ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 695) ^ 474) ^ 352) ^ 230) ^ 424) ^ 95) ^ 297) ^ 180) ^ 172) ^ 528) ^ 481) ^ 846) ^ 641) ^ 21) ^ 510) ^ 80) ^ 124) ^ 782) ^ 804) ^ 802) ^ 790) ^ 401) ^ 756) ^ 989) ^ 11) ^ 494) ^ 244) ^ 13) ^ 10) ^ 533) ^ 7) ^ (-892152122)) {
                case -2068862470:
                    linearLayout.setPadding(m74dp(this, 16), m74dp(this, 16), m74dp(this, 16), m74dp(this, 16));
                    str = "ۗۤۜ۟ۦۢۘۜۙۥۦۜۡۚۖۗۘۦۛۥۘۨۨۨ۠۠۟۫۫ۧۡۡۘۥۦۨۘ۫۫۬ۥۢۡۘۧ۫۬ۡۚ۫ۡ۠۫۬ۢۤۖۖۘۘۘ۠ۦ۬ۡۥۢۛۨۜۦۦۨۡۖۘۘ۬ۡۦۢۘ۠ۜۨۥ۟ۙۤۛۡۘۦۡۖۙۚۗۦۜۗ۬ۤۥۘۤ۫ۥ۠ۤۜ۫ۡۗۧۦۜۘۘۧ۬۫ۙۡ۟ۨۘۢۡۥۘۢ۫ۨۘۧۜ۠ۦۨۢۧ";
                    break;
                case -1931513789:
                    textView.setTextSize(18.0f);
                    str = "ۚ۬ۨۘۥ۟ۥ۠ۥۖۢۥ۬۟ۖۥ۫ۘۡۡۘ۫ۢۗ۬ۙۥۨۨۘۘۛ۬۬ۦ۟۬ۗ۟ۘۤۧۥۘۖۘ۟ۛ۬ۡۦۥۙۜۖۘ۫ۥۜۘۨۙۜۘۧۗۡۜۜ۫ۘۛۡۘۙۙۦۤۤۛۚ۫ۡۧۙۚۤۖۨۖۜۥ۟ۙۤۗ۠ۗۚۤۢۗۦۘۢۢۙۜۗۡۘ";
                    break;
                case -1921916769:
                    textView2 = new TextView(this);
                    str = "ۦۙۖ۫۬۠ۤۤ۠ۨۡۘۙۘۛۗ۠ۙۦۚۚۦۢۧۥۧۛۤۜۢ۠ۧۗ۬ۖۖۦۨۘ۠۟ۙۚۖۘۘۖۙۛۙۨ۫ۙۦۘۢۢۖۘۡۨۨ۬ۗۡۘۧۡۡۘۧ۫ۨۘۥ۬ۢۛۦ۬ۦۥۖۘۛۡۨۜۗۦۤۤۘۘۤۦ۠ۤۦۡ۟ۥۨۦ۬ۘۧۜۨۙۚۜ";
                    break;
                case -1817556558:
                    linearLayout.addView(textView2);
                    str = "۫ۥۤۖۙۡۘۛۚۘۘۢۜۦۖ۠۟ۘۤۗۙۗۨۚۥۥۙۚۤۗ۟ۢۚ۫ۘۘ۟ۚ۫ۗۜۧۘۤۧۘۜۧ۠ۡ۬۫ۥۜ۫ۨ۬ۨۗۙ۟ۨ۟۟ۜۧۘ۫ۤۖۘۙ۠۫ۙۖ۠ۤ۟ۢۗۥۥ۠ۥۖۥۥۤۛۙۥۧۖۡۘۗ۫ۦ۟۠ۖۘۜۚۡۘ۫۠۫ۧۜۜۘ";
                    break;
                case -1616605832:
                    i2 = m74dp(this, 40);
                    str = "۫ۤۙۤۧۦۖۗۖۘ۠ۨۢۡۚۘۘۧۢۦۘۧۛ۟ۛ۫ۚۨۤۘۛۦۖۘۦ۠ۥۤۦۡۢ۬ۗ۬ۢ۠ۛۗۘۘۧ۬۟ۡۢۨۘۗۨۖۘۛ۠ۜۘۜۜۧۙ۟ۦۘۥۨۖ۠۠۫ۚۥۚۧۢۗ";
                    break;
                case -1460607598:
                    button.setTextColor(ViewCompat.MEASURED_STATE_MASK);
                    str = "ۙۜۥۘۙ۟ۥۘۜ۟ۗۙۤ۬ۙۜۘۘ۠۬ۧۥۨۖۙۧۚۙ۫ۜۜۜۡۜۚۡۘۨۜۧ۟ۛۘۥ۬ۧ۠۫ۘۘۛۘۖۘۧۨۢ۠ۛ۬ۘۦۥۡۨۡۘ۫ۗۙۜۗۡۘ۟ۨۘ۫ۛۚ۟ۧۚۧۜ۬ۘ۬ۡۘۜۢۦ۟ۘۨۙۧۙۤۗ۠ۙۤۜ۟ۛ۫ۥۘۘۚۥۢۨۧۖۜۜ۫ۤۗۖ۫ۧ۫ۛۡۘۚۦۦ۬ۥۖۘۗۢۖۤۡۚۘۜۦۘ";
                    break;
                case -1442809092:
                    alertDialog = new AlertDialog.Builder(this).setView(linearLayout).setCancelable(false).setPositiveButton(17039370, new DialogInterface.OnClickListener(this) { // from class: kentos.loader.utils.ActivityCompat$$ExternalSyntheticLambda0
                        public final ActivityCompat f$0;

                        {
                            this.f$0 = this;
                        }

                        @Override // android.content.DialogInterface.OnClickListener
                        public final void onClick(DialogInterface dialogInterface, int i3) {
                            String str2 = "ۖ۠ۛ۫ۢۧۗ۟ۙۥ۫ۡۘۘۨۨۘۚۚۥۙۘۙۥۖۙ۟ۖۢۨۤ۠ۖۨۖۨۜۡۜۡ۫ۖۘۖۘۜ۠ۡۛۦۡۘۤۤۖۘۦ۟ۘۖ۠ۜۘ۟۠۠۠ۖۘ۫ۛۦۘۥۛۡۘۖۤۖۗۧۜۗ۬۟ۚ۬ۨۘۨۚۗۢ۬ۦ۟۫ۦۘۦ۬۫ۤۛ۫۬ۡۢ۫ۨۨۘۗ۬ۘۘۜۛ۫۫ۘۢۗۥۘ۫۟ۛۤۧۡۘۙ۠ۛ۠ۦ۫۠۫۟ۖ۠ۤۤۜ";
                            while (true) {
                                switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 534) ^ 789) ^ 247) ^ 313) ^ 233) ^ 146) ^ 573) ^ 600) ^ 556) ^ 608) ^ 131) ^ 859) ^ 638) ^ 320) ^ 80) ^ 171) ^ 48) ^ 197) ^ 266) ^ 288) ^ 671) ^ 106) ^ 863) ^ 905) ^ 501) ^ 750) ^ 881) ^ 907) ^ 344) ^ 390) ^ 818) ^ 1925116081) {
                                    case -1436364594:
                                        str2 = "ۡۤ۟ۖۤ۬ۛۖۘ۬۬ۡۘ۟۠ۗۜۘۘ۠ۖۨۘ۠ۘۢ۟ۥ۠۬ۦۨۢ۫ۙۖ۬۠ۚۥۤۚۘۖۖۤ۫ۤۨ۬ۢۚ۟ۙۖۖۧۙۚۤۢۖۘۗۡۖۘۙۙۡۘۤ۠۫ۦۛۦۘۢۗۜۧۙۜ۬ۧۧۙۘ۫ۛۜۘۦۡۨۘ";
                                        break;
                                    case -985818788:
                                        str2 = "ۢ۬ۚۘۚ۫ۘۜ۫۠ۨۚ۠ۛۖۘ۬۟ۛۡۜۘ۫۟ۢ۫۫۬۬ۧۘۘۛۘۘۘۦۧۡۙۢۥۙۦۛۙۤۦ۬۬۬۬ۡۨۗۛۧۥۧۘۗۡۨۘۤ۟ۖۘۛۦۜۧۚۨۘ۟ۤۨۦۥۥۗ۠ۦۘۛۚۨۥ۠ۨۨۡۡۛۤۖۖۨۘ۠۬ۘ۫ۦۘۨۤۢۢ۠ۦۘ";
                                        break;
                                    case -505292002:
                                        this.f$0.m73x84800654(dialogInterface, i3);
                                        str2 = "۟ۡۥ۬ۦۙۛۡۗۚ۫ۚۘۖ۠ۙۦۛۥۢۖۘۙۙۚۚۥۖۘ۬ۧۚۜ۠ۤ۬ۦۤۡۨۡۘۤۖۦۧۥۘۛۦۦۘۤۡۜۘۦۥۚۥ۟ۖۦۡۖۘ۬ۖۙ۬۫ۘۘ۟ۚۡۦۤۦۘۗۜۦۘۖۜۧ۟ۗۗۚۛۤۦ۟ۜۘۜ۫ۥۗ۫ۜۘۢۛۖۧۗۦۘۛۜۦۨ۬ۜۥ۟ۗ۫ۧۨۤۗۨۨۦۘۛ۟ۖ";
                                        break;
                                    case 678786614:
                                        str2 = "ۦۧ۬ۡۡۧۘۖۢۚۘ۬ۡۖۨۨۥ۟ۤ۬ۙۡۘۘۜۨۛۥ۫ۘۥۜۘۡۡۜۗۙۙ۬ۖۘۚ۠ۜۛۥۜۙ۫ۨۤۘۘۨۥۜۘ۫ۡۗۚۘ۠ۗۙۨۘۜ۫ۖ۬ۗۜۘۜۗۖۙ۬ۧۥۘۡۡۦۨۘۜۥۘۘۘۡۗ۫۠ۨۢۦۧۨۘۜ۠ۥۤۢۥۨۘۚۧ";
                                        break;
                                    case 1584150962:
                                        return;
                                }
                            }
                        }
                    }).create();
                    str = "۠ۡۨۤۖۦۛ۟ۗۥۢۙۦۥۨۘۙ۫۟ۚ۬ۡۘۖ۫۟ۦۗۘۛۙۙ۬ۛۨۘۥ۬ۙ۠۬ۖۦۘۧۘ۟۫ۧۤ۠ۨۢۥۗۖۢ۟۠ۛۨۖۡۦۤۜۘ۫ۙ۠ۗۦۛۚۜۨۢ۬۟ۡۤۨۘۤۖۨۘۖ۟ۦۜۖۛۙۖۦۥۗۨۡۨۦ۠۟ۖۘۨۖۨۘ۫ۙۘۧۙ۠ۛۧ۟۫۟ۥۘۙ۫ۖۘۛۚۘۘ";
                    break;
                case -1384561677:
                    gradientDrawable.setCornerRadius(m74dp(this, 4));
                    str = "ۡۦۦۘۥ۫ۘۘۦۖۦ۬۫ۡۘۨۜۖ۬۫ۜۚۧ۫ۦۡ۫ۘۡۛ۫۠۫ۙۢۗۧۥۥۘۖۢ۠ۥۨۧ۠ۛۛۗۘۚۦۙۜۘۧۥۢۡۜۜۘۨۦۨۘۡۦۢۖۨۨۘۡۤۙ۟ۛۗۢۢۦۧۤۙ۟۬ۜۖۧۧۥۤۙ۠ۧۤۖۥۘۧ۠۟ۨ۟ۘۘۤۤۜۘۗۘۦۘۥ۟ۚ۫ۧ۫ۚۡۦۘۢ۠ۦۘ۠ۥۜۗۛۜۘ۬ۨۜۘۛۥۖۘ۠ۖۤۥۨ۟";
                    break;
                case -1352239702:
                    textView.setPadding(m74dp(this, 8), 0, 0, 0);
                    str = "ۙۘۜۗ۟ۚۜۤۖۘ۫ۙۧۚۡۧۧۧ۟۟ۦۘ۫ۥۧۡۛۨۖ۟ۡۘۜۘۖۨۧۘۤ۫۟ۡۢۥۘۛۜۘۨۜۦۥۢۡۘۛۥۜۚۙۡۘۡۗ۟ۦۡۢ۟ۙ۠ۦۧۘۡۘۙۗۜ۫ۖۜ۠ۥۡ۟ۖۢۥۙۢۧۛۖ۬۟ۥۘۙۚۧۤۛ۫ۜۤۖۢۙۦ۫۟ۖۘۦۤ۫ۡۜۨۘۚۦ۫۬ۢ۫";
                    break;
                case -1338080106:
                    textView2.setPadding(m74dp(this, 8), m74dp(this, 8), 0, 0);
                    str = "ۨۥۦۘۗ۫ۢۖ۟ۡۗ۬ۥۡۖۜ۫ۛۢ۟ۢ۬ۤۗۜۖۡۘۚۙۧۤۦۛۖۜۜۙۘۦۘۢۤۧ۬ۜۘۢۗۖۘ۠ۖۖۢۦۥۛۛۥۘۥۚۥۘۖۘۛۖۜۚۧۢۨۘۦۜۜۘۘۜۙۖۡۦۘۨ۫ۚۨۧۨۘۙۡۚۛ۬ۜۖۜۜۛ۬ۥۘ۠ۧ۟ۡ۫ۘۘۡۛۖۙۢۨۦۢۙۚۘۦۘۗۛ۠ۛ۫ۦۘ";
                    break;
                case -1212726946:
                    String str2 = "ۢۖۤۨۧۡۘ۟۬ۡ۠ۜۖۨۙۦۘۜ۟ۙۥ۫ۤۘۙۜۘ۬ۡ۟ۦ۠۬ۖ۟ۡۡۙۨۛ۬۠۠ۥۤ۟۫ۦۘۥۢۦۨۥۘۦ۬۟ۘۖۢ۫ۢۖۘۤۡۙۜۡۨۗۜۡۧۦۙۢۧۥۘۡۥۗۢۡ۬ۙۘۢ۟۟۟ۡۜۛۙۤۙۥۨۥ۠ۙۗۤۖ۠ۙۙۘۘ";
                    while (true) {
                        switch (str2.hashCode() ^ 1302255089) {
                            case -971519973:
                                str = "ۤ۫ۚۧ۟ۚۧۜۗۙۦۛۦۡۚۨۙۙۦۖۦۦۡۖ۟ۥۨۤ۟ۚۡۢ۠ۚۘۖۘۖۘۦۘۗۜۧۜۘۦۢۦۘۥۜۗۧ۟ۜۥۨ۠ۥۨۦۘۛۢ۫ۡ۟۠۬ۙ۫۠ۙۦۗۧ۬ۙۢۘۘۦۧۥۘۡۖۜۡۦۦۘۢۢۨ";
                                continue;
                            case -278228984:
                                String str3 = "۬ۥۦۨۛۜۘۗۘۖۘۖ۟۠ۨۖ۬۠ۖۦ۬ۧۛ۟ۖۧۡۦۨۙ۟ۦۡۢۘۛۦۘۥۙۘۨۨۡۜۤۤۤ۬ۜۡۥۛۦۢۗ۬ۤۜۘ۬ۜۧ۬ۥۤۚ۠ۦۜۥۨۨۦۥ۫۠ۖۗۨ۟ۡۢۤۨۗۥۜۢۘۘۙۖۤۖۥۘۜ۬۬ۗ۬ۦۘۗۙۜۘۜۨ۠ۥ۬ۨۘۘ۠ۡۖۚ۫۬ۥۖۘۚۨۨۘ۫۟ۗۖۨۢۖۚۛۢۜۜۖۨۡ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-1003605474)) {
                                        case -1686127577:
                                            str2 = "۫۫ۦ۠ۢۘ۟ۤۜ۫ۙۘۨۗۦۗۖۘۖۘۛۗۖۧۘ۠ۢۢ۠۫ۜۘۛ۟ۙۙ۠ۖۘۢۜ۠ۥۡۨۘۙ۠ۜ۠ۜۗۢۨۗۜ۠ۤۜۙۚۚۥۘۧ۠ۥۘۚۘۧۤ۠ۖۘۙۜۧۜۙ۟ۥۘۥ۬ۥۤۛ۫ۖۘۧ۟ۜۤۡۧۘ";
                                            break;
                                        case -581489159:
                                            str3 = "ۦۨۤۨۗۜۘ۫ۚۦۘۢۤۥۡۘ۠ۚۨ۫ۚۚۦۘۤۚۦۘۚ۠ۨۘۥۥۨۘۖ۠ۨ۫ۥ۟ۛۡۥۦۥۤۡۧۨۘۢۜۤۛۚۚۦۢۡۘ۠۫ۤ۟۬۠ۜ۫ۗۡۥۜ۬ۦۨۡۗۙۧ۬ۙۧ۠ۗۢۖۗۗ۬۬ۧ۠ۙۗۦۗۚ۫ۙۛۘۘۡۗۢ۫۬۟ۤۙۦۗ۫ۚ۬ۚۨۘۤۦۥۗۗۗۜۙۜۗۥۨۘۥۜۨۤۘۨۘۙ۟۬ۡ۠ۜۘ";
                                        case 64059030:
                                            str2 = "۫۟ۥ۬ۖۥ۟ۛۢ۬ۦۘ۬ۢۦ۫ۡ۠ۧ۟ۗۖۥۖۘ۬۠ۡۘ۟ۙۙۛۨۧۘۘۢۘۘۨ۫ۘۘ۟ۧۨۘۥۡۜۡۢۗۨۢۙۘۙۙۥ۬ۜۜۥۦۦۗۡۚۛۗۦۛۡۨۦۥۦۤۤۥۘۦۚ۟ۦۨۥ۠ۘۜۥۦ۬";
                                            break;
                                        case 252997274:
                                            String str4 = "ۚۦۛۥۘۚۗ۬ۜۙ۬ۤ۟ۨۡۨۜۡۘۖۦ۟ۡ۟ۦۥۥۧۢۡۜ۠۟ۤۨۡۦۤۗ۟ۦۚۛۢۛۘۘۡۖۘۨۧۦۤۗۦ۠ۗۗۥۛ۟ۖۤۗۤ۬ۨۛۘۦۧۡۜۙۙۥۘۨۙۦۘۤۡۖۘ۫ۖۘۘۧۙۢۜۥۖۘۙۦۧۘۤۗۥۧۦۥۘ۠۠۟ۖۧۡ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-418442389)) {
                                                    case -2056732046:
                                                        str3 = "ۡۧۚۧ۟۫ۢۖۘۜۜ۟ۤۨۥ۬ۜۦۘ۠ۨۚۨ۬ۨ۠ۥۘۚۘۢۚۗ۬ۡۨ۟۟۟ۨۥۚۡ۟ۨۚۘۨۘۤۤۘۖ۠ۙۖۚۙۤۖۚۨۦ۟ۖۖۡۘۗۦۜ۠۬ۥ۬ۗۚۜۜۜۘۙۡۦۘۘۦۖۘۨۤۗۦۙۦۧۢ۠ۧ۫ۘۘۤۘۦۦۖ۫۬ۤ";
                                                        break;
                                                    case -2033183294:
                                                        str3 = "ۡ۠ۜۘۡ۬ۚۙ۬ۗۨۦۜۘۘۚۧۚۚ۟ۨۡۘۘۘۧۙۥۗۚۧۗۡۘ۫۬ۤۢ۬ۧۥۦۦۘۥۡۡۘۙۡۨۦۦۡۦ۬ۦۘ۬ۥۢۢۖۡۘۜ۫ۖۥ۠ۦۢۚۥۢۥۨۖۙۥۖۜۢۗۢۖۥۛۗۧ۬ۙ۟ۜۡۘۛۖۚۗ۬ۨۧ۠۟۬ۨۥۘ۬۠ۚۢۙۘ";
                                                        break;
                                                    case -1587232215:
                                                        str4 = "۫ۤۨ۬ۢۧۢۥۨ۠۠ۗ۟ۜۦۘۥۖۜ۬ۘۖۘۤۙۧۢۛۨ۟ۥ۫ۧۥۨ۠۟ۚۡۢ۟۟ۡۦۧ۟ۨۘ۟ۧۢۜۘۛۧۛۤ۟۟ۗۙۨۨۡۘۖۥۘۘۡۛۘۘۡۘۜۨۚۖ۟ۧۦۧ۠۫ۙ۠ۜ۠ۨۗۨۨۨۘ";
                                                    case -769347053:
                                                        String str5 = "ۥۤ۟ۨۚۢۘۖۦۘۢ۬۫ۨۘۦ۫ۘۜۘ۫ۢۦۘۥ۫ۘۧۜۛ۠ۛۡۧۙۡۡ۫ۦۘۤۙ۟۫ۚ۠ۙۖۙۚۡ۟ۤۜۜۙ۟ۨۘۛۧ۠۬۫ۦۘۚۤۜۘۚۡۦۘۢۗۖۘۜۤۗۚۖۡۦۚۦ۫ۚۗ۠ۤۙۡۗۨۘۥ۠ۜ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ 248069228) {
                                                                case -877726559:
                                                                    str4 = "ۤۧۖۚۢۢۚۤۨۘۢۧۡۘۨ۬ۡۨ۫ۧۘۚۛۖۤۡ۬ۦۧۘۡۡۢۤۨۨۘۡ۫ۧۧۥۘۢۦۖۘۦۙ۫ۨۙ۫ۡۙ۫ۦۘۗۧۘۘۚ۫ۢ۫ۙۜ۟ۚۘۘۖۦ۬ۗۙۘۖۘۡۘ۟۟ۦ۬ۡ۫ۤۤۥۘۛۤۚۛ۫ۥۘۦۜۗۡۘۥۤ۟ۜۡۨۧۧ۠ۛۤ۟ۦۥۗۥ۟۟ۧ۠ۦۨۘۧۨۡۡۚۖۦ۟ۤ۟ۜۘ۟ۙۗۚۧۤ";
                                                                    break;
                                                                case 257105095:
                                                                    str5 = "ۧۥۤۤ۫ۢۨۥۦ۬۬ۜۘۡ۠۟۟۫ۖۘ۬۬ۜ۟ۖۘۘۜۧۡۘۡۤۦۘۙۨۘۘۗ۫ۦۘ۠ۛۗۥۡۘۘۙۨۤۘۧۜۜۧ۠ۘۖۤۖۛۧۚ۬ۜ۟ۨۥۨۖۡۘۧۖ۫ۨۦ";
                                                                case 1054190925:
                                                                    str4 = "۬ۦۛۜۧۡۢ۟ۦۘۥ۟۫ۗۙۡۘ۟ۛۦ۟ۦۥ۫ۘۦۨۖۧۘۧۧۜۘۚۢۖۘ۬ۚۥۛۡۥۜۥۘۙۢۜۡۡۖۗۘۚۛۦۘۘۛۖۤۖۙ۟۟ۨۖۘۗ۠۟ۖۨۥۘۖۗۢۧ۬ۡۛۨۨۚۧۥۘۖۡۢ۟۟ۙۦۡ۠";
                                                                    break;
                                                                case 2042563578:
                                                                    String str6 = "ۛ۬ۚۥۛۘۜۤۡۧۚۧ۟ۛۗ۬ۛ۟ۤ۬ۗۛۚۗۤۧۙۨۦۘۨۜۦۘۙ۬ۡۘۥۘۦۘۙۦۖۘ۟ۛۤ۬۫ۘ۟ۡۗ۫ۨۛۗۡۨۘ۟ۜۥۡ۫۫ۨۤۛۦۘۛۥۨۘۙۜۡۖۤۛۧۖۘ۟ۗۜۘۙۨۙۙۘۖۢ۠ۧۧ۠ۙۘۖۥۧۤۡۘۦۨۙۚۨ۠۫ۧۦۜۡ۫ۢۤ۫ۡ۠۬";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ 485258848) {
                                                                            case -1246263397:
                                                                                str6 = "ۚۗۖۜۢۦۚۧۦ۫ۖۜۘۘۧۗۦۗۦ۬ۨۧ۟ۤۜۘۘۡۥۘۢۨۥۘۥۘۢۙ۟ۡۡۜۦۙۚۜۗۜ۬ۧۧ۟ۥۥۧ۟ۜۦۢۡۖۤۡۚۛ۫ۦۘ۟۟۬ۡۥۘۘۨۥ۟۬ۚۧ۫ۖۛ۫ۥۛۛۦۖۘۖۖۦۘ";
                                                                            case -352409046:
                                                                                str5 = "ۨۦۙۡ۠۬ۥۢ۠ۨۜۧۗۘۢۤۢۨۘ۟ۙۛ۠ۖۘۘ۟ۧۖۙ۟ۨۙۢۤۛۡۖۦۡۦۘۧۗۜۙۤۡۘۙۙۖۗ۫۫۬ۢۛۤۢۘ۠ۥۛ۟۫۬۟۬ۗۢ۫ۘۘۘ۟ۗۦۚۥۘۙۨۚۡۧۗۖۦۖۙ۬ۖۘۚ۫ۜۘۨۧۨۖۗۛ۬ۤۤۛۧۛۡۧۡۘۖۤۡ۠ۖ۠ۨۤۤ۟۟ۘۦ۫";
                                                                                break;
                                                                            case -179713826:
                                                                                str5 = "ۥۜ۟ۤ۫ۘ۫ۦۥۗۘۧ۬ۗ۠ۡۥۧۘۤ۠ۦۤۘۗۥۛۛ۫ۧۘۘۚۘۗ۠ۦ۠ۤۙۜۨۜ۠ۡ۫۟۫ۡۧۘۛۨۨۦۚ۬ۦۦۜۢۢۦۜۨۗۡۖۜۥ۟ۛۦۜۨۘۙۨۥۘۙۡۨۢ۠ۧۡ۬ۨۙ۫ۢۙۛۦۥۥۨۘۘۜۘۢ۬ۚ۟ۡۘۖ۬";
                                                                                break;
                                                                            case 649110408:
                                                                                str6 = button != null ? "ۘ۠ۨۘۡۨۗ۠۬ۢۦۚۤ۟۟ۖۘۧ۟ۘۘۥۚۢۜۢۘۥۡۙ۠ۛۨ۟ۡۨ۬۬ۢۧ۟ۜۙۥۧۙۥۘۧۗۘ۠ۗۧ۠ۡۗۦۧۘۜۚۖۙۡۨۘۢۚ۠ۖۘۤۢ۠ۦۘۥ۫ۨۘۜۧۤۦۡۖۨۘۥۗۦ۫۠ۨۚۜ۫ۖۡۧۘۡۦۖۘۖۗۦۘۥ۫۠" : "ۛ۫ۢ۟ۦ۫۟ۡۥۖۢۛۖۚۨۘۢۥۜۘ۠ۥۡۗۧۘۘۚۢ۫۫ۛۦۘۘۥۘ۠ۦ۟ۦۤۤۢۗ۠ۗۘۛۡۧ۫ۥۜ۠ۢۚۖۘۜۡۗ۬۠ۢ۟۬ۨۘ۫ۗۖ۫ۤۧۘۥۜۘۚ۫ۗ۟ۥۢ۠ۥۛۧۖۥۤۧۗۢۘۦۧۖۡۘۡ۬ۢۥۗۤۜۦۘ۠ۖۛۧۨۢۗۘۖۘۦ۬ۜۘۥۥۢۡۥ۟ۚۗۢۢۨ۬ۜۡۛۘۧۧۡۜۜ";
                                                                        }
                                                                    }
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 536774924:
                                str2 = "ۥۖۗۗۡۜۘۗۨۤۘۢۡ۬ۨۛۘ۬۬ۡۜۘ۟۠ۘۘ۬ۨ۠ۦۘۛۗ۬۬ۥۜۡۙۗۡۘۢۖۜۧۛۜۘۘۤۗۙۚۜۢۚۜۘۥۡۘۗۦۨۜۘۥۢۖۘۗۢۜۨ۟ۨۘۦۘۜۘۦۘۦ۟ۧ۫۬ۤۥۘۡۗۡۚۢۜۘۛۚۥۥۥۘ۫۟ۧ۫۫ۛۧۤۖۢۧۗۨۨۘۜ۫ۧۖ۫۫ۘۢۡۦۚۤۤۘۨۘۡۙۦۘۘۗۚۨۖۦ";
                            case 854358295:
                                str = "ۦ۬ۦۘۙ۫ۙۖۛۙۛۨۧۚۦ۠ۢۨۜۨۡۧۦ۟ۘۘۜۜ۠ۚۤۖۜۡۥۘ۠ۨۥۙۚۡۘ۫ۥۢۙۛۖۡۗۤۖۧۨۚ۬ۨۧۨۧۢۖۘۜۦ۬۬ۚۛۚ۬ۖ۠ۖۖۘ۠ۨۨۜۧ۫ۤۢۗۜۛ۬ۧۥۡۘۛۡ";
                                continue;
                        }
                    }
                    break;
                case -1194691237:
                    gradientDrawable = new GradientDrawable();
                    str = "ۢۥۤۖ۫ۚ۟ۛۘۢۡۥ۬ۤۨۙۚۘۧۘۧ۠ۡۘۥۙۡۥ۫ۛۥ۫ۥۛۡۥۘۗۥ۬۟ۡۥۦۢۦۘۤۜۛۖ۫ۢۗ۬ۖۦۧۡۦۤۗۖ۬ۜۦۜۨۘۢۡۘۨ۠ۚۡۜۖۛۡۧۘۗ۠ۢۤۛۡۤۥۙۢۚۥۘ";
                    break;
                case -1066797359:
                    String str7 = "ۗۡۚۛۤۖۙ۠۫ۖ۬ۚۨۖۛۢۢۜۘۨۘۗۢۘۘۛ۫ۚۥۛۧۗۘ۬ۤۨ۟ۙۨ۠ۤۛ۟ۗۙۡۚ۟۫ۙۚۦۘۙۨۢۥۙۗۘ۟ۢۗۡۙ۠ۙۨۘۤۗ۫۫ۥۘ";
                    while (true) {
                        switch (str7.hashCode() ^ (-586513681)) {
                            case -1218569002:
                                str7 = "ۜۤۗۢۢۡۡ۬ۖۘۖۡ۟ۜۡۘۘۥۗۙۤۙۡۛۘۛۜۧۖۘۚ۠ۘۘۥۜۡۘۡۤ۬ۨۘۧ۬ۢۛۨۖۘ۠ۦۗ۫ۡۤ۫ۚۨ۫ۢۦۛۤۢۜ۫ۡۘۢۤۤۖ۠ۚ۫ۛۗۖۘۤۨۖۘۖۛۧۦ۬ۡۘۙۗ۟ۙ۫ۦۙۜۜۘ۬ۗۤۗۢ۟۬ۘۖۥۤۖۚ۬ۥۨۦۘۗۧۨۘۘۙ۠ۥۘۚۗ۠۟ۚ۠ۢۜۨۥۘۨۤۗۘ۬ۢ";
                            case -703788521:
                                str = "۠ۗۖۤۨۗۡ۫۬ۘۨۥۘۤ۠ۦۘۖۘۛۢۜ۟ۤۛۥۨۨۢ۫ۡ۬ۜۦۘ۫ۤۘۧۚۘۦۜۧۘۡۛۥ۬ۛ۠ۗ۟۟ۦۘۨۥ۠ۘۚۖۧ۫ۡۘ۟ۚۧۖۢۨۡ۟ۥۘ۫۫ۗ";
                                continue;
                            case 360294838:
                                str = "ۛۘۘۘۥۛۜۘۢۢ۠ۨۜۖۘۖۧۡۘ۬ۛۦۚۜ۟ۢۦۤۤۖۥ۬ۨۘۘۨ۟ۖ۬ۥۘۜۚۜۘۖ۟ۤۚۦ۬ۖۖۧ۬۬۬ۗۚ۬ۧۦۛۜۥۘۚۡۨ۠ۡۨۘۜ۟ۥۘۛ۬۬ۚۙ۟ۚۗۤ۬۬۟ۘۖ۟ۚۛۛ۟ۙ۫";
                                continue;
                            case 873779149:
                                String str8 = "ۛ۟ۦۚۢ۬ۗۧۥۛۦۧۘۗۡۧۘۢۙۨۖۙۤۚۖۢ۟ۨۡۢۜۜ۫ۨۛ۠ۘۘ۠ۚۢۗۛۦۘ۬ۘۙۖۜۥۘۚۤۤ۫ۡۨۘۨ۫۫ۘۘ۠ۡۜۨۘۦۗۥۘۛۦۤ۬ۖۛ۬ۧ۫ۤ۟ۧۢۛۥۛۙۖۖۘۜ۬ۚ";
                                while (true) {
                                    switch (str8.hashCode() ^ 1084946209) {
                                        case -1058374574:
                                            str7 = "ۤۜۦ۫۫ۥ۬ۨۚۛ۟۫ۨۢۡۗۧۨۘ۫ۗۙۧۗۗ۠ۢۥۨۥۜۨۘۡۗۢۤۨۡ۟ۧ۠ۦۚۛۦۨۖۘۖ۠ۗۦۥۘ۟ۘۡۘۛۛ۟۬ۡۥۘ۫ۘۨۘۜۖۙۨۨۡۚۡۨۘۧۘۘۢۧۖۖ۫ۜۘ۬ۧۖۘۜۚۨۘۖۡۘۘۚۢۨۘۦۧۗۙۧۧۜۡۚ";
                                            break;
                                        case -416993472:
                                            String str9 = "ۡ۫ۨۗۖ۟۟ۥ۫ۧۜۙۧ۟ۨۘ۟ۨۘۛۥۖۖۗۥ۟۠ۦۘۙۦۨۘۦۦۜ۠۬ۖۘۥۗۙۘۗۖ۫ۥۘۘۨۘۗۜۜۘۦۘۥ۫ۙ۠ۢۦۧۘۚۛۥ۟ۚۤۛ۬ۨۤۜۢۜۘۗۡۦۚۤ۫ۚ۫۠ۧۤ۟ۖۘ۟۟ۗ";
                                            while (true) {
                                                switch (str9.hashCode() ^ (-710662436)) {
                                                    case -2018951987:
                                                        str8 = "ۡۖ۫ۦ۠ۥۢ۬ۦۤۢۘۘ۬ۨۘۛۘۥۢۨۘۡۥۡ۫ۥۧۥ۟ۘۘ۬ۛۘۘ۟ۦ۠ۜ۠ۦ۬ۚۖ۟ۧۡۖۡۖۢۜۤۜۗۦۘۗ۟۠ۦۥۦۨۗۤۜۜۘ۫ۙۘۘۧۙۧۜۧ۠ۡۦۘ۫ۤۡۜۙۖۘ۟ۗۘۗۨۖۖۨ۠ۛ۬ۨۙۦ۬ۡۚۜۜۖۥۘۢۗۢۨ۫۟ۥۡۡۘۦۜ۠ۧۙۙ";
                                                        break;
                                                    case -570279321:
                                                        str8 = "ۘ۬ۡ۫ۛ۠۬ۨۖ۫۠ۘ۟ۛۡۢۢ۠ۙۦۘ۬ۥۧۘۚۘۚ۫ۘ۟ۗۚۜ۫ۖۛۤۨۘ۠۟ۙ۬۟ۦۤۘۧۖ۬ۘۘۚۗ۠ۧ۟ۜۘ۠۫ۘۘۢ۫۬ۖۜۤۜ۟ۛۦۥۘۧۜۘۚۜۖۘۡۜۧۘۥۜۡۦۙۤۗۙۙۜۘۥ۠ۥۚۤۦۘۜۤۛ۠";
                                                        break;
                                                    case 1520957762:
                                                        String str10 = "۟۬ۧ۬ۜۜۘۙ۫ۨۢۜۜۨۖۡۧۥۧۢۘۧۜۙۥۜۦۙۖۚۡۖۦۘۡ۟ۨۛۚۧۚۢۤۦۥۧۚ۬ۢۧۢۤۦۨۡۡ۠ۜۧ۬ۜۘۚۡۧۦۙۡۙۜۖۘۙۡۨۤ۟ۙۚۨۘۘۘۤ۫ۛۛ۟ۦۙۨۧ۠۫ۡۢۘ۠ۨۚۜۗۦۗۘۗۚۡۗۥۙۧۨۘۤۘ۬۫ۥۧ۠ۤۗۜ۠ۘۘ۬ۡۖۥ۫۟ۗۨۜۘۢۨۢ";
                                                        while (true) {
                                                            switch (str10.hashCode() ^ (-1550586644)) {
                                                                case 1119958160:
                                                                    str9 = "ۨۡ۬۠ۦۢۘ۟ۜۜۨۥۘۥۤۨۘۙ۠ۖۘۜۚ۬ۥۤۜۘۛۘۦۗۖ۬ۜۗۜۧۦۗۖۘۜۙۙ۬۟۠ۜ۬۟ۡ۟ۥ۠ۡ۟ۙۛ۬ۥۘۖۘ۟ۛۦۗ۫۬ۖ۫ۡۧۘۙۦۤ";
                                                                    break;
                                                                case 1327349515:
                                                                    String str11 = "۬۟ۡۧ۠ۡۦۚۖ۫۟ۡۥۥۘۘۨۨۢ۫۫۬ۧ۟ۘۦۥۥۖۢ۫۠۫ۙۦۜۛۜۤۢۨۘۢۚۤ۫ۖ۟ۜ۬۟ۖۦۡ۟۟ۥۘۖ۫ۘۙ۫ۘۘۘۦۥ۟ۢۢۗ۠ۢۢۙۥۘۨۦۧ۫ۛ۫۫ۢۨۢ۫ۛۖۖۜ";
                                                                    while (true) {
                                                                        switch (str11.hashCode() ^ (-743653796)) {
                                                                            case 74368822:
                                                                                str11 = "ۦۦۘۨۨۤۙۛۥۘ۟ۗۢۜۨۙۦۜۘۡۗۖۘ۠ۚۚۗۢۗۢۛۧۛۧۤۤۨۡۧۡۛ۬ۗۤۜۨ۫ۨۗۧۦ۟ۖۘۤۡۖۘۨۙۖۘۥۙۜۙۘۨۤ۬ۦۘۤۙۨۘۢۗۖۘۚۢ۠";
                                                                            case 1173675905:
                                                                                str11 = alertDialog.getWindow() != null ? "ۥۙۚ۠۬ۗۦۨۛۤۙۖۘۘۖۡۢ۫ۨۘۜۥۦۘ۬ۜۖۘۚۙۤۡۚۘۤۗۖۘۘ۠۫ۦۧۗۧ۟۬ۧۨۘۧۗۖۧ۫۬ۢ۠ۥ۟ۙۜۘۦۘۥۧۨۜۨۨۧ۠۬ۜۢۙۛ۫۫ۦۧۦۘۥۚ۠ۡۖ۫ۗۦۗۖۘۢۖۦۘۗ۟۫ۨۘۢۦۨۖۘۧۧ" : "ۖۖۡۘ۠ۦۚۢۛۜۘ۟۟ۧۥۗۜۛۢ۬ۤۜۨۘۘۨۧۘۤ۟ۨۘۗۧۨۚۥۜ۫ۗۡ۬۬ۜۘۢۗۚۙۘۛ۠۫ۤۢۦۡۘ۠ۘ۠ۢۜۨۨۥۛۙۧ۟۟ۜۧۘۗۗۨۢۧۛ۟ۛۧۢۥۖۡۘۖ۬ۨۘ۟ۧۨۘۡۛ۫ۡۗۙۙۛ۫۟ۦۧۘۨۡۘۗۨۨ";
                                                                            case 1509924046:
                                                                                str10 = "ۤۡ۟ۥ۟ۗۘۚۨ۟۬ۧۚۘ۠ۜۜۚۧ۫ۗ۫ۜۙۛۗ۫ۚۙۙۨۧۘ۫ۚ۠ۛۚۘۧۘۢۙۤۙۚۤۥۘۨۤۘۘۖ۟ۙۘۢ۬ۧۤۢۖ۟ۥۜ۠ۖۧۘۥ۬۬ۡۜۘ۬ۦۗ۫ۚ۟۠ۢۙۖۤۦۜۨۚۛۖۘۛۙۦۘۚۤۥۥۖۦۘۚۗ۟ۚۦۘۥۘ۫ۛۗۥ۟ۢۚۖۖ۫";
                                                                                break;
                                                                            case 2041121648:
                                                                                str10 = "ۧۡۤۨۘ۠ۢۙۥۘۧۜۥۘۙۗۙۜۘۖ۫ۖۤۗۗۘۗۧ۠۫۫ۚۡۗۤۘۧۘۚۜۙۚۨۚۦۦۥۘۜۘۧۘۛۤۜۨۙۥ۠ۘ۫۟ۗۥ۟ۢ۬ۛۛۘۚۙ۠ۚۤۘۨ۠۬ۢۛۙۥۨۘ۠ۨۨ۠ۧ۬۫ۦۡۜۡۘۢۥ۫۠ۘۗۡۦۜۧ۬ۖۘۘۦۨ۫۟ۘۤۛۗۜۜۘ۠۬ۦۘۜ۫ۜۘ۠ۙۨۚۥۦۘۨۖۧۘۙۧۜ";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case 1926457261:
                                                                    str9 = "ۧۜۜۘۖۚ۬ۖ۠ۦۘ۠ۛۜۤۧۘۘ۬ۢ۬ۘۚ۬۟ۙ۫ۚۗۢۘ۟ۖۙۘۙۦۦۖ۟۫ۤۤۥۦۙۜ۫ۖۛۙۥ۟ۡۘۚ۬ۛۦ۬ۤۖۨۙۡۡۙۢۙۛۚۡۘۚۙۜۧ۟۠۫ۖۨۘۛۛۛۗ۟ۥ۟۠۫ۘۤۧۜ۟ۜۢۘۡۛۖۥۘۨۢۘۜۡۨ۠ۜۘۗۢۥۨ۫ۢۘۧۘۜۥۗۧۜۖۛۤۛۨۧۘۢۢۖۘۡ۟۫";
                                                                    break;
                                                                case 1983242100:
                                                                    str10 = "ۧۛۙۡۥ۬ۙۦ۟ۜۜۢۦۡ۬ۡۘ۠۠ۖۘ۬ۗۦ۟ۚۘۘ۟ۚ۬۬ۧۜۥ۟ۡ۟ۢۙۥ۟ۘۘۘۦۗۗ۟ۡۙ۟ۜۘۡۖۜۖ۠ۦ۫ۢۢۗ۠۟۠ۧ۟ۘۨۥۘۚۘۛۜ۬ۚۧۘۜۢۡ۬ۧۧۥۘ۫۬ۙۨۧ۬۠۟ۦۙۧۜۘۢۜۨ۟ۡۖۗۥ۬ۡۨ۠ۗ۠ۧۥۚۘۦ۠ۘۘۗۡۢۖۗۛ۫ۢۗۡۚۥ۫ۖۘ۫ۡۨۘ";
                                                            }
                                                        }
                                                        break;
                                                    case 2114885481:
                                                        str9 = "ۜۘۜ۬ۦۨۤۨ۬ۛ۬ۛ۟ۡۧۘۘ۟۟ۖۜۤۥۛۦۘۧ۫ۦۘۖۢۥۘ۠ۥۘۘۜۥ۟ۨۛ۬۬ۤۥۘۗۤۥۛۘ۫ۚۨۘۛۨۨۤۥ۠۠ۜۡۛۚۨۙۘۘۦۘۤۙۨۜ";
                                                }
                                            }
                                            break;
                                        case -215822125:
                                            str8 = "ۦ۫۟ۖۨۡۘۜۘۛۚۖۥۘۙ۬ۡ۟ۢۧۨۘۘۘۥۦۘۢۧۜۘۖ۫ۨۘۘۖۥۘ۟۬ۤۡۢۜ۫ۚۥۚۗۚ۠ۡ۟ۗۙۨۘۥ۠۠ۛۡ۬ۢ۠ۦۥۚۖۛۙۙ۫ۙ۬ۥۦ۫ۙۛۦۘۡۦۘۜۦ۟۠ۖۧۛۦۤۥ۫ۦۜۤۧۥ۟ۙۜۘۘۘۗۜۜۘۙۤۖۘ۬۫ۡۘۡ۫ۜ۫۫ۛ۠۬ۜۘۦۚۘ";
                                        case 1599664823:
                                            str7 = "۠۬ۖۦۘ۟ۥۘۥۘۥۘۥۘ۬ۘۨۘۡ۟ۛۤۖۜۘۚۢۨۥۤۙ۟ۖ۠ۨۘۧۘۥۛ۠ۥۦ۫ۦۘۖۨۦۙۚۨ۫ۨ۟ۥ۬ۚ۫۬ۡۡۘۖۨۢۤۙۥۘۜۧۗۤۘۜۘۡۤ۟ۜۘۜۖۡۡۘۖۖۖۚ۟ۖۘۜ۠ۛۨۘ۟۬۬ۨۘۗۗۚۚۘۨۤۨۛ۟ۛۘۘ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case -956852991:
                    button.setAllCaps(false);
                    str = "ۤ۫ۚۧ۟ۚۧۜۗۙۦۛۦۡۚۨۙۙۦۖۦۦۡۖ۟ۥۨۤ۟ۚۡۢ۠ۚۘۖۘۖۘۦۘۗۜۧۜۘۦۢۦۘۥۜۗۧ۟ۜۥۨ۠ۥۨۦۘۛۢ۫ۡ۟۠۬ۙ۫۠ۙۦۗۧ۬ۙۢۘۘۦۧۥۘۡۖۜۡۦۦۘۢۢۨ";
                    break;
                case -920712772:
                    textView.setTextColor(ViewCompat.MEASURED_STATE_MASK);
                    str = "ۖۗۘۛۦۥ۫ۜۨۘۡ۫ۗۖ۫۫ۖ۬ۗۡۖۛۤ۠ۡۙۦۘۚۧۨۘ۬ۤۥۢۤۙ۠ۧۘۤۚۧۤ۫ۡۛ۫ۚۗ۟ۢۙ۠ۦۘۧۛۘۘۚۦۥۥ۬ۖۘ۫۠ۦۘ۫۫ۥ۫ۖۦۦ۫۬ۛۤۥۘ۬ۛۤۦۛۖۥۦۧۗۤۨۘ۠ۙۚۜۥۖۘۤۘۧۘۙۙ۟ۥ۬ۦۘ";
                    break;
                case -692621103:
                    linearLayout.setOrientation(1);
                    str = "۫ۤۤۦۡۖۖۤۦۘ۫ۙۗ۬ۜۘۗۜۧۘۢۡۢۚۛۡۘۨۥۛ۬ۜۨۖ۫ۛ۫۠۬ۛۦۧۜۘۙ۬ۤ۟۠۫ۘۤ۬ۛۡ۫ۛ۠ۧ۟ۘۘۘۘۨۧۘۤۤۖۘۡۡۧۚ۠۬۟ۚۢ۬ۛۜۘۢۛۢۗۜۦۡۨۧۘۨ۟ۛ";
                    break;
                case -508104110:
                    alertDialog.getWindow().setLayout(i - i2, -2);
                    str = "ۛۘۘۘۥۛۜۘۢۢ۠ۨۜۖۘۖۧۡۘ۬ۛۦۚۜ۟ۢۦۤۤۖۥ۬ۨۘۘۨ۟ۖ۬ۥۘۜۚۜۘۖ۟ۤۚۦ۬ۖۖۧ۬۬۬ۗۚ۬ۧۦۛۜۥۘۚۡۨ۠ۡۨۘۜ۟ۥۘۛ۬۬ۚۙ۟ۚۗۤ۬۬۟ۘۖ۟ۚۛۛ۟ۙ۫";
                    break;
                case -336014171:
                    alertDialog.show();
                    str = "۠ۘۖۘ۫ۚۧۥۙۥۘ۫ۙۧۚۨۡۘۖۖۦۘۤۤۧۦ۟ۦۚۙ۠ۦۤۨ۫ۗۧ۬ۘۙۘۘۢۜۗۥ۫ۢۦۦ۬ۛۦۥۤۧۦ۟ۜۜۗۘ۫۠ۖۗۘۘۚۥۤ۬ۧۧۖۨۡۚۨۧۘ۟ۗۨ۠ۡۙۜۧۤ۬ۦۘۥۡ۟ۡۦۢۛۚۛۦۦۗۦ۫ۜ۠ۨۗۛۗۙۨۘۘ۟ۥۚۡ";
                    break;
                case -179604302:
                    linearLayout.addView(textView);
                    str = "ۡۚۧۤۤۙۨۘ۠۠ۨۧۡۜۚ۟ۙۗۥۥ۬ۖۧۜ۟ۛۚۢ۫ۗ۬ۗ۫ۜۙ۬ۡۨۚۜۨۗۨ۟ۖۘ۟ۜۜۘۡ۠ۙ۬ۦۡ۫ۨۘۜۧۜۘۦۦۥۜۗۖۜ۫ۙ۬ۢ۬ۚۦ۫ۤ۠ۘۘۖۦۜۘۤۥۧۘۗۤ۠ۗۢۥۘ";
                    break;
                case -151207877:
                    i = getResources().getDisplayMetrics().widthPixels;
                    str = "۫ۥۖۨۥۖ۟ۢ۠۠۠ۗۗۢۗۧۘۘۢۥۨۘۡۧ۬ۨ۬ۜۘۧۨ۬۠ۚ۟۟ۗۦۘۚۜۨۘۨۚۚۖۚ۠۟۬ۨۡۛۜۗۧۢۛۘۘ۟ۧۚۡۘۧۢ۫ۡۘ۠ۤۢۗۤۜۘۤۜۧۘ۬ۛۜۘۙۢۥۘ۟ۡۛ۬ۙ۬ۡ۫ۦۘ۬ۖۗۧۧ۫ۗۜۘۤۜۤۛۨۥۢ۟ۧۜ۫۫ۖۨۡۘۥۡۡۛ۠ۘۖۘۥ۬ۡۦۡۢ۫ۧۜ۫ۤۨ";
                    break;
                case -140890612:
                    alertDialog.getWindow().setBackgroundDrawable(gradientDrawable);
                    str = "ۦۨۦۘ۫ۗ۫ۥۗ۫ۨ۫ۛۗۛۘ۟ۚۢۛ۬ۢ۫ۧۖۘۢۥۧۥۧۖۘ۟ۛۨۘۧ۟۬ۗۖۡۘۖۨۚۘ۬ۖۘ۫۠ۘۢ۠ۖ۠ۛۤۨۘۘۘۧۡۘۘ۬ۖۘۥ۟ۦۤۗ۠ۘۨۘۘ۠ۘۧۢ۬ۢ۠ۤ۫ۜ۟ۨۘۛۨۧۥۙۛۤ۬ۚۥۚۨۚۢۗۡ۠۠ۗۨ";
                    break;
                case 266816294:
                    textView2.setTextColor(ViewCompat.MEASURED_STATE_MASK);
                    str = "ۤۨۤۧ۬ۤۨۢۨۘۤ۫ۤۡ۫ۙۡۦۨۗۢ۠ۚۦۧۖۖۜۨۛۥۚ۫۠ۡۦۥۙ۬ۙۤ۠ۥۢۜۧۦۤۢۥ۟ۘۤۡۢۚۚۧۤۛ۫ۨۨۘۜ۬۟ۦۡۖۘۨۢۢۖۥۗۧۧۜۘ۫ۛۢۘۤۘۜۦۜۘ۫ۘۘ";
                    break;
                case 334840601:
                    textView2.setText(getString(C0931R.string.str0051));
                    str = "ۧ۬ۧۨ۬ۤۧۧۖۥۤۖۢۚۨۨ۬ۗۙۥۘۢۢۙۙۨۘۘۧۦۡۘۦۤ۬ۨۥۦۘۨ۟ۜۥۜۖۘۧۙۤۧ۠ۢۛ۠۟ۧ۬ۡۡۜۦۘۗۢۦۘۚۜۢۜۢۢۜ۟ۦۘۜ۟ۜۗۡۜۜ۠۠ۜۚ۬ۙ۬ۨۧۦۥۛۛۖۘۤۡۘۘۡۡۜۛ۠ۚۖ۬ۥۘۚۤ۬ۙۡۘۛ۫ۥۘۙۦۧۙۗۢۢۨ۬ۗۤۥۘۘۙۡۜۚۖۡۚۘۤۦۚ";
                    break;
                case 673426933:
                    textView.setText(getString(C0931R.string.str0050));
                    str = "ۖۦ۫ۗۗۙۚۦۚۚۧۦۘ۟ۘۖ۟ۨۚۗۛۛ۟ۜۤۦۤۨ۫ۦ۠ۥۢۤۤۛۗۢ۬ۙۘۨۥۦۗۤۘۦۘۛ۠۫ۢۦ۬ۥۧۧۢ۫ۧۗۜ۬ۚۢ۟۟ۤ۫۫ۦۥۦۖ۬ۤۜۥۤۦۡۡۚۖۚ۬ۦۘ۫ۘ۟";
                    break;
                case 850341367:
                    return;
                case 888109896:
                    textView2.setTextSize(16.0f);
                    str = "۬ۨۗ۫ۘۛۜۨۜ۫ۨۨۘۛۢ۠ۤۗۦۘۧۗ۫ۗۗ۟ۚۚۖۘۡۦۨۘۡۘۙ۬ۜۘۢۙۛ۫۬ۗۥۖۖۗۙۡۘۡۘۥ۟ۥۘۜۤۖۘۥ۬ۖۘۢۙۡۜۦۨۙۡۡۘ۬ۘۢۢۡۚ";
                    break;
                case 1038686226:
                    textView.setTypeface(Typeface.DEFAULT_BOLD);
                    str = "ۜ۟ۖ۬ۖۨ۠ۧ۫ۗۥ۠ۖۙۘۘ۫ۘۖۙ۫ۨۘۘۥ۟ۚۨۦۘۘۡۡۘۧۤۜۤۘۙۥۘ۟ۜۧۨۥۛ۫ۘۘ۬ۡۦۘۖۥۛۤۨ۟ۧۦۜۘۛۘۨۘۢۘۛۥ۠ۜۘۘ۫ۥۘۧۡۨۚۧۘۘۧۘۡۖۜۧۙۡۘۤۚۗۙۜۖۘ۠ۛۖۡۛۥۖۖۙ۫ۘۧۘۗۚۧۥۡۦۘۡ۟ۘۤۖۗ۬۠ۙۢۚ۬ۗۗۥۖۘۘۜۚۦ۬";
                    break;
                case 1057009591:
                    textView = new TextView(this);
                    str = "ۜۗۢۢۜۛۖۨۧۤۨۘ۫ۜۡ۫ۙۦۘۢۨۧۘ۬۠ۜۡۨۡۖۤۤۗ۠ۦۘۙۤ۬ۨۖۜۘۛۖۧۢ۫ۦۧۛۜۘۙۡۖۥۗۨۘۦۡۛۡۘۖۘۘۘۘ۫ۛۜۘۙۤۖۘۗ۟ۚ۬ۜ۬۫۬ۘ۠۟ۖۛۛۘ۫ۥۚ۠۫ۡۥۚۙۧ۫ۡۡۜۤ۬ۧۘۦۡۘۦۥۤۖۚۨۜۤۨۙۖ";
                    break;
                case 1379862174:
                    str = "ۙۥۡۙۤۧۛ۠ۧۗ۠ۥۜۨۥۚۤ۠۫ۧۡ۠۟ۗۧۙۨۗ۬ۛۥۥۤۛۧۢۜۗ۟ۨۡۥۘۗۜۧۘ۠ۨ۟ۢۢۗۢۤۖۘۤۘۚۥ۟ۨۛۜ۫ۚۜۢۤۨۘۚ۟۬ۜ۠ۦۘۡۧۘۨۚۜۘۥۖۛۧۖۘۗ۠ۘۘۡۘۙ۬ۨۜۘۖۦ۫۠۫ۙۖۤۘۘ";
                    break;
                case 1400463703:
                    button = alertDialog.getButton(-1);
                    str = "ۤۘۗۜۛۧ۬ۡۧۜۗۖۘۗۨۡۗۨۧۜۜۦۧۙۦۘۛۘۜۘۤۗۡۘ۟ۛ۫۟ۨۦۡۘۖۗ۠ۘۘۨ۟ۦۘۛ۫ۜ۟ۖۖ۠ۙۨۘۢۙ۬ۖۖۚۨۦۢ۠۬ۘۨۜۘ۟ۧۦ۟ۨۜۘ";
                    break;
                case 1415537666:
                    gradientDrawable.setColor(-1);
                    str = "ۗ۫ۜۗۙۖۘۨۛۤۛۨ۟ۤ۬ۘ۟ۢ۫۫۟ۦۤ۬ۛۘۛۡۧۡۘۙۢ۫ۖ۟۫۬ۤۤۤۜۚۛۧۘ۠ۧۨۜۖ۬ۜۨۡۜۘ۠۠ۦۘۗۦۡۨۧۙ۠ۖۜۘۥۧۘۘۢۧ";
                    break;
                case 1471079544:
                    linearLayout.setBackgroundColor(-1);
                    str = "ۙۦۛۗۙ۬۫ۙۨۧۥۘۚۖۨۧۤۗۗۘ۟ۛۘۨۘ۬ۚ۫ۛ۠۬ۨۗۚ۠ۚۜۛۨۨۖۗۖۙۦۗۖۗۥۘۢۗۙۥۢ۬ۘۤۘۘۜۨۦۚۢۤ۠ۜۖۘۥۤۘۘۜۤۙۖۖ۠";
                    break;
                case 1710855649:
                    linearLayout = new LinearLayout(this);
                    str = "۬ۖۥۘۨۢۢ۬۬ۘۤۥۘ۫۫ۨ۬ۧ۫ۖۛۛۖۗۨۘۢۜۧۘۤۜۨۤۖ۫ۢۡۢۜۚۚۤۖ۬ۥۨۡۘۜۨۙۘۛۨۗۜۜۙۖۡۘ۟۟ۨۧۧۢۤۢۢۙۚۜۘ۫ۘۢ۬ۧ۫";
                    break;
            }
        }
    }

    private void startPermissionRequestFlow() {
        String str = "ۡۦۨۘۛ۟ۨۖۨۖۘ۫۠۫ۦۥۥۧۨۜۚ۬ۤۜۛۧ۠ۧۥۘۤۨۘۢۨۧۙ۬ۗۜۚۘۘۢۗۛۙۚۜۘۛ۬ۖۘۛۚۘۘۛۚۧۢۧۢۚۥۦۘۨۨ۠ۨۜۜۦۘۤ۫ۥۢ۬ۡۥۘۧ۟ۙ۬ۘۢۙۚ۫ۜۘۢۦۜۢۥ۟ۤۖۦۖۘۨۜۚۙۦۥۤۡۖۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 532) ^ 970) ^ 621) ^ 487) ^ 59) ^ 288) ^ 114) ^ 799) ^ 880) ^ 659) ^ 139) ^ 559) ^ 933) ^ 576) ^ 144) ^ 469) ^ 351) ^ 509) ^ 79) ^ 521) ^ 767) ^ 359) ^ 156) ^ 439) ^ 765) ^ 592) ^ 525) ^ 597) ^ 721) ^ 866) ^ 894) ^ (-1560687255)) {
                case -1660919580:
                case 670137651:
                    return;
                case -1371416896:
                    androidx.core.app.ActivityCompat.requestPermissions(this, new String[]{Deobfuscator$$app.getString(-3440719767620378441L), Deobfuscator$$app.getString(-3440719587231752009L)}, 100);
                    str = "ۙۨۧۘۧۡۖۘ۬ۥۚۤۢۙۛ۫ۙۗۤۥۘۗۢۦ۬۠ۜۤۨۨۡ۬ۦۘۡ۫ۚۥۖ۫ۨۙ۬ۘ۫۫ۨۘۘ۬۠ۛۙۜۜۤ۟۬۫۫ۡۦۥۥۘ۬۫ۖۜۘۧۥۘۗۨۜۘۚۡۦۚۛۜۘ۬ۘۛۚۡۨۡ۬ۖۧۛۦ۬ۨۥ۟ۖۖۘۙۖۜۧ۬ۧۤ۠ۥۘ";
                    continue;
                case 141302953:
                    String str2 = "ۧۙۘۤۤۡۘۛۖۨ۟ۙۨۘۧ۟ۧۦۖۙ۬۟۟ۦ۬ۢۨۧۦۘۨۙۙۡ۟۬ۘۡۛۗۗ۟ۚ۟ۨۘۜۡۖۘ۫ۤۡۚۗۘۙۦ۟ۚۘۘۥۦۧۘۦۨۛۙۧ۟ۡ۫ۗۛۚۖۖۘۘۖۥۚۧۥۧۘۧۥۘ۟ۧۖ۫ۘۡۨۤۚۧۜۦۘۧ۫ۜۘۜۥۘۘ۬ۦۘ۠ۜۥۡۡ۠ۗ۬۫ۗۛۢۦۙۨ";
                    while (true) {
                        switch (str2.hashCode() ^ (-270440277)) {
                            case -1765196951:
                                str2 = "۟۠ۢ۫۠ۤۘۤۜۘۗۦۖۗۗ۬ۛۡۖۘۦۦۨۘ۬ۘۗۧ۬ۦۘۥۥۗۤۖۜۘ۠ۚ۠ۢۦۡ۬۫ۖۘۙۙۘۙۖۙۥۤۥ۟ۙۦ۫ۜۘۧ۠ۤ۟ۗۥۘۗۗۗۦۖۗۨۥ۠ۛۖۘ۠۟ۥۘۡۘۥ۟ۤۛۡ۫ۨۘۘۦۚۢۨۤۤۧۜۘۗ۟ۦۘۧۨۦۚۧۜۘۨۛۦۙۛۘۘۨۙ۟ۥۛۚۤ۬۟";
                            case -1690396180:
                                break;
                            case -814382666:
                                String str3 = "ۘۦۨۘۖۛ۫ۧۘۡۘۧۢۖۘۢۚۘۛۦۤۚۚۥۘۙۡ۟ۦۡۢۡۥۨ۟ۡۤۥۢ۬ۦۘۘۦۚ۫ۜۘۖۘۨۛۢۗۡۘۨۡۘۧۥ۫۫ۛۗ۫۠۟۬ۘ۟ۢۗۜۘۧ۫ۨۤ۠ۥۘۚۛۜۤ۟ۚۘۥۘۧۢۧۧۜۧۘ۟۫ۚۛۖۥۢۨ۟۬ۧۥۘۘۤۖ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-107924404)) {
                                        case -1993286397:
                                            str2 = "ۗۛۖۘۤۙۨۘۚۘۨۘ۠۫۠ۧۘۥۘۛۦۤۙۘۜۢۚۦۘ۠ۦۗۤ۬ۘۘۗۘ۫ۘۥۘۘۦ۠ۢۧۧۗۤۖۘۡۨۙۢ۟ۚۨۛ۬ۢۢ۠ۘۧۥۗۢۜۧۢۛۖ۬ۨۘ۟ۘۥ۬ۚۢ۬ۚۖۤ۠ۗۘ۟۟۫ۢۚۨۥۘ";
                                            break;
                                        case -923285425:
                                            str3 = "ۤۚۡۘۖۡ۠ۢ۟ۥۖۘۜ۟ۥۧۘۗۗ۬ۖۘ۠۫ۜۨۘ۬ۜۘۥۚۤ۫۟ۚۨۦۛۡۡۢ۬ۢۤۦۤۦۘۤۜ۬ۘۤۡ۟ۗ۠ۦۢۡ۟ۥۜۘۜۦۥۘۦۗۜۘۡۛ۟ۚۙۨۘ۫ۛۗ۠ۙۛ۬ۢۥۘۘۗۥۘۗ۠ۥۘۗۡۗۚ۫ۢۨۥۜۘ۫ۤ۫ۧۚۗۦۘۘ";
                                        case 793760405:
                                            str2 = "۠ۨۢۖۚۡۘ۠۬ۙ۟ۙۦۦۚۢ۟ۜۨۚۦۧۡۜۗ۫ۚۥۘۦ۬ۨۜۚۛۤۡۡۘ۬۟ۛۨۘ۬ۥۛۤ۫ۧۗۙۙ۬ۧۗۜ۬ۢۥۢ۫۬۠ۦۘۗۦۜۤۦۨۦ۬۟ۘۧ۟۫ۘۘ۠۟ۚۗۙۥۧۢۜ۠ۡۘۡۜۧۘۜ۫ۘ۫ۚۖۘۚ۟ۧ۠ۢۘۨ۠ۘۘ۠ۘ۠ۛۥۦۘۜ۠۫ۗۛ";
                                            break;
                                        case 1345141356:
                                            String str4 = "ۤۙۛ۬۫ۘ۠ۥۢۚۘ۟ۧۖۢۖۛۖۚۦۥۨۘۦۘۦ۬ۗ۟۟ۛۗۧۘۖۘۧۘ۟ۦۦۘۢۤۘۘۧ۫۠ۢۘۥۘ۫۬ۗۛۛۡۘۢۧۡۜۘۡۤۢۘۘۙۘۜۘۦۥۚۨۚۧ۫۟۬۠ۗۘۘۚۢۦۦۧۖۘ۟ۘۖۘۘۘۡۥۤ۫ۘۥۘۖۨۧۘۢۡۗۗ۟ۥۡۛۘۢ۟ۥۘۖۙۦۚۦ۠ۥۨۢ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-1227252208)) {
                                                    case -1652949834:
                                                        str3 = "ۛۗۦۡۦۧۨۨۢۧۚۖۘ۟ۤۡ۟ۥۗۗۘۡۧۥ۠ۤ۬ۥۥۘۘۙۦۦۘۡۢۗۧۨۜۘۡۧۨۘ۠ۖ۬۫ۤ۫ۙ۠ۙ۠ۨۘۘۛۨۘۘۜۛۧۗۤ۠۬ۘ۠ۘۢۦۨۥ۫ۜۘۦۘ۫ۘ۟ۧۙۨۤۘۘۘ۫ۨۖۤۙۛۚ۫ۥۘۡۖۜۘۛ۟ۖۘ۟ۘۜۘ۫ۚ۠ۘ۠ۜۤۗۙۛۜ۫ۦۡۘۘۧۜۥ";
                                                        break;
                                                    case -998462770:
                                                        str3 = "۟ۙ۬ۡۨۡۦۤ۬ۦۜۢ۬ۡۥۘۥۨۜۘ۫۟ۥۖۗۨۨ۬ۚۘۦۙۥۥۡۜۢۛۘۤۥ۫۫۟ۨ۫ۘۥۘۧۢۨۘ۠ۥۘۘۡۛۜ۬ۖۧۘۨۙۜۘۤۨۧ۫۬ۜ۫ۤۖ۠ۡۚ۫ۡۡۘۗۘۘۘۥۡ۠۟ۚۚۢۡۜ۬ۜۦۥ۠ۚۘۤ۟ۥۡۨۘۢۡۢۖ۟ۛۦۚ۫۟۠۬ۢۘۘۛ۠۫ۨۚۥۘۗ۠ۧۜۛۨۘۥۡ";
                                                        break;
                                                    case 326493633:
                                                        String str5 = "ۦ۟ۥۘۛۘۘۤۦ۬ۛۧ۫ۙ۠ۡۘ۫۬ۦۘ۟ۖۤۥ۟ۧۧۢۨۘۧۦۚۥۤۚۛ۠ۥۘۘۜۨ۬ۤۖۘۖۚۖۘ۬۫ۡۛۚۥۜۘۗۙۨ۠۬ۛۥ۟۬ۜۥۘۘ۬۬ۖۘۚۦۧۘۧۘ۠ۥۛۨۤۥۛۚۛۡۘۦۥۜۘۙۢۘۘ۟ۦۘۜۧ۫ۚۧۜۗۛ۬ۨۢ۬۠ۖۢۡۙۖۘۨۢۡۢ۫۠۬ۙۨۘ۫۬۫ۧۨۜۘۥۧۘۗ۫ۙۡۦۡ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ 176446396) {
                                                                case -1810003271:
                                                                    str5 = "۠ۚۨۘۤۚۖۡۜ۫ۢۡ۟۠ۤۨۦۘ۟ۜۙۘۢۡۨۙۦۘۨۧۜ۫ۘۤۘ۬۬ۧۢۥۜۜۙ۟ۧۢۛۙ۟ۙ۠ۖۘۨۘۗۜۧۘۜۥۖۗ۬ۡۚۤۨۘۨۙۥۧۙ۬۠ۙۗۙۛۜۘۙۤۜۘۖۗۘۨۚ۠ۥۗۤ";
                                                                case 39123617:
                                                                    String str6 = "ۗ۟۫ۧۧۦۘ۬ۨۘ۫ۘۦۛۥۘۚ۠ۤ۠ۥۧۥۧ۬ۖۖۧۖۗۦۘ۫ۡۚۤ۠ۢۘۗۤۢۧۗۤۡۧ۬۠ۤۧۥۨۢ۟ۨ۫ۙۨۚۨۧۡۘ۫ۜۢۘۚۗۖۘۚۘ۟ۖۨۧۧۡۥۨ۠۟ۧۖۘۥۚۦ۫ۜۦۘۛۙ۫۠ۗۚۛۨۚۗۤۨۘۧۖۘۜۢۛۖۧۨ۟ۢۡۘۜۘۘۘۘۖۥۘ۬ۢۘۘۨۖ۟ۛۨۘۚۚ۟ۜۡ۟";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ (-1703798907)) {
                                                                            case -1481111539:
                                                                                str6 = "۟ۜۚ۫ۙۧۚۗۘۘ۟۬ۛ۟ۗۗۥۤۦۦۛۘۘۗ۬ۗۙۛ۬ۘۚۡۧۡۥۘۥۙۖۘۨۗ۫ۢۛۦۙۗۘۘ۠ۘ۬۬ۙۨ۠ۙ۟ۖ۠ۘۛ۠ۜۤۤۤۜ۬ۥۛۘۚۜۖۜ۬۟ۢ۠ۜۘۡۦۡۥۨ۠ۛۦۜۘۧ۟ۨۘۤۖۦۘ۬ۨۖ۫ۢۛۚۡۥۘۖۨۡۘ";
                                                                            case 260434949:
                                                                                str5 = "ۨۙۥۘ۟ۗۖۡۗۡۢ۬ۚۥ۬ۨۨۘۤۙ۠ۗ۟ۘۨۨۖۘۤۧ۫۟ۤ۬ۜ۫ۡۧۚۨۘۗ۟ۖ۬ۖۨ۬ۜۘۨۘۧۤۙ۫ۥۤۘۘۚ۫ۡ۫ۢۢۛۖۧۘۥۡ۠ۚۘۛ۟ۘۡۘۚۧۦۘۙۦۦۚ۟ۨ۬ۥۡۡ۬ۙ۬ۨ۫ۧۥۨۡۘۨۙۗۙ۠ۡۘۛۛۥۜۜۜۚۨۧ۫۠ۚۙۛۥۦۜۢۥۚۗۤۡۘۜ۠۟ۖۨۘ";
                                                                                break;
                                                                            case 1617564195:
                                                                                str6 = ContextCompat.checkSelfPermission(this, Deobfuscator$$app.getString(-3440719673131097929L)) != 0 ? "ۤۙۙ۟ۦۨۘۧۨ۫ۧۚ۠ۧۢۛۥ۠ۥۘۥۘۘ۬ۘۗۜۦۘۢ۠ۛ۟ۜۨۘۜۚۛۜۛۚۚۙۢ۟ۢۜ۠۟ۘ۬ۜۥۜۡ۟ۚۛۚۘ۠ۢ۬ۘۡۘۢۥۧۨۦ۬ۨۙۚ۟ۙۥ" : "ۙۨۤۤۙۢ۬ۗۜۘۜۤ۫۟ۨۦۘۘ۫ۦۥ۟۫ۨۡۡ۟۟ۘۧ۟ۡۘۛۥۙۛۢ۬۫ۙۡ۫۬۫ۦۛ۠ۤۨۢ۠ۖۤۙۤۖ۬ۥ۠۬۫ۦ۫ۛۧ۟ۜۧۥۡۘ۫۟ۨۘ۬۟ۨۚۢۥۛ۟۬ۤۥۘۖ۠ۦۘ۟ۘۘۘ";
                                                                            case 2017360240:
                                                                                str5 = "ۧ۟ۦۢ۫ۛ۟ۧۤۨ۫ۥۘۢۘۜۘۦ۫ۛۗۤۛ۠ۜۧ۫ۜۘۚۡۖۘۗ۠ۥۨۘۤۛۖۜۘۖۘۘۧۘۘۥۦۡۘۨۧۨۙۛ۫ۛۥۢۥۤۥۡ۫ۜۘۤ۠ۤۤۜۘۘۧۡۡۚۚ۠ۤۡ۠۟ۨۘۧۜۘۘۗۖ۠ۥۗۤۨ۟۬ۢۧۧۛ۫۬ۛۢۛ۫ۛۦۘ۠ۧۘۨۘۧۘ۠ۘۨۘۘۤۦۚ۬۠";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case 282952726:
                                                                    str4 = "ۛ۟ۨ۫ۖۚۧۙۛ۫ۜۘۘۛۥۗۘۡۗۙۥۨ۫ۥۘ۟ۘۡۘ۠۫ۚۗ۫ۡۘۜۖۙ۟ۥ۬ۚ۟ۜۥۢۚۨۗۨۘۛۦۙۘۢۥۧ۟ۜۘۖۥ۠ۙۙۜۘۥۘۙ۟ۛۥ۟۠۠۠ۡ۫ۛ۫ۦۢۙۖۘۨ۫ۜۘۨۖۚ۫ۤۡ۬۟ۜۘۖۨۜۡۥۥۡۡ۫ۢۙ۟ۘۘۦۘۚۖۥۘۘۙۛۚۦۛۡۦۘۤ۬ۙۨۦۥۘۢ۟ۨۦۙۘۘۗ۫ۜ";
                                                                    break;
                                                                case 745509808:
                                                                    str4 = "ۡۦۧۘۤۚۦ۟ۙۗۖۗۦۖۡۗۖ۠ۡۡۚۥ۬۠ۡۡۧۘۘۜ۠ۤۢۚۛ۫ۗۢۥۡۦۨۧۦۨۖۥۘ۟ۙۖۘۖۛ۠۠ۢۡۦۜۘۡۡۡۚۜۜۘۜ۟ۧۦۦۜۘۙۡ۠ۚ۬ۜۘ";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 1584221712:
                                                        str4 = "ۚ۠۠۫ۚ۫۠۬ۤ۠ۢۥۘۜۚۙۗ۟۬ۖۛۙۗۥۚۖۙۨۡۦۖۧۘۘ۬ۙۜۘ۠ۦۥ۬ۦۛۗۥۛ۠ۤۢۖۗۖۨ۟ۚۜۧۘ۫ۚۗۡۥۦۘۖۚ۬۫ۡۛ۠ۢۦۙۚ";
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 1467011169:
                                str = "۫ۜۦۜۘ۠ۨۥۜۘۛۙۦۘۤ۠ۦۘ۟ۡۘۖ۫ۗۧۨۖۘۦۧۜ۟ۧۘ۫ۢ۟ۦۤ۠ۗۛۗۜۡۚۚۚۖۘۨۘۡۛۙ۟ۜۗۜۘۤۦۘۗ۟ۘۘ۬ۦۚۥ۠ۛۗۥۘۘۥۡۡۡۚۧۜ۠ۦۘ۫ۧۜۘ۠۟ۨۘۢۦ۬ۥۚۧۘۦۦ۠ۡۘۙۚۧۧۡۘۚ۫ۥۘۢۘۚ۬ۚۛۙۘۦ۠ۛۙۖۗ۬";
                                continue;
                        }
                    }
                    break;
                case 393091457:
                    str = "ۢۧ۠ۚ۟۬ۤ۟ۙۧۘۥۛۧۨۙۦۜۘۗۧ۬ۖ۟ۘ۬ۖۥۘۢۧۨۜۚۨۥۗۥۧۘۨۘۦۗۜ۠ۖۖۘ۬ۥۦۘ۟ۡۨۘۨۥۨۘۧۨ۟۬ۘۘۢۜۡۜۚۖۛ۠ۗۦۘۢۜۥۘ۠ۨ۬ۢۡ۬ۙۡۥ۠ۜ۟ۧۥ۟ۦۦۘۙۤۧۧۥۦ۬ۗۜۘ۬ۖۖۧ۫ۨۘ۠ۖۡۘ۫ۜۛۙ۟ۜۨۗۚ۫ۛۙۖۥۥۨ۟ۛ۟ۛۦۘۥ۬ۖۘ";
                    continue;
                case 863815143:
                    String str7 = "۟ۨۡۘۛۛۛۤۘۨۘۤۨۛۜۢۖۘ۬ۨۛۘۗۜۛۤۦۘۜۦ۠ۢۥۙۦۙۘ۬ۢۥۘۜ۠ۥۘۙ۬ۧۤ۠ۗۗۙۜۛۨۥ۠ۜۖ۠ۤ۬ۛۗۜۘ۠ۜۧ۟ۛۨۙۖۡۘۛۨ۫ۘۙۖ۟ۥۤۥۦۖۤ۫ۜۦۢۜ۠ۜ۟ۤۛۚۛ۟ۖۧۢۡۚۥ۠ۗۖۚ";
                    while (true) {
                        switch (str7.hashCode() ^ 202357668) {
                            case -1746139422:
                                str = "ۗۢۦۘۙۡ۠ۜۗۨۘۢ۫ۛۛ۬ۢۚ۟ۖۖ۟ۡۘۗۧ۫ۛۗۙۡۛۗۜۜۡۘ۠ۨۤۧۙۨۘۢۛۧ۬ۤۥۚۖۚ۠ۨۦۘۖۡۥۘۨۖۘۧ۠ۡۘۘ۠ۦۦۥ۬ۥ۠۠ۢۛۖۘۨۛۚۗۨ۫ۧۜۘ۟ۨ۟ۚ۬۟ۜۜۥۤۡۧۚۚۡۘۜۥۘۤۦۧۢۙ۫۬ۧ۬ۧ۠ۖۘ۠ۚۢ۬ۡۖۙۢۦۘۚۢۘۘۗۗۖۘۖ۠ۛۗۘ۠ۜ۬ۥۘ";
                                continue;
                            case 360347704:
                                str7 = "ۤ۬ۜۘۖۚۖۙۡۦۘۚۡۦ۬ۢۦۘۙ۟ۜۡ۠ۛۖ۟ۙۖۤ۫ۧۡۡۛۖۨۘۢ۟ۚۜۡۤۨۤۘۨۥۥۘۛۨۙۗۗۗۧۙۥۙۨۗۡۥ۟ۢ۫ۥۘ۫ۘۘۛۥۧۘۨۜۥۥۗۧۨۛۧۘۧۡۘۨ۟ۜ۟ۧ۠۫ۦ۫ۗۛۡۘۡۧۜۖۨۗ۟ۤۙۦۘۡ۫ۜ۟۠۟ۜۥ۟ۘۘۧۛ۫ۜۥۘ";
                            case 1725254395:
                                String str8 = "ۧۧ۬۟ۦۥۘۚۥۗ۬ۢۖۛۜۖۦۛ۟ۚۚۖ۫۬۠ۨۙۛ۠ۚۤۢۥۖۤ۠ۘۘۙۚۦۘ۫ۡۡۜۤۨۘۧ۟ۜۧ۫ۦۘۚۢۤۦۥۢۛۜۥۦۚۧۧۜۗۜۥ۬ۘۘ۫۟ۜۘۜۗۗۘۢۨۘۧۨۘۘۜۢۘۤۥۤ";
                                while (true) {
                                    switch (str8.hashCode() ^ (-1959085795)) {
                                        case -1726985228:
                                            str7 = "ۛۗۚۨۥ۫ۡۦۛۢۥۘۗۨۡۘۖۤۚۛۨۧۘۥۜ۠ۘۗۦۛۛۘۘۡۥۙ۫ۜۡۘۤۤۡۘۜۤۧ۬۬ۘۘۚۡۖۘۥۦۜۘ۬ۗۙ۬ۖۜۘۥۗۘۘۤ۫ۥۘۘۚۗۨۙۗۖۛۘۘۙۦ۬ۡۗۤۘۘۦۘۧ۬ۛۨۙۧ۫ۧ۟";
                                            break;
                                        case 772991741:
                                            String str9 = "ۚۜۥۘۢۘۖۘ۬۬۬ۡۤۢۗۘۛۖۜ۠۠ۦۨ۫ۥ۟ۛ۫ۚۘۘۡۨۖۘ۬ۡۨۙۚۥۘۥۘۖ۬ۛۦ۬ۙۦۘ۠ۗ۠۫ۙۜۛۥۨ۟ۙۦۘ۬ۗۨۢۦۙۜۨۛۡ۠ۨۖ۫ۖۖۚ۟ۤۧۡ۬ۜۘۜ۬ۥۖۖۤۚ۬۠ۧۨۨۘۙۢۨۘ۬۫ۖۘۢۘۗ";
                                            while (true) {
                                                switch (str9.hashCode() ^ 791621845) {
                                                    case -2122422505:
                                                        str8 = "۟ۤۥۘۡۥۘۖۗۢۛۧۧۡۥۨۘ۠ۗۖۘۥۘۛ۟۠ۗۚۨۨۘ۬۟ۥۨۖۖۘ۫۬۠ۢۚۡ۬ۢۨۛۡۖۥ۠ۖۘۖۘۧۗۤۘۘۡ۠۬۟ۖۦۘۢ۬ۡۜۙ۟۠ۨۨۘۢۨۢۡۜۥۘۤۢ۫ۘۙۤ۫۟ۥۘۥ۬ۥۛ۬۠ۜۚۖۧۧۘۘۚۜۙۥۡۜۘ۠ۙۘۘ";
                                                        break;
                                                    case -1376854403:
                                                        String str10 = "ۜۤۡۘۧۗ۠ۚۧۜۘۢۧۦۘۧۢۗۧۡ۠ۨۢۡۨ۬۠ۛۨۘۘۥۧۧۦ۟ۗۜۜۡ۟ۚ۠ۖۖۚۡۙۜۘ۫ۜۚ۠ۘۗ۫۠ۨۧۚۖۖۤ۟ۙۡۥۘۖ۟ۦ۠ۙۙۘۦۚۚۛۛۙ۬۫ۜۨۖۥۗۨۗ۫۫ۤۘ۟ۙ۫ۖۡۘۤۗۨۚۤۨۨۥۖۗ";
                                                        while (true) {
                                                            switch (str10.hashCode() ^ 1676805972) {
                                                                case -1797466625:
                                                                    str9 = "ۙۗۥۘ۠ۢۗۡۨۧۘۜۚ۟ۜۗ۫۬ۖۘۜۡ۟ۦۥۥۘ۟ۥۘۖ۠ۧۤ۟ۚ۬ۦۨۘ۫ۡۢۚ۫ۖۚۢۗۧۚۨۦۖۦۘۡ۫ۗ۬ۖۗۢۥۡ۠ۙۨۘۖۡۥۘۦۧۤۡۨۧۥۦۡ۬ۘۢۖ۟ۡۘۡۡۜۜ۟ۨۘ۠۠ۥۜۙۖۘۖۤۘۙۘۘۚۥۡۘۘۖۥ";
                                                                    break;
                                                                case -605215861:
                                                                    str9 = "ۖۗۨۘۦۡۧۘۦۥۘۙۤۚۡۧ۫۬ۨۖۘۛۚۢۘۛۘۘۨ۠ۙۧۤۜۘۚ۟ۢۡۥۘۛۗ۫۬ۡۚ۟ۛۖۘۚ۠ۘۖۖۢۛ۟ۖ۠ۜۘۚۚۚۖ۬۟ۖۡۖۘۡۖۜۗ۫۬ۤ۠ۥۢۚۚۨۘۙ۟ۥۥۥۗۘۥۦ";
                                                                    break;
                                                                case 157847417:
                                                                    String str11 = "۠ۥۧۘۦۤۖۘۥۦۙۗۘۧۦۙۜۗۜۗۗ۠ۘۘۙۨۤۖۨۡۘۙۡ۬۟ۖۘۦ۠ۖۘ۫۬ۙۚۧۧۜۢۥۘۛ۟ۖۙۧ۟ۦۤۧ۬ۜۧۘۚۖۚ۬ۢۧۢۜۡۘ۠ۖۜۘۤ۬ۖۘۗ۠ۦۧۡۨۖۢۥۘ۟ۙۧ۬ۚ۠ۤۥۘۨ۟ۥۗ۫ۜۘۙۖۢۢ۠ۗۙۥ۟ۖۥۙ۫ۨ۟ۡۤۖۚۘ۬ۡۘۧۤ۫ۦۗ۟ۡۨ۠ۙۗۘۘ۠ۗۧ";
                                                                    while (true) {
                                                                        switch (str11.hashCode() ^ (-6793693)) {
                                                                            case -1070295494:
                                                                                str11 = "ۧۙۢۥۧۥۚۗ۬۟ۥۜۘۜۛۡۘۨ۠۬ۘ۬۠۬ۨۚۨۡۧۘۤ۠ۤۙۤۤۡۚۘۘۚ۬ۡۘ۠ۤۘۤۧۦۘۘۤۥۘۥۡۡ۟۫ۜ۬ۛۜۘۤۦۜۖ۠ۦۘۘۛۢۥۡۜۘۖ۫ۗۙ۟ۘۘۛۦۧۙۛۦۢ۫ۙۗۡۘۗ۫ۚۦۥۙۦۧۦۙۤ۬۠ۘ۫ۖ۫ۧ";
                                                                            case 77525006:
                                                                                str10 = "ۛۢۨ۟ۡ۫ۖۥۢۗۢۥۘۚۤۗۨۘۤۢ۠ۢۛ۬۬۠ۗ۫ۙۗۛۜۚۧۛۛ۬ۡۙۖۘۤ۠ۨۘ۠۫ۧۡۦۜۤۦۧ۬ۙۘۘۡۗ۟ۧۡۛۧۢۨۥۘۖۚ۠ۤۘۡۙ۫ۘۥ۠۬ۘۖ۫ۧۜۗۖۘۥۥ";
                                                                                break;
                                                                            case 350109716:
                                                                                str11 = Build.VERSION.SDK_INT < 30 ? "ۛۧۥۘۜۗ۫ۘۥۦۨۥۦۢۙۨۘۖۧۥۘۥۤۖۢۜۡۘۛۜ۠ۙۘۧۘ۬۟ۦۘۢۘۗۤ۫۬ۜ۠ۥۘ۟ۚ۬۬ۦۚۘۧۜۘ۟۟ۜۚۚۗۤۘۡۥۙ۟ۚۥۢۥۧۘۜ۠ۛۘۘۦۘۥۙۡۜۘۧ۫ۛۘۘۜۘۛۖۨۘ" : "ۧۖۚۙۥۧۘۘۜۦۘۥ۬۫ۨ۫۫ۢ۫ۙۦ۟ۛ۟ۛۘۘ۟ۜۜۡۖۧۘۗۛۧۖ۬ۡۤۧۢۢۘۗۛۜۛۥ۟ۚۤۧۦ۠ۖۛۚ۫ۡۥ۠ۛۦۘۧۘۡۦ۬ۘۘۤۡۤۡۤۢۗۤۘۘۧۙۖ۫ۛ۟ۧۥ۫ۘۚ۫ۗ۫ۧۦۥۦۘۥۢۦۘ۫ۡ۟۠ۧ۫ۙۤۨۨۨۜۥۛۖۘۡ۬ۜ۟۟ۙ";
                                                                            case 1573206551:
                                                                                str10 = "۬ۤۦۘۖۚۢۜ۫ۘۤۜ۬ۤۢۖ۠ۨۖۘۧۥۥۦ۟ۙۦۛۖ۫ۘ۫ۧۡۙۡ۠ۡۗۙۖ۟ۖ۠ۖۡۗۙۤ۠ۛۚۗ۟ۧ۠۟ۖۜۤۚۡۥۦۘۜۢۨ۠۠ۜۘۘۜۜۤۛۨۘۦۜۚۢۗۘۘۨۜۡۘۤۢۦ۬۬ۥۘۗۧ۠۬ۖۙۦۗۙۗ۟ۢۙۜۢ";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case 832090825:
                                                                    str10 = "ۘ۬ۘۘۥ۫ۦۘۢۧۙ۬ۛۨۧۦ۬ۜۡۘۖۖۙ۬ۛۜۘۨۚۗ۠ۛۖۘۖ۟ۛۡۗ۟ۖ۫۟ۥۦ۠۟ۢۛ۫ۖۥۤۢۧ۟۠ۙۙ۠۬ۙۡۦ۠۫ۚۥۙۢۛۖۦۘۡۚۖۢۥۥۘۛۚۡۘۛۖۙۡۛۚۙۦۦۛۗ۟۫۠ۡۘۢۧۜۘۜ۫۬ۘۘۖۛۧۛ";
                                                            }
                                                        }
                                                        break;
                                                    case 621213578:
                                                        str9 = "ۤۙۘۘۚۜۜۘۜۥۘۛۡ۟ۜۘ۠۠۫ۦۘ۫ۗ۟ۗۚۧۙ۫ۜۘۦۖۡۘۙ۫۟ۜ۟ۙۥۨۘۛۧۥۘۢ۫ۚ۠ۢۦۘ۬ۦۦۘۨۧۥۘ۬۟ۥۥۜۧۧۛۦ۬ۦۡۦ۟۠ۙۙۦۘۚۤۗ";
                                                    case 1328726108:
                                                        str8 = "ۤۗۦۦۧۗ۬ۘۘۦ۫ۘۨ۫ۧۚۜ۟۟ۘۚۧ۠ۤ۬ۖ۠ۡۨۧۥۙۤۛۜۢ۬ۨ۠ۚۙۗۗۧ۟۬۠ۥۘۦ۠ۤۥۡۘۙۘۗۙۦۦۘۧ۟ۥۨ۟ۙ۬۬۫ۥۗۧۢۘۖۘۖۨ۫۟ۥۡۢۨۘ۬۠۟ۛ۬ۗ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1245933890:
                                            str7 = "ۧۖۦۗ۬ۘ۟ۡۨ۠ۚۜۘۨۛۤۦۤۢۥ۟ۦۘۗۙۥۘۜ۬ۤ۬ۗۖۨۦۡۢۧۖۘۗۜۦۘۤۥۨۘۗۗۢۡۜ۫ۖۧۥۘۜۘۧۘۙۢۦۚۚۥۗۗۘۘۙۚۤ۟۟ۘۜۛۙ۠ۢۥ";
                                            break;
                                        case 1874285876:
                                            str8 = "ۡۛ۠ۛۜۛ۠۠۟ۘۗۖۜۙۧۛۙۛۖۜ۬ۨۙ۟ۙۘۜۘۧۜۜ۬۬ۦۖۙۤۦۛ۠ۜ۬ۜۘ۬ۦۛۗۨۛ۫۠ۖۘۘۚۗۘۨۛۢۡ۫ۗ۠۫ۡۤۨۜۘۘۘ۟ۛۦۛۧۧۢۨ۟ۨۜ۫ۥۥۨۥۨۨۘۛۙۥۘ";
                                    }
                                }
                                break;
                            case 1807826858:
                                break;
                        }
                    }
                    break;
                case 1609600297:
                    requestNextSpecialPermission();
                    str = "ۖۧۚۥۛۥ۟ۤۦۘۖ۠ۘۢ۟۟۟۬ۢۜ۟ۚۗۘۖۨۗۤۛۧۡۥۙۥۡ۟ۡۘۙۘۛۢۧۘۘۧۙۦۘۗ۠ۢۦۥۧۘۡۛۙۦۦۘۘۙ۬ۚۚ۠ۘ۬۟ۡۘ۫ۘۨۗۧۛۜۦۗۡۦ۬ۖۧۘ۬ۛۡۘۡۡۡۙۖۘۛۤۘۘۧۨ۬ۨۚۡۘۥۜ۠ۢۛۡۘۛۥۘ۟ۦۜۖ۬ۚۥۤۘۘۢۤۛ۫ۢ۫ۧۡ۟ۤۦۡۘۘۙۜۧۧۥ";
                    continue;
            }
            str = "ۘ۫۟۬۬۬ۗۘۖۘۜۛۖۥۨۦۨۘۚۦۗ۟ۘۜۖۤ۫ۜۘۥ۠ۥۘ۫ۘۤۘ۠ۜۧۗۡۚۡۚ۬ۚۨۡۥ۬۟ۧۜۜۙۛۗۨۧۖۥۜۘۡ۠ۡۘۧۗۛۧۘۜۘۡۘۦۖۙ";
        }
    }

    /* JADX INFO: Access modifiers changed from: protected */
    @Override // androidx.appcompat.app.AppCompatActivity, android.app.Activity, android.view.ContextThemeWrapper, android.content.ContextWrapper
    public void attachBaseContext(Context context) {
        String str = "ۘۚۛ۬ۦۦۜۥۗۤۖۘ۫ۙۘۘۖۧۧۚۤۘۨۘ۠ۧ۟ۜۨ۠۫ۙۢۜۘ۫ۖۘ۬۫ۨ۬۟ۘۗۖۘۨۥۗ۬ۖۜۧۧۜۘۛۘۖۢۡۘ۫ۗۧۨۙۨۤۙۡۘۜۧۜ۬ۥۥۥۗۛۦ۠ۦۘ۬ۧ۬ۧۨۖۘۖۙۖۘ۬ۦۗۘۚۘۘۘۢۤ۬ۨۦۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 504) ^ 238) ^ 485) ^ 236) ^ 78) ^ 123) ^ 490) ^ 959) ^ 203) ^ 232) ^ 869) ^ 415) ^ 239) ^ 1023) ^ 568) ^ 990) ^ 833) ^ 585) ^ 140) ^ 738) ^ 54) ^ 153) ^ 85) ^ 832) ^ 107) ^ 410) ^ 23) ^ 697) ^ 901) ^ 589) ^ 636) ^ 2071495406) {
                case -1024165080:
                    str = "ۧۨۥۘۡ۟ۤ۟ۧۢ۫ۦۙۨۡۢۚ۟ۘۢۥ۬ۦۡۗۡ۫ۡۖۘۘۘۡۙ۟ۘۘۛ۠ۦ۬۫ۗۢۥۖۘۗۜۘۡۡۙۥ۟ۖۘۖ۠ۜۘۦۦۚ۟ۨۧۘۖۡۦ۬ۚۨۡۡۘۛۜۖۛۗۤۧ۬ۜۘ۠ۚۜۘۡۥۡۦ۬ۡۘۘ۬ۡۘۨۧ۟ۘۦۗ۫ۧۦ۫ۥۖۚۨ۬ۛۨۥۘۦۗۜۙۖۜۘۘۗۖۘ";
                    break;
                case -906543918:
                    return;
                case -100036006:
                    super.attachBaseContext(context);
                    str = "ۚۛۨۡ۠ۤۥ۬ۥۚۢۥۘ۫ۘۖۘۦۢۚ۫ۦۡ۟ۧۢۚ۠ۦۘۘ۫ۖۚۙۗۧۘ۠ۨۡۥۘۨۢ۟ۖۗۥۘ۠ۛۦۗۨۜ۟ۥۨۘۢۤۖۢۛۥ۫۬۫ۦ۠ۤۛۜۥۘۧ۟ۙۙۢۦۘۢۖۜۘۘۨۦ۟۬ۥ۟ۛۜ۬ۥۛ";
                    break;
                case 1373653614:
                    str = "ۛۡۦۙۥۗۘ۬ۚۜۛۥۦۚۘۘۜۚۤۥۡ۬ۨۖۡۗ۠ۚۗۥۛۘۘ۠۠ۧۨۢۧۦۘۡ۬ۡۘۚۦۜ۟ۙۢۤۧ۟۠ۤۚۙۗۘۡۦۦۘۥۤۘ۠ۨ۠ۨۤۖۘۢۥۡۜۡۡۤۧۖۤۢۖۤۨ۫۟ۗۖ۟ۖ۬ۖۡۘۘۚۨۦۘۛۤۖۛۘۧۘۧۖۜۧۘۛۤ۫۬۟ۛۡۘۖۦۙۖۘ";
                    break;
            }
        }
    }

    public void initiatePermissionCheck() {
        String str = "۬ۙ۫ۖۧۙۨۜۤۙۜۜۢ۬ۡۨۖۛ۬۟ۦ۟ۜ۫ۚۜۦۛۧۙۤۡۚۜۘۙۛۦۜۗۦۨۛۚۢ۟ۘۜۘۨۧۥۙۨۘۘۦۢۢۜ۬ۘۘۙ۬ۗ۟ۘۜۗ۟۫ۧۚۖۘۥۚۡۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 55) ^ 118) ^ 127) ^ 632) ^ 196) ^ 282) ^ 720) ^ 455) ^ 945) ^ 518) ^ 781) ^ 120) ^ 572) ^ 854) ^ 924) ^ 703) ^ 325) ^ 874) ^ 389) ^ 713) ^ 470) ^ 315) ^ 169) ^ 374) ^ 449) ^ 305) ^ 415) ^ 557) ^ 522) ^ 168) ^ 939) ^ 1970190688) {
                case -327168865:
                    str = "ۥۨ۟۠ۛۡ۟ۖۙۦۛۨۘۢۖۥۘ۫ۜۡۘۛۤۛ۟۠ۙۜۥۘۚ۟ۗۙۚۨۘ۬ۤ۬ۦۡۛۢۦۘۘ۠ۛۧۘۙۙۡ۫ۘۘۨۚۥۙۜۘۘۛۜۨۘۚۤۨۘ۟ۘۥۘ۠ۙۜۤۥ۫ۖۘ";
                    break;
                case 1060575156:
                    String str2 = "ۙۤۦۦۤۜۘ۫ۨۦۥۘۚۜۖ۫ۧۡۙۚۘۨۗۤۖۘۨۛۨۙۤۢۘۘۘۦۖۗۨۗۢۦ۟۠ۨ۠ۛۦۙۙۘۦۨۘۡۙ۠۠ۖۡۢۧۗۨ۫ۚۤۙ۟ۙۤۙۢۧۖۘۙۚ۫";
                    while (true) {
                        switch (str2.hashCode() ^ 77200699) {
                            case -1998834822:
                                str = "ۗۢۖۤ۠ۥۘۚۦۦۧۙۙۖۢۚۛ۠ۙۖۗۥۘۙۧ۫ۚ۫ۡۙۘۨۘۤ۠۟ۚۦۥۘۘۢۥۤۗۡۘۧۧۛۤ۟ۗۢۙۤۡۛۥۨ۫ۨ۠ۘۘۚۙ۟۬ۘۖۘۦۤۗۧۛۨۘۤۚ۟۟ۤ۬ۖۨ۫ۥۧ۟ۚۛۥۘۜۢ۠ۧۨۚۧۚۛۧۜۘۗۤۥۘۘۢۡۙۨۧۧۥۗۙ۬ۛۥۖۘۗۗۛۤۢۜۘۡ۫ۨۘۤ۟ۡۥۥۧۘۘۡۨ";
                                continue;
                            case -862362046:
                                String str3 = "ۖۨۤۡۨۜۘۦۜ۫ۚۡۖۘۗۘۨۘ۟۫ۢ۬ۡۘۨۨ۟ۤۜۤۛۛۜۢۦۗۡۖۜۛۥ۠۠ۦۜۗۛۖۙۥۖۗۧۚۛۡۜۘۦۘۖۘۢۗۦ۫۬ۨۘۨۡۗۛۘۤۖۨۦۘ۬ۘۖ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-1170146335)) {
                                        case -406467898:
                                            String str4 = "ۜۥۦۛۧ۠ۚۙ۬۟ۨۧۙۗۨۨۨۡ۟ۡ۠ۙۘۡ۠ۛۖۘ۠ۜۙ۫ۥ۠ۤ۟ۥۘۛۢۙۦۤ۬ۦۦ۬ۧ۠ۡۤۢۦۘۘۖۤ۟ۨۖۘ۫۬ۡۢۗۜۘۙۤۨۘۜۖۨۘۧۡۘۡۗۧ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 1988238523) {
                                                    case -795892474:
                                                        str3 = "ۥۚۡۘ۠۟۟۟ۜۚۧۡۨۥ۬ۗۚۜۡۦۛۦۘۡۡ۫۟ۙۗ۟ۚۖۚۛۖۧ۟ۢ۬۫ۜۚۡ۟ۦۛۛ۟ۡۘ۫ۙ۫ۙ۬ۛ۟ۘۘۘۘۤۖۘۨۗۡۘۥ۬ۖۘۤۖۘ۠ۚۦۘۜۛۢۧ۬ۖۤۤۗۦ۫ۘۧۡۧۘۙ";
                                                        break;
                                                    case -155899868:
                                                        str3 = "ۚ۬ۦۘۘۨۘۘۡۢ۟ۚۦۙۚۤۙۤ۟ۦۘۧۥۨ۠۫ۤۢۗۧۚۢۥۤۖۘۧ۟ۤۢۗۖۚۤۨۜۨۡۘۢۛۦۘ۠ۖۧۘۗۥۧۘۚۧ۠ۗۗۗ۟ۖۦۘۡۤۧۘۥ۫۫ۥۘۖۧۗ";
                                                        break;
                                                    case 698567645:
                                                        str4 = "۠ۢۘۘۜۖۘۘۛۛ۠ۨۧۦۘۢۜ۫ۢۖۡۨۙۚۤۛۡۗ۠۠۟ۧۘ۠ۡۢۧۤۚ۠ۨ۠۟ۤۥۖۘۧۢ۠ۧۖۜۥۨۦۘ۠ۜ۠ۛۚۙۤۘۢۚۗۚۧ۬۫ۙۛ۫ۘۙ۠ۢۦۘۦۖۧۘۡۘۦۜۘۘ۫ۖۨۘۨۙۜۜۜ۫ۥۦ۫ۧۡۘۘ۫ۧۥۘ";
                                                    case 1847501740:
                                                        String str5 = "۬ۚۥۗۡۗۗۖۖۦۖۜۥۖۨۘ۫ۨۖۡۜۨۘۥۜۨۘۡۛۖۘۨ۟ۜۘۛۖۘۘ۠ۤۢ۠ۜۙۨ۟ۜۘۢ۟ۧ۠۫ۛ۫ۘۤۦۧۘۥۚۡۘۦۘۥۢۡۥۘ۠ۛۧۚ۠۟۠ۛۧ۟۬۬ۥ۫۟ۚۤۡۘۙۢۗۘۤۘۤ۫ۗۖۖۖۘ۠ۧۚۗۖۖۙۖۘۤۚۜۘ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ 2094321573) {
                                                                case -2096977230:
                                                                    String str6 = "ۖۤ۟۫ۙۘۧۨۧۢۦۘۘۢ۠۫ۗۢۦۙۨۖۘ۬۟ۨۦۤۜۙۗۦۘۤۗۢۖۡۘۢۚۘۘۗۨۦۘۙۡۚۙ۟ۖۗۧۗۨ۠ۙ۬ۧۨۘۤۖۦۤۖۢۧۥۛۛۨۜۨۖۡۡۜۖ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ 1349469756) {
                                                                            case 251450085:
                                                                                str5 = "ۙ۟۠ۦۘۡ۟ۛۡۘۢ۟ۜۘۡ۬۟۬ۨۥۘ۬ۨۜۧۛۜۘۧۘۛۢۘۤۢۦ۠ۢۡۖۥ۠۠ۨۨۦۜۡ۬ۛۙ۟ۨۘۚۛ۟۫ۦۧۘۦ۬ۡۘۘۥۗ۠۬ۦۦۧۘۘۢۥۡۘۖۛۨۘۜۨۜۦۖ۫ۜۦۜۥۖۘۢ";
                                                                                break;
                                                                            case 889070343:
                                                                                str6 = "ۤۛۛۢۤۘۘۡۧ۬ۜ۟ۥۨۛۙۗۘۦۘۢۜۖۛۡۜۘۗۜۨ۠ۡۧۘۖۗۡۢ۬۬ۙۙۛۧۙۡۘۥۤۨۨۥ۠ۙۡ۬ۦۢۘۗ۬۟ۧ۠۫ۛۧ۬ۤۛۢ۠ۘۢۤۢۢ۫ۙۗ۫ۡۤۦ۠ۦۨۨۥ۠ۖۘۚۖۚۖۨۨۧ۬ۖ۬ۦ۟۠ۤۨۘۧ۟۫ۢ۟ۨۚۥۘۜۖۦۘۜۚۤ۫ۖۨۘۛ۬ۗ۫ۡۘۘ۬ۤ۟ۦ۟ۨۘ۫ۗۦ";
                                                                            case 1083555719:
                                                                                str6 = !areAllPermissionsGranted() ? "ۚ۟ۗ۬۟ۥۤۚۗۧۚۜ۠ۗۛۖۗۧۜۡۦۘۤۘ۫ۢۡ۬ۗۧۘ۬۫ۗۜۜۥ۫ۗۨۚۘۡۘۙۡۙۙۖۧۖۨۢۙۨ۟۫ۨۨۢۧۤ۠ۛۘۘۙۨۖۨۨۘۘۚۖۖۘۢۜۡۘ" : "ۛۨ۟ۧۥۡۗۥ۟ۦۘۥۗ۟ۧۡۖۘۤ۬ۙۧ۟۟ۡۖۨۘ۫ۘ۟۟ۦۚۚ۠۫ۖۜۘۘۢۢۙ۟۠ۚ۬۬ۜ۟۟ۘۦ۫ۥۥۘۗۢ۠ۚۢۗۚۙۚۨۛۧۖۜۧۘۗ۬ۥ۫ۗ۫ۡۘۡ۠ۦۡۖ۫ۘۜۧۡۨۢۢۘۘۗۥۚۤ۫ۖۘۧۡۜ";
                                                                            case 1483930953:
                                                                                str5 = "ۘۜ۬ۨ۬ۨۘۙ۫۬ۢۦۛ۟ۛۘۧۧۚۖۧۤ۟ۛۜۘۘۘۘ۫ۖۘۘۜۤۦۘۨۥۖۖۧۤۤۨۖۦ۬ۨۘۧ۟ۗۛۨۧۘۥۛۡۘۛۙۥۚ۟ۦۘۤ۟ۥۘۘۖ۫ۚ۫ۦۘ۠ۦۥۙۡۜ۫ۖۥۘ۫ۙۧۢۖۤۖۧۛۦ۬";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case -1647825536:
                                                                    str4 = "ۜ۟ۙۦۦۘ۟۠ۘۘۗۢ۬ۡۗۡۛۤۧۨۧۙۙۗۢ۟ۧۡۗۥۥۘ۠ۛ۠ۢۡۢ۟ۜۦۘۙۖۘۙۨۚ۠۫ۖۥ۬۬ۤۙۧ۠ۚۧۘۡۥۘۘۘ۬ۨۘۘۖۡۧ۬ۦۨۘ۫ۢۚ";
                                                                    break;
                                                                case -1515215272:
                                                                    str5 = "۠ۖۡۥۗۧۘۨۤۥۥۥۘۦۢۛۦۥۙۧۛ۬ۨ۫ۙۨۨۨۦۙۖۘ۫ۤۘۘۦ۬ۥۘۤ۫۠ۧۜۜۧۗۤ۟ۨۜۘۤ۟ۧ۬ۡۤۧۥۨ۠ۤۨۧۘۜۨۜۨۦۚۘۚۡۤۜ۠ۨۢۦۘۤ۠ۨ۫ۗۜۧۜۡۘ۠ۤۡۨۛۡۘۖۙۜۥ۬ۤۧ۠ۜۘ۫ۘۡ";
                                                                case -110528970:
                                                                    str4 = "ۛۢۛۤۤۥۘۤۦۖۘ۫ۘۤۤ۬ۤۘۗ۠ۦ۠ۨۗۢۖۘۧۜۧۘۖۛۤۗۥۦۥۡۙۚۘۛۜۛۖۚۦۘۜۦۘۜۖۡۘۚۥۥۖ۟ۦۤۨۘۧۡۢۖۗ۫ۨ۠ۘۧ۫ۗ۬ۚۧۚۧ۬ۥۜۘۘۛ۠۟ۦۛۛۥۙ۟";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                }
                                            }
                                            break;
                                        case 123040800:
                                            str2 = "ۛۤۢۨۦۤۤۜۛۚ۟ۚۧۤۧۜۢۦۖ۫ۤ۫ۥۗۘۧ۬ۢ۠ۜۘۘۢۢۧۛۤ۬ۥۥۘۛۘۗ۫ۡۘۘۜۖۡۘۗۙۖۢۥۛۗ۫ۦۤۘۘ۟ۤۥۤۢ۠ۤۛۢۚ۬ۚۧۧۥۘۛۛۨۘۜۨۘۘۖۧۘۚۖۨۘۦۖۦۘ";
                                            break;
                                        case 1345281670:
                                            str2 = "ۡۚ۟ۜۥۤۤ۟۫ۚ۬۠ۢۦۥۤ۟ۘۘۨۘ۟ۖۛۤ۟ۖۘۘۡۗۖۜۚ۬ۛ۠ۛۡۨۛۛۤۡ۟ۥۘۢۚۢۛۖۢۢۦۧۘۦ۬۬ۛۨۧۙۚۖۜۨۗ۫ۡۘ۬ۡ۬۬ۥۡۧۨۡۢۜۛ۬ۨۡ۬۬ۚۙۘۘ۠ۧۚۖۡۥۛۤۡۘۛۦۡۗۢۦ۫۠ۙۘ۫۟ۛ۠ۨۛۖۘ۫۟ۘۘ";
                                            break;
                                        case 1547217432:
                                            str3 = "۫۟۠ۤ۟۬ۖۖۙۢۧۨۘ۟ۘۦۨۘۥ۟ۨۥۘۙۗۖۘۛ۫ۢۥۡۖۧۡۖۚ۬ۦۘۨۨۚۧۖ۟۠ۜۡۘ۫ۖ۬ۛۜۗ۬ۤۖۘۛۜ۫ۤۙ۠ۗ۬ۛ۬ۚۥۧۨۖۘ۠ۥۧۘۤۢۙۦۘۚۜۜۙ۟۟ۤۦۜۦۜ۠ۘۘۤۤۚۖۙۥۘۙۜۗ۠۟۟ۚۛۖۡۘۤۦۛۙۡۙۘۚ۫ۜۘۡۘۜۘۥۙۖ۫۫ۛۢۡۗۜۛۜ۬۟ۚ";
                                    }
                                }
                                break;
                            case 86757375:
                                str2 = "ۛۗۢۡ۟ۨۛ۬ۥۛۦۜۙ۫ۧۡۡۚۖۦ۠ۗۙۥۘ۫ۧۥۨۙۨۙۥۢۗۥۘ۠ۥۡۤۥۖۘۨۙۜۘۨۧۜ۟ۛۖۡۘ۫ۨۥ۫ۤۘۘۧۙۢ۬ۜۤۡۨ۫ۚۛ۟ۘ۟ۜۘۛۜۛ۬ۡ۫ۖۥ۬ۙۚۢۡۗۚ";
                            case 2018833459:
                                str = "۠ۨۚۥ۫ۖۧۡۢۦۤۡۥۘۥ۠ۢ۟ۡۖۦۡ۬ۙۥۦۘۘ۟۬ۡۗۜۘۗۛۡۘ۟ۨ۟ۚۗۖۘ۟ۙ۫ۛۧ۠۬ۙۡۘ۠ۥۗ۫ۢۥۨۘۜ۠۬ۨۘۛۦۘۚۥۚ۠ۦۛۥۚۦ۟۫ۨ۟ۢۥۚۥۘۘۡۢۚۧۙ";
                                continue;
                        }
                    }
                    break;
                case 1060595265:
                    showCustomPermissionDialog();
                    str = "۠ۨۚۥ۫ۖۧۡۢۦۤۡۥۘۥ۠ۢ۟ۡۖۦۡ۬ۙۥۦۘۘ۟۬ۡۗۜۘۗۛۡۘ۟ۨ۟ۚۗۖۘ۟ۙ۫ۛۧ۠۬ۙۡۘ۠ۥۗ۫ۢۥۨۘۜ۠۬ۨۘۛۦۘۚۥۚ۠ۦۛۥۚۦ۟۫ۨ۟ۢۥۚۥۘۘۡۢۚۧۙ";
                    break;
                case 1146110958:
                    return;
            }
        }
    }

    /* JADX INFO: Access modifiers changed from: package-private */
    /* renamed from: lambda$showCustomPermissionDialog$0$kentos-loader-utils-ActivityCompat */
    public /* synthetic */ void m73x84800654(DialogInterface dialogInterface, int i) {
        String str = "ۦۦۤۥۗۥۙۧۢ۫ۘۡۥۗۦۛۛۜۘۥۦۨ۬ۘۡ۟ۡۖۥ۬ۦۘ۫ۥ۬۟ۥۗۡۤۧۡۘ۬ۗۛۦۥۜۘۖۢۦۘۙۧۖۘۧ۠ۖۢ۠۬ۨۛۨۘۘۜۢ۬۬۠ۚ۠ۥ۠ۗۙۖۥۘۢۖۖ۫۬ۧۛۘۚۗۦۘۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 776) ^ 237) ^ 165) ^ 437) ^ 712) ^ 59) ^ 466) ^ 779) ^ 122) ^ 198) ^ 223) ^ 153) ^ 949) ^ 508) ^ 910) ^ 908) ^ 264) ^ 487) ^ 91) ^ 617) ^ 818) ^ 913) ^ 993) ^ 39) ^ 826) ^ 797) ^ 153) ^ 980) ^ 662) ^ 1001) ^ 338) ^ 1217623843) {
                case -1000064811:
                    str = "ۦۙۨۗ۫ۥۡۤۡۘ۬ۜۘ۬۫ۢ۫ۜۨۘۡۨۦۚۡۘۦ۬ۦۘۤۖۦۘۗۗ۫ۡ۠۟۟۠ۘۘۢ۟ۧۘۡۧۤۘ۟ۢۘۖۘۚۧۖۡۜۨۘۥۡ۬ۡۚۛۡ۬ۙۘۙۙ۫ۚۧۦۨۙۥۘ۬ۖ۟۬ۙۖۗۘۗۜ۟۠ۦۘۛۦۡۢۤۘۘۧۙۨۘۜۢۖۘۡۘۡ۟ۗۖۘۦۘۙۥۡۚ۬ۙۡۘ۟";
                    break;
                case -587325058:
                    str = "ۘۢ۟ۡۗ۟ۦ۬ۡۘۙۨ۬ۡۡۖۖۢۙ۠ۙۘۘۜۤۨۗۘۧۚۧۘۘۤۡۘۗۦۛ۫ۧۖۘۧۗۤۥۖۥۛۘ۟ۚۘۖ۫ۜۜۘ۟ۥۤۧۢۨۖۗۛۡ۟۬ۦۡۤۜۥ۠۫ۚۨ۫۟ۖۗۖۘۢۙۢۙۦۦۘۨۤ۫ۧۚۖۥۗۗ۠ۖۘ۠ۚۘۘۖۥۡۗۤۡۘۘۧۙۖۜۜۘ۬۬ۥۘۜۘۜۘ";
                    break;
                case 271609217:
                    str = "۬ۤۨ۟ۤۦۘ۟۠ۚۨ۠ۥۥۙۦۘۜۨۛۚۢۖ۟۫ۚ۠۠۠۟ۨۜۘۦ۫ۙۜۚۡۘۡۗ۫ۙۖ۟۠ۧۥۘۜۚۨۘۛۦۖۘۗۘۜۘ۟ۘۥۢ۟ۜۙۘ۬ۦۧۧۦۜۘۡۤ۬۬۠ۘۗۨ۫۫۬ۜۘۥۘۜۘۡۛۢۘ۟ۘۥ۠ۧۦۘۥۘۥۘۦۢۜۘۨۙۥۘۡۡۨ۫ۤۖۜۜۨۘۗۡۗۛۢۥ";
                    break;
                case 705727210:
                    this.isPermissionFlowActive = true;
                    str = "۟ۧۥۘۖۘ۬۟ۤۜۗۨۖۘۗ۠ۢۗۘۜۢۡۧۗ۫ۦۛۙۡۥۚ۠۠ۘ۠ۦۤۢۙۘۖۛۖۦ۬۠۟۠ۘۨۨۖۘۜۘۘۜۡۘۡۢۖۘۡۢۗۙۡۢۥۨۖۢۚۙۡ۬ۘۘۤۖۧۦۗۤ۬ۚۦۚۘۥۘۡۡۦۘ";
                    break;
                case 888897618:
                    startPermissionRequestFlow();
                    str = "۬ۜۤۤۖۘۘ۟۬ۡۤۚۨۥۙۘ۟۟ۢۚ۠۠ۖ۠۬ۢۧۥ۠ۗ۠ۚۢ۫ۦۘ۟ۚۥۢۧۢۦ۟ۤۛۚۘۡۢۥۤۤۧۖۘۘۘۨۢۜۘۙۚۘۚۡ۠۠ۤۨۘۢۙۜۘ۫ۚ۫۬۫ۦۘ۠ۡۥۘۧۜۡۡۤۧۢ۟ۥۘ۠ۧۖۢۧۥۘۦۤۥ۠ۦۚۗۦۤ";
                    break;
                case 1282023121:
                    return;
            }
        }
    }

    /*  JADX ERROR: JadxRuntimeException in pass: BlockProcessor
        jadx.core.utils.exceptions.JadxRuntimeException: CFG modification limit reached, blocks count: 386
        	at jadx.core.dex.visitors.blocks.BlockProcessor.processBlocksTree(BlockProcessor.java:59)
        	at jadx.core.dex.visitors.blocks.BlockProcessor.visit(BlockProcessor.java:39)
        */
    @Override // androidx.fragment.app.FragmentActivity, androidx.activity.ComponentActivity, android.app.Activity
    protected void onActivityResult(int r8, int r9, android.content.Intent r10) {
        /*
            Method dump skipped, instructions count: 1262
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: kentos.loader.utils.ActivityCompat.onActivityResult(int, int, android.content.Intent):void");
    }

    /* JADX INFO: Access modifiers changed from: protected */
    @Override // androidx.fragment.app.FragmentActivity, androidx.activity.ComponentActivity, androidx.core.app.ComponentActivity, android.app.Activity
    public void onCreate(Bundle bundle) {
        String str = "ۖۘۦۘۦۘۘۗ۫ۨۘۗۥۗ۟ۖۢۛ۠ۢۗۥۚۖۤۨۙۜۛ۫ۛۘۖ۫ۡۧۛ۟ۜ۟ۗۥۥۘۘ۫ۡۜ۟ۧۛۜۗۛۨ۠ۜۘۖ۬ۥ۬ۜۛۤۧۥۘۚۛۚۛ۫ۧۧۛ۬ۢ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 483) ^ 465) ^ 327) ^ 301) ^ 586) ^ 957) ^ 620) ^ 117) ^ 76) ^ 787) ^ 272) ^ 640) ^ 898) ^ 205) ^ 662) ^ 945) ^ 479) ^ 272) ^ 275) ^ 387) ^ 153) ^ MaterialCardViewHelper.DEFAULT_FADE_ANIM_DURATION) ^ 932) ^ 718) ^ 59) ^ 479) ^ 318) ^ StatusLine.HTTP_TEMP_REDIRECT) ^ 554) ^ 188) ^ 789) ^ (-2100317314)) {
                case -1893767286:
                    str = "ۧۛۢ۟۠ۨ۬۟ۧۜ۬ۚۢۛۘۘۚۡۨۘ۬ۖ۠۠ۦۖۘۗۚۦۥۘۚۜ۫ۨ۫ۡۤۜۤۦ۠ۨۥۢۨۘ۠ۤۜۥۤ۟ۢۙۖۨ۬۫ۙۤۖۡۦۥۛۡۛ۬ۥۥۙ۟ۤۡۜۧۘ";
                    break;
                case -914462381:
                    setNavBar(C0931R.C0932color.background);
                    str = "ۢ۟ۡۘ۠ۖۛۢ۫ۚۢۨۧۙۗۤ۟ۖۗۙۧۥۘۘۨۛۡۘۧۧۡۢۦۜۧۡۖۤۤ۬ۦۘ۠۟ۘۧۧۗۚۗۜۙۧ۠ۚۥۛ۟ۖۨۙۘۦۤۡۧۦۜۘۦۢ۟ۡۖۧ۠ۦۖۘۤۛۦۚۤۤ۫ۖۖ۫ۨۡۘۧ۬ۛۡۥ۟ۡۡۦۘۢۥۜۘۧ۠ۚۧۗۥۢۘۥۗۤۚۧۦۥۘۦۥ۬۫۟ۛۙۡۘۤۗۨۨۖ۫ۧۧۜۘ۬۫ۖۘ";
                    break;
                case -776500841:
                    initiatePermissionCheck();
                    str = "ۘۡ۠۫۬ۗ۬ۢۢۦۙۨۘۗۧۚۘۦ۠ۧۦ۬ۛۧۦۡۘ۠ۨۘۚۛۖۦۘ۟ۗۜۘۨ۬ۜۘۛۖۦۘۤ۫ۤ۠ۚ۟ۡۨۨۦۜۡۘۦۦۦۙۢۘۘۦ۬۬ۤۡۡۘۤۗۤۢۨۘۧۨۨۘۦ۟ۜۘۥۚۨۙۜۨۤۘۗۙ۬ۤ۫۬ۡۖۙۘۘۢۨ۠ۥۥۤ۬ۦۥۘۛۗۗۥۧۗۤۥۢۛ۟ۥۘۚۨ۟";
                    break;
                case 201975894:
                    activityCompat = this;
                    str = "ۢ۠ۙۙۧۘۘۙۡۘۗۛۖۘ۟ۚۚۡۥۦ۫ۘۥۘ۬۟ۜۘۤۘۥ۬ۘۢۜۖۘۙۚۚۙۘۡۜ۫ۤ۟ۢ۠ۜ۠ۤۛۢۚ۟ۢۘۘ۠۬ۥۛۦۢۘۨۘۖۘۢ۠ۤۙۨۧۤۡ";
                    break;
                case 1036403882:
                    str = "ۜ۟ۘۘۤۙۥۛ۫ۨۧۨۦ۬ۡۙۘ۫ۨۛۙۥۘۢۙ۫۫۫ۥۛ۟ۖۗۖ۫ۥۛۜۘۖۤ۟۫۟۫ۛۨۘۡۗ۫۟ۨۘۚۨۘۙۚۜ۬ۘۢ۬ۙۜۜۜ۠ۤۧۘۥ۠ۜۛ۬ۖۘ";
                    break;
                case 1347371071:
                    super.onCreate(bundle);
                    str = "ۛۗۤۦ۬۫۟ۗۢۦ۬ۦۘۜۗۤۥ۬ۨۘۚۧۦۢ۬ۤۜ۬ۘۢ۠ۤ۬ۧۥ۬ۥۘۗۨۙۙۡ۠۠ۙۛ۟ۤۦۦۧۗۡۘۖۗۥۖۘ۠ۚۖۘۚۗۧ۠ۛۜۘۢ۫ۘۢۤۘۖۘۨۛۦۦۢ۬۫ۙۧ۟ۧۦۖۧۚ۠ۨۧۘۚۡۗۗۧۜۘۤۚۜۤۨۡ۫ۦۧۢۢۧۜۖ۬ۡۦۘۜ۟۟";
                    break;
                case 1385826668:
                    return;
            }
        }
    }

    @Override // androidx.fragment.app.FragmentActivity, androidx.activity.ComponentActivity, android.app.Activity
    public void onRequestPermissionsResult(int i, String[] strArr, int[] iArr) {
        String str = "ۥۤۙۥۖ۠ۙۤۢۘ۠ۦۖۛۡۨۘ۠ۜۘۘۧۛۘۘ۠ۜ۫ۙۥۢۡۡ۟ۚۛۥۘۨ۟۟۟ۨۦۘ۫ۜ۬ۚۦ۟ۛۜۘۘۨۨۦۙۢۨ۟ۡۗۨ۫ۚۖۖۗۛۖۙ۠ۜۨۥۙۥۙۢۢۚۛۦۤۥۜۨۤ۬ۚ۟ۧۜۧۗۚۥۤ۟ۨۘۥۘ۠ۥۥۡۛۛۖۘ۬ۤۧۜۘۥۗۚ۫ۚ۫ۡۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 762) ^ 888) ^ 844) ^ 578) ^ 415) ^ 220) ^ 877) ^ 836) ^ 280) ^ 932) ^ 533) ^ 103) ^ 963) ^ 440) ^ 66) ^ 977) ^ 941) ^ 765) ^ 113) ^ 347) ^ 147) ^ 639) ^ 787) ^ 893) ^ 242) ^ 328) ^ 492) ^ 119) ^ 3) ^ 465) ^ 633) ^ 647412472) {
                case -1837320934:
                    requestNextSpecialPermission();
                    str = "ۘۡ۟ۧ۬ۨۛۢۨۛۨۜۘ۠ۥۚ۫۠ۡۙ۠۫ۡۜۘۘۦۛۜۚۥۜۘ۠ۦۨۘۢۦۙ۬ۙۦۡ۫ۨۘۙۤۢۚۦۨۘۦ۫ۚۚۨۧۧۚۖ۫۫ۥۘ۫ۘۘۛۗۚۜ۫ۢۦۤۢۙ۟ۖۘ۫۬ۚۥ۠ۘۘۦۜۨ۬ۢ۠۠ۛۧۢۛ۟۠۫ۥۘۘ۠ۦۘۤۖۦۘۦۜ۠ۥۘۧۘ۬ۥۘۡ۫ۘ۬ۜۘ۫ۚ۫ۢۛۗۧۡۥۘۤ۟ۦ۫ۖۖ۫۟ۧ";
                    break;
                case -1075101391:
                    str = "۠۠۠ۙۡۨۢۙۧۘۨۜۘۨۨۜۨۥۗۢ۟ۡۨۧۖۗۗۥۗ۬ۗ۠ۢ۠ۚۗ۠ۖۘ۠ۘۦۘ۟ۘ۟ۖ۠۫ۨۢ۫ۧۘۘ۠ۤۡۢۤۨۚ۫ۨۢۜۗۛۙۗ۫۟ۦۨۖۘ";
                    break;
                case 90555138:
                    str = "ۙۖ۟ۗۥۨۖ۠۬ۥۘ۫ۚۢۥۘۜۚۛۙۙ۟۫ۤۦ۬ۗۥۘ۠ۡۤۧۢۦۛۖۚۗۨۤۡۙۨۡ۫ۡۥۘۛۤ۬ۧۢۜۘۖۡۗۛۦۤۤۜۙ۫۟ۜۘۥۤۡۡۛۜۘۙۥۦۢۡۗۘۡۘ۟ۧ۫ۢۨۚ۬ۡ۠ۖۚۦۘۙۢۡۘۙ۠۬ۗۤۦۜۤۖۘ۬۫ۘۘۛۖۘۘۦۗۗۢۚۥۥۢۤۧۛ۬ۥۨۙۗ۠۬ۧ۫۠ۗۖ۬";
                    break;
                case 559684755:
                    return;
                case 908222332:
                    str = "۠۬ۘۜ۬ۙۢۤۖۘۨۛۥۘۙۖۦۘۡۢۤۦۨ۫۠ۧۨۘ۟ۚۥۘۗۖۗۖۡۧۤۚۖۡ۠ۥۘۙۙۚ۬ۡ۟ۖ۟۠ۚۡۥۘۦۚۙۖ۫ۥۘۥۜۨۚۛۖ۟ۤ۟ۚۦۙ۫ۤۢۜۘۨ";
                    break;
                case 1091808537:
                    super.onRequestPermissionsResult(i, strArr, iArr);
                    str = "ۚۗۖۘۙۡۧۦ۫ۘۘۡ۬ۜ۫ۨۢ۫۠ۢۦۖۦۤۗۗ۬۠ۨۤ۫ۜۡۥۜۘۘۨ۠۟۟ۙۥۢ۟ۗۥۥۘۤۢۛۥۨۘ۬ۨۛۚۙۥۥۚۡۧ۠ۖۙۚ۫۠ۦۘۘۤۙۢۨۘۖۘ";
                    break;
                case 1167527484:
                    String str2 = "۬ۧۙۡۢ۫۫ۨۙ۟ۥۗۗۦۙۧ۠ۜ۫ۡۧۘۧۙۥۖۜۜ۬۠ۡۘ۟ۢۧ۟ۥۜۘۘۨۡۤۥۦۖۘ۬۫۟ۗ۬ۖۚ۬ۛۦۘۙ۫ۡ۠ۛ۫ۡۤۥۜۛۨۘۗۡۘۤۖۡۚۦ";
                    while (true) {
                        switch (str2.hashCode() ^ (-612616381)) {
                            case -1404527898:
                                str = "ۘۡ۟ۧ۬ۨۛۢۨۛۨۜۘ۠ۥۚ۫۠ۡۙ۠۫ۡۜۘۘۦۛۜۚۥۜۘ۠ۦۨۘۢۦۙ۬ۙۦۡ۫ۨۘۙۤۢۚۦۨۘۦ۫ۚۚۨۧۧۚۖ۫۫ۥۘ۫ۘۘۛۗۚۜ۫ۢۦۤۢۙ۟ۖۘ۫۬ۚۥ۠ۘۘۦۜۨ۬ۢ۠۠ۛۧۢۛ۟۠۫ۥۘۘ۠ۦۘۤۖۦۘۦۜ۠ۥۘۧۘ۬ۥۘۡ۫ۘ۬ۜۘ۫ۚ۫ۢۛۗۧۡۥۘۤ۟ۦ۫ۖۖ۫۟ۧ";
                                continue;
                            case -1122467790:
                                str = "ۙۤۢۗۚۦ۬ۧۜۘۥۖۙۤۧۦۙۧۚۘۗۗۘۡۘۡۛۦۨۦۖۥ۠ۦۘۗ۠ۖۘۤۛ۟ۢۛۧۨۙۛۢۥۛۚۡ۠ۡ۠ۛ۬ۥۗۡ۬۫۬۠ۥۘۖۛۦۚۚۥۚۦۧۨۧۧۙۥۗۙۥۙۚ۟۫۬۬ۖۘۚۤۦ";
                                continue;
                            case -484098683:
                                str2 = "۫ۙۡۘ۫ۙۥۘۚۢۗۘ۬۟۟ۥۦۘۢۖۜۘۚۗۚ۟ۙۨۧۥ۟۠ۗۦۘۙۚۖۘۢۜۜۦۗۥۨۘۗ۠ۚۥ۟ۖۖۗۚۘۘۥ۠ۥۜۨۧۡۜۧۢۜۗ۬ۥۖۘۚۛۥۘۘۢۖۘۘۢۚۚۨ۟ۨ۫ۘۜۘۦۘۗۧۨۘۘۗۘۘۧۖ۟ۗۦۘ۟۬ۡۘۤۗۦۢ۠ۘۘۨ۠ۨۘ۫ۚۗۘۘۨۘۜۙۗ۟ۤ۫ۙۦۧۗۘۘ۠۬ۥۘۨۤۤۚۛ۬";
                            case 1791182899:
                                String str3 = "ۗۘ۫ۢۢۘۛۖۧۘ۫۠ۖۡ۬ۧۜۢۖۘۗ۠۠ۧۧۡۘۖۦۚۢۨۗۙۤ۠ۖۤۖۢ۟ۡۘۨۦۛۛۘۤۙۖۧۘ۫ۛۗۢ۬ۛۙۘۢۢۗۘۜ۬ۘۘۚۧۜۜۘۜۦۘۘۥۖۡۘۧۤۘ۟ۨۧۛۧۘ۬ۨ۟ۨۡ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-883360779)) {
                                        case 340416309:
                                            str2 = "ۜۨۥ۠ۨۘۘۥۙۥۤ۠ۘۘۥۙۙۤۧ۫ۙۧۡۘۤۜۡۗۚۜۨ۟۠۫۠ۡۡۛۘۘۘۢۗ۟ۘۥۖۧ۫ۧۧ۟ۡۘ۬۫۟ۚ۫۠ۖۘۙ۠۠ۧۤۡۨۘۦۘ۠ۧۖۘ۬ۨۧۘۤۧۜۖ۫ۦۘۦۤۜۜۜۦۗۖۖ۠ۥۡۘۜۤۧ۟ۘ۠ۨۘۖۦ۠ۗۤۜۘ";
                                            break;
                                        case 520469096:
                                            str2 = "ۖ۟ۥۘۢۧۥۘۡۖۥۛۗۤۦۤۦۘۘۜۜۦۢۚۥۘ۫ۜۡۘۖۥۧۢۘۖۘۙ۠۬۟ۘۡۚ۠ۙۚۚۥۘۨۜۧۘۛ۟ۘۚۜۥۘۙۨۡۘۢ۫ۘۘۢۜۦۘۥ۫ۖۙۢۡ۫ۛۧ۠ۡۦ";
                                            break;
                                        case 1994446954:
                                            String str4 = "۬ۘۢ۬ۤۥۘۦۡۧۘۜۗۤۙ۠ۜۘۙۤ۬۫ۦ۟ۙ۠ۘ۫ۜۘۨۖۨۘۘۧۘ۠۠ۧۚۛۧۘ۬ۡۘۦۚۦۨۦۤۦۚۧۙۤۥۛۗۚ۠۫ۘۤۥۘۧۤۗۢۦ۟ۥۖۡ۬۟ۖۙ۠ۚۜۥۖۘۡۚ۟ۧۤۢۡ۫۬ۡ۫ۙۦۖۖۘۗۧ۟۫ۗ۟ۨۜۥۘ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 1054526290) {
                                                    case -1286011814:
                                                        str4 = "ۘۢۢۤ۬ۗۢۡۘۧۧۘۘۦۦۙۧۦۢۡۤۨۜ۬ۨۡۡۘۘۧۙۡ۫ۚۧۡۚۖۖۧۡۤۧۛ۠ۥۡۛۨۚۤ۬ۦۘۧۙۨۘۘۦۧۘۚ۠۠۟ۡۙۜۘۘۛ۠ۚۢ۬ۤۚ۬ۧۙۤۙ۟ۦۖۘۦۗۜۙۡۦۧۗۢۚۤۧۛ۟ۢ۠ۡۚ۬ۘۜ۠ۛۘۡۘ۟۬ۤۧۡۖۘۖۥۡۘۥۥۜۘ";
                                                    case -1085352727:
                                                        str3 = "ۚۖۦۘۥۧۨ۬ۙۛۖۛۖۘۤۡۤ۫ۧۛ۫ۙۖۘۚۥ۫ۢۙ۠ۡۙۥۖۛۥۘ۬ۛۨۘۖۜۗۘۜۚۡ۫ۤۖۧ۫ۡ۬ۚۘۧۡۙۗۧۥ۫ۢ۠۫ۡ۬ۨۖۘۚۖۨۚ۫۟۠۬۫ۜۛ۬ۤ۠ۢۤۨۖۚ۠ۤ۠";
                                                        break;
                                                    case -482652495:
                                                        String str5 = "۟ۖۨۘۚۧ۠۟ۧۡۛۧۧۖۥۖۤۡۜۘۤۖۜۜۧۡۘۤۡۢۗۘۧۘۨۙۥۗۥۨۢۥۧۥ۫ۦۤۘۘۗ۟ۢۥۥۘۘۨۧ۬ۡ۟ۖۗۘۘۨۨۡۦۤۖۘۗۖ۬۠ۖۦۘۖۙۥۘۧ۬ۘۘۢۨۗۤۛۢۜۜۘۤ۠ۧۨۛۛۥۡۡ۬ۛۦۘۤۨۤ۬ۚۜۘ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ 1661196580) {
                                                                case -1947809955:
                                                                    String str6 = "ۨۘۘۘۧۦۡ۫ۥۘۦۦۨۦ۟۬ۨۙۤۧۤۨۤۢۥۘۨۦۡۡۜۚۛۖۛ۬ۦۘۗ۟ۡۘۜۙۛۗ۬ۥۘۡۦ۟ۨۜۙۦۘۗۦۨۜۙۘۨۘۛۨۖۘ۬ۧۘۖۙۡۘۢۛ۠ۨۛۤ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ (-1828024436)) {
                                                                            case -454230048:
                                                                                str6 = "ۦۧ۠ۡۘۗۖۘۖ۟ۢۛ۟ۘۘۢۦۖ۟۠۠ۙۗۥۢۥۨۘۛۨۙ۠ۥۤ۫ۘۦۘۙۗۥ۠۬ۜ۫ۡ۬ۧۘۖۤۥۦۢۘۘۧۢ۠ۗۖ۬۫۟۬ۢۡۧ۬ۘۜۦۘۗ۬ۢ";
                                                                            case 102887089:
                                                                                str5 = "ۗۙۛ۟۫ۦۡۚۡۤۤۥۡ۬۟ۢۖۚۨ۫ۤۨۧۥ۟ۧۚ۫ۘۚۜۖۘۢ۟ۖۗۦۛۜۦۖۡۖۥۢۧ۫ۨۖۘۚۚۛۥۗۡ۫ۜۙۦۥۧۘ۟ۡۨۖۛۥۘۦۧۘۡۚۖۘ۟ۗۡۘۘۧ۫ۗۚۛۢۘۧ۬۠۬";
                                                                                break;
                                                                            case 140170463:
                                                                                str5 = "ۘ۫ۘ۟ۚۡۘ۬ۨۚ۠ۡۡۘ۟ۥۦۘۖۧۧۤۜۙۙۦ۟ۧۧۗۙۤۗۛ۟ۤۧ۟ۚ۫ۡۧۘۨ۫ۜۨۨۨ۟۫ۗۜۛۗۨۡۥۘۚۖۙۢۦۜۜۡۘۢۛۘۘۜۖۦۤۡۧۙۛۢ";
                                                                                break;
                                                                            case 233550714:
                                                                                str6 = i == 100 ? "۟ۗ۠۫ۚۥۥۦۗۗۢۡۖۤۖۘۢۜۢۥۙۨۘۖۢۥ۫۠ۦ۠ۛ۟۬۠۬۟۠ۙۚۨۘۦۘۚۡ۠ۨۘۙۗۜۘۡۨ۬ۙۗۘۘۧ۟۬ۨۤ۟۬ۖۘۤۗۖۘ۬ۤ۬ۥۧۘۘۜۢۢۦۦۥۘۗ۠ۡۘ۟ۥۗۖۥۧۘۗۤۘۘۗ۬ۨۤ۠۠ۦۜۛۖ۟ۙ۫۬ۘۘ" : "ۦۚ۬ۨۘۛ۟ۜۚۚۜۡۦۙ۠۟ۙ۟ۛۥۘۙۦۘۖۖۚ۬ۛۥۡۖۙۦۧۗۛ۠ۙۢۥ۫۟۠۠ۗۡۧۢ۬ۗۖۘۘۘۚۨۧۘۛۛ۠ۤۡۗۙ۠ۤۤۛۦ۟ۗۜۜ۠ۡۘۤۨۘۜۤۦۨۜۘۘۛۚۢۚۥۢۙ۟ۛۢ۠۟۠ۨۢ۫ۦۗۧۦۘۡۦ۫ۢۡ۠ۘۦۗۘۙۡۘۜۡۦۘ";
                                                                        }
                                                                    }
                                                                    break;
                                                                case -1417183291:
                                                                    str5 = "ۚۨۗۢۜۛۥۜ۫ۦۥۘۡۖۗۜۡۚۚ۬ۧۨۢۧۙ۟ۘۤ۫۟ۘۧۛ۬ۘۥۢۡۘۨ۠ۜۘۜۡۘ۫۠ۘۘۚۖۙۨۨ۫ۧۢۖۡۢۛۥۚۛۧۦۚۛۜۢ۠۬ۥۘۛۧۨۛۥ۬ۚۤۦۡۜۜۙ۠ۥۘۦۨۧۥۥ۠ۨۛۤۢ۠ۖۘۖۖۦۘۢ۬ۨ";
                                                                case -64884857:
                                                                    str4 = "ۗ۬ۡۘۗۦ۟ۙ۠۫ۥۥۘ۬ۚۧۜۜۡۘۨ۬ۥۘۙۦۖ۠ۜۢۡ۫ۨۜۡۘۤۜۖۘۙۚۚۤۗۖۘ۬ۘۘۚۜ۬۬ۨۨۦۖۢۡۗۢۤۡۚۖۤ۫ۚۤۢۗ۟ۘۘ۟ۚۦۘ۬ۗۘ۠ۢۛۨۙۗۘۥ۟ۛۗۥۘۡ۠ۦ";
                                                                    break;
                                                                case 1751455843:
                                                                    str4 = "ۗۤۘۘۖۘ۫ۘۤۖۚۥۨۘۙۤۖۖ۠ۘ۫ۙۛۥۘۗ۫ۥۜۢۜۘۖ۟ۨۨۥۡۗۜۛۘۤۖۛۗۥۙۖۜۦۙۨۘۗۦ۠ۘۤۘۘۙ۠ۡۘۧۢۚۦ۠ۛۥ۟ۙۤۘۧۘۘۢۨۘ۫ۖۘۖۦۖۧۙۜۘۚۜ۫۟ۥ۟";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 333925307:
                                                        str3 = "۠۫ۡۘۨ۫ۙۛۚۛۥ۟ۜ۟ۨۜۘ۬۟ۢۤۜۤۥۥۜ۫ۛۚۙۤۜۤۖ۫ۖ۫ۙۖ۬ۡۘۡ۬۬ۖۦ۫ۧ۫ۡۦۥۘۘۙۜۗ۫۫ۗ۬ۢۢۜۘۘۙۚ۟۠ۚۥۛۙ۠۠ۜۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 2035791732:
                                            str3 = "ۗۜۤۛۨۘۜۦۨۘۛۢۜۘ۫ۧۥۘۥۛۛ۬ۖۛۧۙۛۨۗ۬ۚۤۜۘ۫ۗۥۘۧۨۤۗۚۡ۠ۨ۟ۦۗۘ۠ۘۖۘۢۤۛۨۦ۫ۢۦۦۘۥ۠ۨۘ۠ۧۥۦۦۥۘ۬ۧۛۧ۠۟ۘۗ۟";
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 2093845519:
                    str = "ۥۥۤ۠۫ۛۘۤۡۘۖ۬ۥۘۛ۟ۜۨ۬ۘ۬ۜۛۗۢۧۚ۟۬ۧۧۜۚۤۥۦۚۥۘ۟ۤ۫ۖۘۦۘۨۗۨۘۡۦ۠۠۫ۖۢۡۘۜۚۦۗۙۢۚ۠ۨۡۜ۠ۦۧۥۘۙ۠ۦۘۧ۠ۚۥۧ۟۠ۢۚۘۗۢۙۖ۟";
                    break;
            }
        }
    }

    public void setNavBar(int i) {
        String str = "ۛۜۦۘۛ۫۟ۥۡۦ۫ۙۤۚۥ۠ۨ۟ۜۦۢۖۧ۫۫۬۟ۥۘۢ۠ۡۘ۫ۘۡ۟ۧۚۘۨۖۘۤۚۦۘۦۙ۬۟۬ۗۢۥۡۘ۟۟ۤۙۥۤۧۘۛۨۗ۟ۗۢۜۨۨۘۛۢۤۙۗۙۚۧۡۗۡۖ۫ۚۦۘۖۡۚۨۗۤۘۦۤۜۗۗۦۦۜۡۚۘۘۚۡۙۧۘۧۧۥۖۛۢۥۘ۬ۖ۬ۤۧۢ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 79) ^ 632) ^ 439) ^ 694) ^ 542) ^ 303) ^ 709) ^ 432) ^ 416) ^ 635) ^ 839) ^ 91) ^ 677) ^ 606) ^ 28) ^ 925) ^ 395) ^ 54) ^ 782) ^ PointerIconCompat.TYPE_NO_DROP) ^ 709) ^ 799) ^ 521) ^ 309) ^ 78) ^ 36) ^ 24) ^ 390) ^ 528) ^ 349) ^ 784) ^ 1955233307) {
                case -1872821492:
                    str = "ۘۖۘ۟ۦۘۘۚۜۦۖ۫ۖۘۘ۬ۨ۬ۥۧۘۚۦۘ۟ۚۢ۟ۧۡۘۖۥۙۘۜ۠ۜۜۘۘۜ۠ۨۨ۟ۥۗ۠ۛۦۖۗۙ۬ۖۘۜۦۛ۠ۙۖۘۨ۬ۥۘۢۨۥ۫۬ۨۘۡۖۡۘۙۗۥۘۙ۬ۨ۬۫ۡۨۚۖۘۧۚ۫ۢۛۜۗۘۛۢۙۗۡۦۘۘۡ۟ۡۘۖۛۚۧۗ۬";
                    break;
                case -1825410240:
                    return;
                case -1151727344:
                    getWindow().clearFlags(67108864);
                    str = "ۘۙۢ۠ۙۜۘۨ۫ۡۤۢۧۡۨۤۥۦۘۘۦۤۨۧۡۚۧۖۘ۠ۧۜۚۦۤۢۛۜۦۛۜۘۡۧ۬ۨۘۢ۟ۜۜۘ۫ۦۘۘۤۙۛۙۘ۟ۙۜۛۚۚۡۢۨۦۢۙۜۘ۬۟ۘۘۜۛۦۜۦ۠ۨۥ۟ۢۗۢ۫ۤ۫۠";
                    break;
                case -120961539:
                    getWindow().addFlags(Integer.MIN_VALUE);
                    str = "۟ۦۛۧۙۖ۬ۚ۬ۦۚۥۘۚۢۜۦۖۧۘۛۙۖۘۜۛۦۘۡۗ۠ۛۗۥۘۛۢۘۘۢ۟ۖۘ۠ۗۘۘ۬ۤۡ۫ۨۘ۬ۦۘۢۘۖۘۤۘ۫۬ۙۥۧۦۧۘۖۘۦۙۘۨۘۨۡۧ۟ۨۛۤۛۗ۠ۨۚۚ۟ۘ۟ۧۨۘۙۦۗۘۜۨۘ";
                    break;
                case 523553259:
                    getWindow().getDecorView().setSystemUiVisibility(8192);
                    str = "ۙ۬ۨ۫۠ۨۘۛۖۨۜ۠ۗ۬ۡۛ۫ۙ۟ۙۥۧۡۚ۠ۦۥۘۚۙۘۛۦۜۘ۠ۖۡ۫ۗۥۧۦۨ۫ۦۘۤۥۢۧۨۖۨۢۨۘ۠ۗ۬ۗۖۨۖۜۖۘ۫۟ۛۗۦۖۘۚ۫۠ۖ۟ۨۘۙۗۧۚۛۘۘۧۚۚ۫ۖۜۙۚۖۜۙۦۜ۟ۚۤ۟۬ۛۧۡۘ۬ۗ۟۟۟ۖۘ۠ۜۦۢۥ۬ۖۘۘۧۚۖۘۧۙۥۘۙۚۖۘۚ۠ۜۘۗۖۜۦۖۦۘ";
                    break;
                case 547151884:
                    getWindow().getDecorView().setSystemUiVisibility(4);
                    str = "ۙۗۢۛۨۤ۠ۖۢۡۧۦۘۦۖۨۘ۟ۚۥۘ۫ۙۖۦۧ۬ۢۥۥۘۖۜۥۘۘۢۧ۠ۙۜۡۖۤۤۘ۠ۥۤ۟۫ۙۢۛۘۦۘۦۗ۫۟۬ۜۘ۬ۢۜۥ۟ۖۢۡۡۘ۟ۤ۫ۖۘۨۘۧۤۘۘۛ۠ۦۦۥۡۚۜۘۢ۬ۜۢ۬ۛ";
                    break;
                case 1128095105:
                    str = "۫ۤ۬ۗۙۤ۬ۜ۫ۗ۠ۖۘۖ۫۟ۨۜۖ۬ۦۜۜۥۖۛۜۨۖ۬۠ۜۡۖ۫ۤۤۛۨۨۘۦۨ۬ۖ۟ۥۘۛۛۧۛۢ۫ۤ۬ۥۘۛۥۘۧۨۨۘۙۥۥۘۤۨ۫ۤۙۘ۬۠ۙۜۖۘۜۖۘ۠ۖۧۗۖۙۛۚۚۨۛ۠";
                    break;
                case 1416341272:
                    getWindow().setStatusBarColor(ContextCompat.getColor(this, i));
                    str = "ۡ۫۟ۗ۬ۙ۫ۧۥۧۧ۟ۤۖۜۘۙ۟ۥۖ۫۫ۡۘۘۛۛۨۘۙۤۥۘۦۘ۟ۧۙۜۚ۟ۢۥۛۛ۠ۤۥۘۥ۠ۚۜ۠ۘ۠ۙۘۘ۟ۡۘۜۙۨۘۘ۠ۜۘۥۘۨۘ۟ۚۜۘ۠ۖۤۧ۠ۘۘۜ۟ۤۖۨۡۘۖۘۘۘۥۥ۫۬۟ۥ۟ۗ۟ۜۢ۟ۤۤۗۦ۟۫ۙ۠۠ۘ۫ۧۧۥۘۦ۠۠ۛ۬ۜۘۘۡۤ";
                    break;
            }
        }
    }
}
