package kentos.loader.utils;

import android.os.Build;
import androidx.core.app.FrameMetricsAggregator;
/* loaded from: classes2.dex */
public class BuildCompat {
    public static boolean atLeastR() {
        String str = "ۥۥۨۘ۟ۗۨۘ۟ۢۤۦۗۙۡ۬ۙ۠ۧۙ۬ۘۜۘۤۛۜۘۚۤۦۛۧ۬ۢۗۡۘۧ۬ۘۘ۬ۖۧۘۚۖۢۚۜۙۙۨۘۦۖۜۘۛۦۚۙ۬ۜۘۦۚ۠ۥ۠۠ۛۘ۟۠ۥۙ۫ۜۢۙ۬۬ۥۘۥۘۖۢ۟ۦ۟ۢۖۡ۫ۧۛۙۙۜۜۘ۫ۥۧ۟ۖ۫ۦ۬ۧۦۥۢ۬ۦۦۢۥۘۗۚۖۘۥۢۙۤۛۦۘۙۢ۟ۙ۟ۚۘ۟ۦۢۢ۟۬ۗۚ";
        boolean z = false;
        boolean z2 = false;
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 697) ^ 794) ^ 554) ^ 295) ^ 157) ^ 752) ^ 705) ^ 736) ^ 289) ^ 325) ^ 702) ^ 538) ^ 168) ^ 52) ^ 944) ^ 647) ^ 406) ^ 706) ^ 141) ^ 726) ^ 107) ^ 423) ^ 776) ^ 613) ^ 676) ^ 248) ^ 249) ^ 79) ^ 404) ^ 891) ^ 165) ^ 1242422198) {
                case -2021140174:
                    str = "ۛ۬ۤۙۨۢۜۘ۠ۢۜۗۦۧۦ۠ۡۜ۟ۜۛۢۖۧۘۤۡ۫ۘ۟ۜۘۗۧۘۧۤۢۨۢۥۘۗۜ۟ۤۧۧۨۥۥۘ۟۫۟ۥۥۜۘۡۘۖۦ۬ۦۘۤۨۖ۟۠ۨۖۙۤ۫۠ۚۥۛۨ۠ۡۧۨۥۘۖۤ۬ۥۧۘۘۧۧۖۘ";
                    z = z2;
                    break;
                case -915815837:
                    str = "۬۫ۖۜ۬۠ۢ۫ۡۘۡۖۦۘۡۥۧۖۗۦۗۢۦۘۢۡۥۛ۠ۛ۫۫ۡ۟ۧۡ۠۠ۙۡۜۦۘۥۘۘۛۗۛۜۛۜۘ۠ۥۖۡۗ۟ۤۡ۫۠۟ۨۘۢۘۥۘۥ۫ۨۢۦۛ۬ۥۜۘۤۦۨ";
                    z = false;
                    break;
                case 732913759:
                    z2 = true;
                    str = "ۧۛۚۥۜۥۘ۫ۤۦ۫۬ۨۛ۬ۚۗۨۗۡۧ۟ۖۨ۠۬ۘۨۘ۫ۘۘۘۘۤۧۘۦۢ۬۟ۘۨۥۗۛۜ۫ۙۢۢۢۜۛۜۘۚۡۡۘۡ۠ۡۡۧۚۡۘۖۥۛۥ۟ۗۗ۬ۥۘۘۛۙۢ۫ۥۦۘۦ۫ۜۚۤۥۘO۬ۙۨ۬ۙۡۘ۠ۡ۠۫۫۫ۖۚۘۘۦ۬ۘۗۖۨۦۦۚۙ۟۫۫ۜۗ";
                    break;
                case 947796386:
                    str = "ۤۨۛ۠ۡۗۙۖۙۖ۟۟ۤ۫۟۠۟ۥۨ۬۠ۨۡۖۘۨۤۜۘۗ۟ۜۧۡۙۚ۠ۘۘ۬۬ۙ۬ۛ۟ۡۥۘۙۛۥۘۚۡۗ۬۟ۥۘ۬ۡۤۡۚ۠۟۟ۘۤۡۥۧۘۡۜۛۘۘۙۡ";
                    break;
                case 1545577100:
                    str = "۬۫ۖۜ۬۠ۢ۫ۡۘۡۖۦۘۡۥۧۖۗۦۗۢۦۘۢۡۥۛ۠ۛ۫۫ۡ۟ۧۡ۠۠ۙۡۜۦۘۥۘۘۛۗۛۜۛۜۘ۠ۥۖۡۗ۟ۤۡ۫۠۟ۨۘۢۘۥۘۥ۫ۨۢۦۛ۬ۥۜۘۤۦۨ";
                    break;
                case 1557673103:
                    String str2 = "ۚۥۢۙۙۨۘۤ۬ۚۨۘۧۘۤ۟ۛۢ۬ۦۚۙۘۘۛۤۜۘ۟ۗ۫ۙۛۙۘۘۘ۫ۗۘۘ۠ۨ۫ۦۡۘۘۚ۫۫ۡۡۘۖۨۜ۟ۥۧۘۤۙ۬ۧۖۡۘۛۚۙۗۙۛۤ۬ۨ۬ۚۙۡ۫۟ۨۥۘۧۙۘۘۙۖۖ۫۟ۜۘۙ۬۫ۜۦۧۘۜ۬ۡۖۛۡۘ۠ۖۧۘ۬ۜۘ";
                    while (true) {
                        switch (str2.hashCode() ^ 1819171965) {
                            case -1325346660:
                                str = "ۧۗۥۘۜۧۜۗ۬۠ۢۧۢۙ۬۠ۗۨۨۘۖۜۙۨ۫ۜۘۦۚۧۙ۫۫ۧۘۛ۟ۙۙۘ۬ۜۘۚ۬۟ۜۥ۠ۛۖۘۘۚ۠ۨۘۤۢۘ۬۟ۤۗۦ۟۟۬ۛۛۦ۬ۢۤۜۥۢۧۜۜۜۘۧ۠ۨۘۧۙۡۘۙ۫ۛۤۛۡۗ۠ۛۨۛۥۙۘۘۢۢۜ۟ۦۜۘ۬ۧۡۘۢۘ۫۟ۙ۫ۥۦۢۗۗ۫۟ۜۡۘ";
                                continue;
                            case 393938351:
                                str = "ۗ۬ۙۥۛۨۘ۠ۨۧ۫۠۠ۧۡۦۘۘۛۜۚۛۜۘۚۛۘۚۥۥۜ۟۠۬ۡۘۖۚ۠ۖۚۦۖ۫ۜۘ۫ۨۨۧۤۚۚۢۖۖۛ۟۬ۛۗۤ۠ۢۖ۬۠ۙۢۨۘۨۤ۫۬ۥۘۢ۬ۛۥۤۘۘۘ۠ۖۘ۠ۙۚۤۘۥۘۘۤۡۘۡۚ۠ۖۛۤ۠۠ۜۘۧۡ۫ۧ۬";
                                continue;
                            case 777657033:
                                str2 = "ۤ۠ۦۘ۠ۡۤۡ۠ۥۘ۠ۗۢۧۜۘ۫ۖۖ۟ۖۤۚۜۘۛۘۜۘ۠۬ۨۚۦۡۘۦۥۘۗۥۧۘۤ۬ۚۖۤۙۖۥۚۧۗۦ۬ۡۜۢۥۢۖۚۥۚ۫ۡۙۤۨۧۖۘۨۜۦۘۚ۫ۧ";
                            case 1562728249:
                                String str3 = "۫ۛۡۘۨ۬ۥ۫ۗۘۘۛ۠ۨۛۡۦۢۢۖۘۛۙۤۥۦ۫ۡۗۚ۫ۥۘۢۦۘۘۥۛۥۧۚۛۥۦۦۘۛۚۦۗۨۗ۟ۙۙۙۛۥۦۚۨۘۙ۬ۚۥ۫ۜۘ۠ۚۦۘۦۘۖۘۧۢۡ۫۬ۥۢۙ۟ۧۛۛۧۘۙ۬۟ۤۖۘۘ۟ۘۛۜ۬ۖۘ۬۟ۨ۬ۤۧۗۙۙۡۦۗۖۖۨ۟ۙۛۘۚۨ۫ۥۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ 604976130) {
                                        case -1259790886:
                                            str2 = "ۜۦ۫۫۫ۡۢۗۡۖۦ۟ۜۙۢۖۨۧۜۥۘۡۙۢۨۢۡۘ۟ۚۥۡۡۛۘۡۧۘ۫ۙۖۘۜۚۨۘۘ۫۬ۘۜۖۘۦۘ۟۫ۛۧۥۘۜۘۙ۫ۘۘۦۗۨ۟ۥ۠ۨۗۖۘۨۛۘۘ۠ۗ۟۟ۘۘۘۚۜۖۘۧۨۜۘ۠ۗۙۚۡ۫۫ۘۙ۠ۚۨۡ۟ۡ۟ۦۘۘۤ۬ۨۜۨۜۘۤ۟ۗۜ۠ۢۢۙۘۘۖۖ۫ۢۜۡۘۨۙۦۘ۫ۤۧۤۜۡۘ۠ۖۜ";
                                            break;
                                        case -1029575973:
                                            String str4 = "ۜ۟ۨۘۡ۫ۦۘۜۥۚۖۥۘ۠ۢۚۤۛ۫ۘۙۧۘۙۗۙ۟۫ۧۘۨۤۦ۬۬۬ۖ۟ۢۚۨۨۧۤۡۘ۬ۡۥ۠ۛۖۧۛ۬ۡۘۦۥۦ۬ۚۙ۫ۢۘۦ۫ۤۧۜۜۥۦۙۘۨ۟ۦۡ۟ۦۚۧۜۖۘ۠ۙۤۦۖۧۥ۟۠۫ۧ۬۟ۗۨۗۖۘۖۖۘۗۛۘۜۙ۠ۜۚۥۘۦ۫۟ۡ۠ۨۖۘۧ۫ۖۦۜۚۨۚ۬۫";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-1255651666)) {
                                                    case -1523046071:
                                                        str3 = "ۧ۬۬ۚ۬ۖۘ۟۠ۥۧۛۘۢ۫ۢۚۖۘۢ۟ۚۢ۠۠ۢۢ۬ۖۤ۟۟ۜۙ۬ۜۘ۫ۜۡۘۢۦۖۜۘۜۘۢۨۛۨۤۙۘۥۦۜۙ۬ۘۡۘ۬۬۫ۤۥۖۙۡۛۘۧۙۙۘ۬ۛۢۚۢۜۥۘۜ۠۬ۜۨ۠ۧۛۘۚۡۡۗۨۘۚۢۦۘۤۧ۫ۘۘۘ۠ۢۢ۟ۘۛۧۗۘۘۨۘۜ۠ۘۘ";
                                                        break;
                                                    case -1116955585:
                                                        str3 = "ۛۨۡۘۨۚ۟ۘۙۧ۬ۨۘۤۡۛۢ۬ۤۧۙ۟ۥۘۙ۟ۨۘۙۥۥۘۜۢۖۧۘ۠ۗ۟ۗ۫ۤۦۨ۠ۜۘۚۙۤۤۨۦۘ۟ۦۨۛۡۜۘۥۢۘۙۧۘ۠ۖۧۡۘۚۡۢۤۤ۫۠ۦۖۘۧۤۦۘۘۖۘۘۗۨۗۤۤۨۚۤ۟ۗۤۛۥۖۦۙ۠ۚۢۢ۟";
                                                        break;
                                                    case -138515362:
                                                        String str5 = "ۧ۠ۡ۬ۜۜۛۥ۠ۛۙ۬ۙۨۥۦۘ۠ۛۡۦۘۧۡ۫۠ۡۚۖۚۢۖۖۖۖۥۨ۫ۧۚۧۘۘۨۗۦۘۗۨۘۤۘۡۜۛۙۜۜ۫ۤۙۥۘۗۦۘۥ۠ۜ۬۫ۥۘۨۙۤۛۘۚ۟ۤۧۗۗۛۜۘۦۧۘۖۘۦۛ۠";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ (-782640561)) {
                                                                case -1997412341:
                                                                    str4 = "ۚ۫ۛۘ۠ۜۡۢۖۘۘۛ۟۬ۦۡۘۦۡۥ۟ۨ۬ۨۨۦۘۧۡ۟ۡۚۢۧۜۥۢۨۨۘۙ۠ۚۘۘۖۛۚ۫۬۬ۥۘۛۙۚۚۗۗۢۗ۟ۤۖۘۧۖۖۘۜۡۚۘۗۗ۬۟ۦۘۛۧۗۗ۫ۥۖۢۨۘۡۖۢۧۢۨۙۧۡۘۘۧۜۘۗۧۡۘ۟ۡۘۘۢۘ۬ۢ۫۟ۥۗۙۦۜ۠ۚۛۦۤۢ۫ۡۥۘۘۡۖۤۙۡۧۘ۟ۜۘۙ۠ۚۡۥ";
                                                                    break;
                                                                case -614829402:
                                                                    str5 = "ۧۛ۠ۡ۬ۧۥۛۖۘ۬ۗۜ۟۬ۦۦ۬ۙ۠ۛۙۖ۫ۙۧۗۨۚۥۘۧۘۧۘۧۦۚۦۘۦۖۗۤۦ۟۟ۚۡۜۘۢ۠ۙۙۜ۟ۛۜۧۤۡۦۘۨۨۨۘۦۡۘۖ۬ۢۤۚۨۘۘۥ۫";
                                                                case -131602562:
                                                                    String str6 = "ۤۘۡۘۨ۟ۥۦ۫ۡۚۦ۟ۛۛۥۧ۟ۡۘۖۙۜۘۗۡۜۘۗۤۙۤۜۡۘۚۦۜۘۖۜۢۛۖۢۨۡۨۘۢۦۘۥۛۢۚۡ۠ۨۜۖۘۥۥ۫ۛۛۥۤۖۥۨۨۜۘۖۚۖۗۜ۟ۡۘۘۨۨ۟ۦۢۡۧۜۨۢۢۡۘۦۡۤۤۥۥۖۗ۟ۘۨ۫۬ۥۖۘ۟ۙ۠ۚۜۚۚۦۡۗۨۦۘ۠ۦ۟ۙۜۡۤۨۧۦۙۤۛۡۢۖۖۚۛ۠ۥۘ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ (-1107952139)) {
                                                                            case -1834278194:
                                                                                str6 = Build.VERSION.SDK_INT >= 30 ? "۠ۖۤۤۢۨۘ۠ۧۘۘۜۤ۟ۚۗۘۘۡ۫۟ۖۦۡۘۡ۟ۨۘۤ۫۬ۨۦۢۥ۫ۘۗۗۙۖۢۦۨ۟ۜۥۛ۠ۜ۠ۘۘۘۖۧۛۛۙۥۘۗۧۚ۠ۢۧ۟ۢۦۘ۠ۛۚۘۨۘۡۨۤ" : "ۢ۫ۘۘۤۥ۫ۛۧۛۧۘۨ۬ۘۧۤۨۗ۬ۜ۬ۥ۬ۥۗۧۦۗۥۘۧۨۜۘۚۙۜۘ۬۟ۙۡ۬ۘۦۗۡۘۜۦۧ۬۫ۚۥۘۡۘۦ۠ۖۘۖۗ۟ۗۡۘۘۡۚۦۡۤۧۥۙ۟ۜ۟ۚۖ۟ۦ۟ۡ۠ۛۖۜۖۚۨۘۘۨ۠۠ۚۘۢ۫ۜۘۙ۫۠ۖۨۘۘۜۡ";
                                                                            case -1656066926:
                                                                                str5 = "ۥ۬۟ۡۤۙۡۡ۬ۜۨۦۖۘۥۧۦۘۛ۫ۧۗۛۖ۠ۗۘۚۗۚۛۥۚۖۡۥۨۚۛۦ۠۟۠ۨۢۡۢۡۛۖۖۦ۬ۦۖۢۙۚۖۘۘ۟ۥۗۡۜۖۦۘۥۢ۫ۢ۠ۨۘ۬۟۬ۢ۟ۗۘۜ۠ۥۦۡۙۚۦ۟ۜۢۢۨۚ۬ۖۜ۬ۡۖ۟۠ۨۘ۠۫ۜۨۡۘۘ۟۟ۧۛۡ۟۬ۤ";
                                                                                break;
                                                                            case -544159571:
                                                                                str5 = "ۛۜۨۘ۬ۥۙۚۛۥۢۜۢۨۙۗۤۦۘۥۦۦۡۡۤۦۖ۬ۢۧۧ۠ۖۖۘۨ۫ۤۤۦۜۥۘۤ۫ۧۡ۫ۢۜۘۗۤۖۘۢۛۡۢۖۦۘۚۙ۬ۥۥۚۙۚ۠ۗۨۨۜ۬۫ۨۦۨۘۤۡۤۖۗۗۙۚۨۘۚۖۚۗۗۨۘ";
                                                                                break;
                                                                            case 583630664:
                                                                                str6 = "ۧۘۖۘۗۥۜۧۖۡۨۦۘۘۚۢ۫ۥۖۨۙۛۦۤۡۧۘ۫۠ۤۡۧۥۘۧۛ۟ۛۦۡۧۨۖ۬ۚ۬ۗۜۢۘۥۧۢۗ۟ۛۤۦۦۙۖۘۡۘۖۤۖۤ۫ۘۘ۫ۛۜ۬۠۟ۢ۟ۜۘ";
                                                                        }
                                                                    }
                                                                    break;
                                                                case 515261833:
                                                                    str4 = "ۗۜ۠ۦۖ۠ۛۥۨۗۡ۫۫ۧۢۡۗۧۙ۟ۘۜۥۢۜۗۨۗۛۨۦ۟۠ۧ۫ۢۗ۬ۙۤ۠۬ۗ۠ۘۘۘۚۦۘ۟ۨۜ۫۠ۥۘۖۜ۬۟۟ۜ۠ۖۜۘۦۗ۬۫ۚۜۘۧ۫ۛۤۨۡۜۦۛۙۡۙۨۚ۬ۢ۟ۘۘ۫ۤۡۙ۠ۖۘۖۦۧۘۤ۬ۛ۟ۚۥۢۗۘۘ";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 1025752812:
                                                        str4 = "ۧۙۨۛۤۦۥۦۨۘۘۦۤۡۥۛۜ۟ۥۘ۟ۜۨ۬۟ۘۘۚ۬ۙۛۢۘۘۙۤۦۗۦ۠ۧۘ۠۟ۖۨۘۜۚ۬۟ۘۘۥۨۡۘۙۡۤۡ۟ۘۘۘۙۖ۬ۘۡۘ۫ۧۥۘۘۤۜۘۡۖۗۖۗۘۘۧۢۡۘ۠ۗ۫ۘۖۨۘۗۨۨۘۦ۬ۜ";
                                                }
                                            }
                                            break;
                                        case 898375993:
                                            str2 = "۬ۢۖۥۥۛۦۢۛۦۖ۫ۖۡۗۥۙۚ۟ۙۢۦۧۡۘۚۨۢۨۚۖۘۨۛۜۜۦ۫ۢ۠۬ۨۚۡۘۛ۫ۤۘۜۗۛۚۛۚۤۜۘۗۧۘۘۡۦۥۗۨۨۘۗۦۧۘۨۛۨۜۚ۬ۖۢۧۖ۠ۘۗۖۚۥ۬ۦ۟ۢۗۛۢۡ۫ۜۧۚۘۖۙ۠۟۫ۚۦۦۛۡ";
                                            break;
                                        case 1020721404:
                                            str3 = "ۗۖۧۘۙۢۨۘ۠ۡ۬ۖۥۘۚ۟ۡ۬ۧۧ۠ۦۘ۠ۤۨۘۜ۬ۡۘ۠ۖۥۘۛ۫۬ۡۖۨۘۘۦۜ۬ۢۜۘۢۘۨۨۦۜۘۥۤۧۡۡۡۘۤۢ۠ۚ۟ۨۨۨۦۘۙۥۧۦۨۡۘۚۘۨ۫ۘۧۘ";
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 2097992051:
                    return z;
            }
        }
    }

    public static boolean atLeastTiramisu() {
        String str = "ۘۘۘۦۛۖۘۦ۬ۢۙ۫ۚۘۛ۟۠ۚۧۛ۬۬ۖ۬ۚ۬ۦۘۥۛۘۘۗۨ۫ۡ۟۟ۙ۠۫۠ۤۦۘۖۨۤ۟ۙۦۘ۟ۧۡۘ۟ۥۗۢۜۘۙۜۥۥۖ۬ۧ۬ۨۦۦ۬ۢۖۖ۟ۡ۫ۡۘ۫ۜۘ۬ۗۢۢۧ۟ۛۦۜۖۨۘۗۡۥۨۧۦۘۛ۫ۦ۫ۢۖۘۢۙۡۘۥۗۨۘۛۦۘ۟ۖۘۘۤۚۢۚۛۥۘ۟ۗۙۘۘۘۧ۟ۢ۠ۥ";
        boolean z = false;
        boolean z2 = false;
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 365) ^ 698) ^ 860) ^ 165) ^ 507) ^ 266) ^ 787) ^ 92) ^ 52) ^ 780) ^ 458) ^ 665) ^ 525) ^ 286) ^ 165) ^ 997) ^ 859) ^ 634) ^ 852) ^ 419) ^ 483) ^ 270) ^ 84) ^ 350) ^ 535) ^ 194) ^ 21) ^ FrameMetricsAggregator.EVERY_DURATION) ^ 990) ^ 291) ^ 362) ^ (-301769993)) {
                case -1822105851:
                    str = "ۗۢۤۤۡۧۡۚۡۘۨۛۚۛۧۡۘۚۖۦۢۘ۟ۙۘۘۢۢۘۥۡۗ۠۫ۘۘ۟۫۫ۖۧۢۢۧۜۜۖۛۨۧ۠۠۫ۧۧۦۘ۟ۧۦۘ۫۠۬ۙۙۘۘۢۖۗۤۚۗ۠ۚۘۘۜۡۗۗۡۘۦۥۜۘۦ۫ۥ۬ۖۡ۠ۢۗۜۖۦۘۧۦۘۗۨۘ۫ۗۢۥۤ";
                    break;
                case -1474500015:
                    str = "ۚۢۤۖ۬۠ۧۢۦۙۜۘۘۖۚ۬ۖۘۘۢ۠ۤۢۤۥۢۘۚ۫ۛ۟ۙۥۘۧۡۨۗۗۨۤۙۜۘۧۧۢۖۘۡۧ۬ۨ۫ۤۧ۫۫ۚۦۥۧۙۨۧۘۛۘ۬ۤۖۘ۫ۢۖۤۤۦ۫ۧۨۧ۫ۢۢۛ۫ۜۛۜۡ";
                    break;
                case -621439776:
                    return z;
                case -455321463:
                    str = "ۗۢۤۤۡۧۡۚۡۘۨۛۚۛۧۡۘۚۖۦۢۘ۟ۙۘۘۢۢۘۥۡۗ۠۫ۘۘ۟۫۫ۖۧۢۢۧۜۜۖۛۨۧ۠۠۫ۧۧۦۘ۟ۧۦۘ۫۠۬ۙۙۘۘۢۖۗۤۚۗ۠ۚۘۘۜۡۗۗۡۘۦۥۜۘۦ۫ۥ۬ۖۡ۠ۢۗۜۖۦۘۧۦۘۗۨۘ۫ۗۢۥۤ";
                    z = false;
                    break;
                case 77277222:
                    String str2 = "ۤ۠ۜۤ۠ۚ۬۠ۡۘۜۚۙۛۤۛۡۙۡۘۥۥۡۘۛ۠ۚ۫۟ۡۘۧۖ۫ۗۙۖۦۙۘۛ۬ۤۛ۟۬ۧۙۜۘ۫ۧۡ۠ۜۨۙۙۡۘۢۖۦۘۜۗۨۙۘۘۨ۟ۘ۟ۥۘۘ۫ۚ۠ۙ۠۠۟ۢۥۗۗۘۙۥۛۙ۫۠۫ۜۨۥ۟ۗ۠ۘۦۡۛۧۦۥۧۢۥۖۘۡۖۖۙۡۤۤۨۘ۬۠ۢۙۡۧ";
                    while (true) {
                        switch (str2.hashCode() ^ 1634635912) {
                            case -1701095352:
                                String str3 = "۟ۚ۫ۢۥۡۘۦۚۢۤۧۨۧۢۥۦ۫ۨ۟ۡۡۘۗۨۗۛ۬۬ۧ۠ۚۘۨۥۚ۬ۢۨۘۘۘۗۦۘ۟۟ۜۙ۬ۙ۟ۚۜۘۨۙۥ۟ۥۤۧ۬۫۬ۜۗۨۥ۬ۚۡۡۤۖۥۘۡۢۜۗ۠۫ۗۡۤۗۚۜۘۜۦۗ۬ۢۖۘۦۨۘۖ۠ۦۘۤۖۡۘ۟ۡۘۧۗۦۘۘۢۨۗۛۥۧۘۨۧۤۦۨۧۜۦۨ۟ۤ۟ۘۗۛۛ۠ۜۘۖ۟ۡۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ 532464332) {
                                        case -710712142:
                                            str3 = "ۖۧۙۡۦ۫ۥۚ۫۬ۥۧۛۥۧۘۨۧۘۦۢ۟ۜ۫ۛۖۨ۠ۥ۫ۗ۟۬ۖ۟ۘۜۖۧۨۘۡۘۥۘۙ۟ۚ۬ۦۧۢۙۧ۫ۜۖۚۧۧ۬ۛ۬۫ۘۤۚۤۢۥۧۥۘۦۖۢۜۘ";
                                        case 784192033:
                                            str2 = "ۖ۟ۜۤۜ۟ۦۘۘۘۧۦۘۘ۠ۦۘۘۤۜۜۚۤۢۥۛۖۘۜۧۜۧۘ۫ۚۜۖۨ۠۬۠۟ۜۧۜۘۗۛۥۖۗۡۘۜۜۗ۫۟ۤ۟۫۬ۜ۠۠ۚ۟ۡ۟ۧۛۘۙۢۜۛۜۘۥۥۦ";
                                            break;
                                        case 820236098:
                                            str2 = "ۗۘۡۡ۫ۥۤۡۚۤ۟ۤۡۜۘۛۗ۠ۙۤ۫ۧۚۜۘۛۚۡۖۖۡۘ۟ۖۘ۫ۥۤۗۙۡۘۜۡۨۢۥۗۙۙۡ۠۫ۡۘۜۛۗۦ۫۫ۢۤۢۙۡۢ۬ۙۗۚۚۢۙۨۧۘۘۧۤۘۦۙۧ۬ۖۘۨۤۡۚۛۡۗۥۥ۠۟ۧۚۙۡۡۘۡۘۙۦۘۘۗۤ۟ۥۦۧۘۖۘۨۘۧۡۡۨۦۘ۫ۤۡ";
                                            break;
                                        case 2007707632:
                                            String str4 = "ۜۘۖۘۡ۟ۚۖۖۗۘۗۜ۠ۖۘۦ۠ۖۗۥۛۤۤۘۘۚۘۡۨۥ۬ۜ۫ۡۘۦۢۡۘۚ۬۫۟ۨۘۘۧ۫ۛۤۗۧ۫ۤۦۖۚۡۤۛۙۖۥ۟ۘۛۜۘۚۡۦۜۖۤۗ۫۬ۤ۠ۤۖۧۜۛۥۘۤۜۜۘۘۘۙ۬۫ۜۘۛ۠ۙۦ۫ۜۘۦۧۖۘۧۖۤ۫ۙۨۘ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-38535562)) {
                                                    case 90042783:
                                                        str3 = "ۗۥۜۥۧۥۘ۬ۖۡۜ۫ۚۡۨۨۨ۠ۤۦۙۨۘۦۛۜۥۚ۬ۘۗۦۘ۬ۤۦۘۤۗۤۜۙۡۘۡۙۜۘۨۘۛ۟ۦۨ۬۟۠ۧۜۨۦۘۘۚۤۤ۟ۙۘۘ۟ۡۨۘۛۦۡ۫ۙۨۘۧۜۜ۠ۡۘۧۤۢۦۢۖ۟ۢۦۘ۠ۨۦۘ۬ۥۜۘۥ۠ۡۨۖۤۧۢۢۦۧۜ۬ۧۗۡ۠ۛۨ۟ۦۙۨۥۘۢۗۥۘۨۛ۫ۜۙۡۢۛۛۥۘۨۚۦۦ";
                                                        break;
                                                    case 982717603:
                                                        String str5 = "ۘ۠ۦۘۧ۬ۥۜۚۡ۬ۚۗۗۚۜ۫۟ۖ۫ۧۡ۫ۛۛۥۙۙۨۘۤۗۡ۫۫ۚۖۙۜۥۜۖۘۨۤۚ۫ۧۨ۬ۤۥۙۨۗۥۨۖۘۢۧۡۖۙۨۘۧۘۨۘ۟۟ۡۘ۫ۢۨۘۨۜ۟ۢۡۧۘۧۗۡۢۨ۟ۦۤۢۛ۠۫ۖۤۖۨۡۤۥۘۦۘۙۖ۬ۧۙۖۘ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ 407266144) {
                                                                case -1490200276:
                                                                    str4 = "ۖ۬ۧۛ۬ۡۘ۟ۨۧۖ۟ۡۜۥۘۖ۬ۛۧ۫ۛۜۦۘۗۘۘۗۦ۫۠۟ۖۘۨۦۨۧۗۧۙۥۥۘ۬ۖۜۘۨۤۢۛۤ۬ۤۡۘ۠ۧۛۚۦۘۚۜ۠۟۟ۖۘۢۚۖۘۧ۠ۡۘۗۦۜۜۚۘۦۚۘۗ۟ۜۘۙۧۦۦۨۨ۟ۘۨۗۤۧ۬ۢۧۢ۬ۙۤۧۚۖۗۛۦۘۥۗۨ۬ۡۜۥۘۧۘۘۖۙۦۥۘۦ۬ۨۘۤۘۢۚۦۥۘ";
                                                                    break;
                                                                case -725432004:
                                                                    str4 = "ۦۤۗۙۚۛۘۢ۟۫ۛ۬۠۬ۡۚۗۤۚۖۧ۟ۨ۟ۥۤۦۘ۟ۤ۠ۢۡۦۘۨۡۛۜۙۛۚ۠ۧ۫ۙۖۖۗۡۦۚۡۗۙ۟ۛ۠ۚ۠ۜۥۦ۠ۦۡۘ۟ۚ۠ۚۙۨۘۦۚۢۙۧۘۛۖۚۛۚۘ۫۠ۡۘۘۖۘۙۚ۫ۚ۫ۦ۬ۜۧۥۛۘۘۡۖۚ";
                                                                    break;
                                                                case -128096022:
                                                                    String str6 = "ۗۘۖ۫۟ۨۛ۫ۢ۟ۥۘۘۥ۬ۖۨۙۦۘ۫ۡۢۡۢ۟ۖۜ۬۟۠ۥۡ۬ۥۨۜۘۛۡۘۘۗ۟ۤۗۜۨ۠۟ۥ۟ۢۧۜۥۧ۬۠۬ۧۨۚۦۨۧۘۢۤۘ۟ۥ۠۬ۦۨ۬ۖۘ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ (-1729507424)) {
                                                                            case -1546751395:
                                                                                str5 = "ۨۛۜۡۗ۫ۥۗ۠ۖ۟ۦۘۢۖۛۖۗ۟ۤ۫ۧ۠ۧۡۘۛۙۢۥۗۨۘۧۚۢۢۗۘۘۤۨۡۘ۬۫ۘۘۦۖۧۛۛۨۗۡۨۘ۫۬ۥ۠ۖۘۧۡۥۡۡۜ۫ۧۘۢۖۨۡ۬ۥۙۚ۫۠ۡ۬ۥۡۜ۟ۚ۫ۡۡۘۤۧ۠";
                                                                                break;
                                                                            case -754142022:
                                                                                str5 = "ۘۘۖۘۧۙۙۘۢۖۘۛ۟ۡ۟ۧۦۘۗۖۚ۠ۖۥۘۡۧۢۧۨۡۘۢۛۜۘۨ۟ۜۚۨۘ۬ۙۨۨۨۛ۟ۤۜۛ۠ۛ۫ۘۦۘۤۨۧۖۙۥۧۧۗۤۤۙ۬ۗ۟ۜۜ۠ۡۙ۟ۤۚ۬ۥۘۚۨ۫ۧ۠ۖۡۥ۠ۤۥۜۖۡۘ۟۟ۡۘۤ۬ۜۘۢۢۨۘ۟ۥ۫۬ۗۙۘۘۦۤۘۤۜۗۧۗۤۘۥۤۛۨۘۦۧۛۨ۬۫ۘۤۡۘ";
                                                                                break;
                                                                            case 645530750:
                                                                                str6 = "ۧ۟ۡۘۘ۟ۙۛۛۖۜۨۖۘۦۢۜ۬ۢۖۘۖۤۚ۠ۨۢۧ۠ۘۘۤۥ۠ۥۚ۠ۜۡۡۢۤۦۤ۟ۤۗۖۗۜۨۧۘۖۗۤ۬۠ۡۘ۠ۤۥۘۤۜۨۨ۠ۦۙۙۜۥۢۨۘ۠ۧۦۘۖۡۦۘ";
                                                                            case 1812127800:
                                                                                str6 = Build.VERSION.SDK_INT >= 33 ? "ۡۡۜۢۥۗۘ۠ۙۨۙۘۦۖۦۘۧ۠۫۫ۡ۫ۚۧۖۥۦۧۘ۠ۖۨۘۗۙۖۖۡۥۘۦۨۗ۬ۘ۫۠ۜۨ۫ۖ۬۬۬ۗۘۛ۠ۡۖۛۧۤ۬ۢۤۨۗۖۢۨۤۧۖۡۗۡۘۤۚۦۖۘۗۚ۫۫ۨۡۘۜۙ۠ۖۗۡۦۤۥۘۖۚۨۘۗۢۛۧۡۧۨۡۡۘۦۙۖۧۧۗ۬ۡۘۢۧۙۤ۬ۚۛۤۡۘۧ۟ۜۗۡۗۡ۟ۖۡۨۧ" : "ۥۨۜۛۦۧۘۨۖۗۡۖۥۘۘ۬ۘۘۤۛۙ۠ۨۗۚ۠ۛۨ۟ۡۘۨۤ۠ۡۛۘۦۢۢۧۗۜۤ۫ۜۘ۟ۨۜۘ۫ۨۗۗ۟۫ۨۨۤۡ۫ۛۢۡۙۤ۫۠ۘ۬ۧۛۦۘۙۗۘۘۤۤ۫ۥۢۡۘ۫۬ۘۘۨ۟ۗ۟ۢۘ۟ۤۦۘۢۤۡۘۛۨ۬ۨۢۜۘ۫ۚۖۛۖۗۢ۫ۡۘۢ۫ۖۖۙۦۚۘۡ۟ۗۢ";
                                                                        }
                                                                    }
                                                                    break;
                                                                case -113751794:
                                                                    str5 = "ۤۚۥۥۥۜ۠ۥۥۘۘۖۚۛۗۡۖۗۨۘۗۥۧۘۜ۟ۛۜۤۙۥۘۖۤۨۘۛۙۨۨۡۖۤۧۡۜ۫ۘۘۦۗۥۨۨۘۘۨۡۥۦۖۛ۬ۧۡۛۜۚۛۢۡ۠ۜۜۢ۠ۖۘۥ۠ۡ";
                                                            }
                                                        }
                                                        break;
                                                    case 2112176383:
                                                        str4 = "۠ۚۡۧۥۥ۬۠۬ۢۤۧ۟۟ۦۘ۫ۜۨۥۡۨۘ۟ۤۜۘۛۜۖۘۙ۫ۚۡۢۨۜۧۡۘۘۙۥۤۛۥۥۜۜۚۧ۫ۥۧۖۡۡۚۥ۟ۦ۟ۨۘۥ۠ۤۜۥۦۢ۬ۜۨۚۦۘۨۧ۟ۖۚۗۡۨۘۗۛ۠ۢ۫ۨ۬ۤۡۘۢ۫ۜۘ۫۠۫ۜ۬ۡۘۡ۫ۦۘۡۜۖۘۙۚ۬ۗۖۙۛۚۙۧۘۡۘۡۢۧ۬ۡۙ۫ۦۡۨۛ۫ۤۦۖۘۨۦ۠";
                                                    case 2136859785:
                                                        str3 = "ۢ۟ۦۜۚۨۤ۠ۧ۬ۘۤ۠۠ۥۤۚ۟۟ۜۜۧۨۨۘۨۛۡۤۧۜۘۢۙۛۨۨۨۘۖ۠ۨۘۗۜۦۡۨۧۘۡ۫ۜۘۡۢۨۚۦۡۖ۬ۤۡ۬ۘۙۖۚ۟ۡۦۖۢۥ۠۫ۚ۟ۖۥۘۤ۬ۥۙۘ۫۟ۖۧ۫ۨۥۘ۬ۧۚۛۤۘۘۢ۬ۜۗۨۥۘۧۦ۬ۘۦ۫ۦۡۥۤۘۘۥۚۡۘۚۨۘ۬۠ۨۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case -1448869613:
                                str2 = "ۦ۫۠ۛۦ۬ۥۡۙۜۥۧ۟ۤۘۘۜۤۘۘۘۧ۬ۧۡۦۤۥۧۘۗۘۦۘۧۖ۟ۥۥ۬ۚۨۡۦ۠ۡ۟ۨۡ۬ۢۥ۟ۘۡۘۚ۫۟ۛ۬ۦ۟ۦۖۘۙۚۢۚ۠ۙۖۡ۬ۨ۫ۜۗۧ۠۫۫ۙۨۤۘۤۤۘۜۤۖۘۛ۬ۧۘ۫ۡۥۡۗ۬۬ۤۜ۫۬ۖۖ۟ۛ۠ۖ۫ۧ۫ۚۙۜۨۧ۟ۢۨۘۘ";
                            case 696174330:
                                str = "ۚۨۜ۟ۖۘۚۦۙ۠ۢۥۘۗ۠ۚ۫ۘۙ۠ۤۢۦۡۜۦۘۨۚۨۘۛۥۗ۟۬ۦۘۜ۟ۥۘۚۜۙۡ۫ۡۤۦۛۧ۫۠ۚۨۗۥۙۚۛ۫ۜۘۚۖۡۨۧۤۗۜۥۘۛۙۨۘۚۗۢۖۧۢۗۙۙۨ۟ۡۤۢۘۘ۬ۥۙۦۘۖۤۧۤ۬ۚۦۘۨۤۥۘۢۨۖۖۗۘۜ۫ۥۘۤۧۦۜۡ۠ۤۗۨۘۖۨۤۤۧ۬ۖۥۦۘۖۨۘۖۡۘ";
                                continue;
                            case 1344168833:
                                str = "ۚ۟ۥۘ۫ۙۖۘۢۗۛ۫ۘ۠ۥۧ۟۬۟ۤ۠ۢۖ۫۬ۦ۠ۢۘۨۤ۫ۦۦۢۧۨۦۘۧۢۙ۬ۖۦ۬ۙۜۡۘ۫ۛۢۢۖ۟ۘۥۘۢۥۖۘۗۧۜۧۙۜۘۘۧۖۘ۟۟۫ۨۤۦۘ۬ۜۥۘۛۥۗۖۥۢۡۙۡۥۜۙۨۗ۫۟ۨۘ۠ۨۚ۫۬ۖۦۡ۬ۧۗۡۗۥۦ۫ۗۥۘۗ۬ۦۘۦۖۢۙ۬ۖۘۦۦۦۘۚ۫ۘۘ۬ۗۛۤۘۘ";
                                continue;
                        }
                    }
                    break;
                case 715926201:
                    z2 = true;
                    str = "ۨۧۙۘ۠ۖۘ۬ۚ۬ۚۛ۟ۛۡۙۥۖۖۨۢۖۤۖۖۡ۟ۚۖۖۚۦۡۜۘ۫ۢۖۘۜۘ۟ۗۦۖۖۢۧۙۘۖۤۨۢ۬ۢۙ۠ۘ۠ۙۙۖۘۛۜۨۘۗۙۗۙ۟ۘۘۡۨۢۗۘۧۨۘۘۡۗۧۛۨۚۘ۬۟ۤ۬ۡۘۥۘۙۖۤۛۜۤۧۡۛۤۜ۠ۜۘۚ۠۫ۦۥۘۙ۟ۖ۟ۥۘۡۤ۟۬ۢ۬ۢۚ۫۫۠ۖۘۖۤۦۛۦۖۘ";
                    break;
                case 2044497433:
                    str = "ۖۨۤۜ۬ۥۖۨۛۥۚۥۧ۬ۢۢۙ۬ۚۚۨۘ۫ۜۡ۫ۢۗۢۘۦۘۧۘۖۘۨۡۨۘۛۦۖۘۨۡۗۘۙۧۦۦۘۥۘۥۘۘ۠ۡۘۗۜۜۘۨ۠ۘۧۜۙ۫ۥۦ۬ۨۡۛ۬ۖۧۘۙۚۚۧۚۡۘۚ۬ۚۜۘۡۨۡۘ۫ۖۥۘۛ۫ۜۘ۟ۘ۟۟ۨۛۚۥۡۧۧۖۛۨۜۦ۟۫۬ۦۖۙ۠ۗۧۖۨۘۙۛۨۘۤ۠ۧۜۤۘۘۘۚۥ";
                    z = z2;
                    break;
            }
        }
    }

    public static boolean isA11below() {
        String str = "ۜۡۖۨۗۜۘۢ۠ۨ۬ۦۥۢۤۦۘۧۡۥ۟ۗۛۗۨۘۥۢۧۙۚۜۘۘۥۘۘۦۨۗۧ۠ۜۘۦۜۦۗۖۜۘۢۢۖ۬ۤۦ۫ۦۘۙۙۚۥ۬ۦۘۗۛۜۧۧۤۛۨۘ۫ۚۧۜ۠ۢۗۨۚۗۦۗۛۤ۫ۚۥۘ۫ۘۘۘۧ۟ۜۛۘۤۚ۠ۦ۟۠ۚۢۚۜۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 895) ^ 499) ^ 265) ^ 967) ^ 903) ^ 361) ^ 115) ^ 259) ^ 457) ^ 844) ^ 756) ^ 401) ^ 208) ^ 387) ^ 31) ^ 391) ^ 982) ^ 917) ^ 675) ^ 535) ^ 774) ^ 434) ^ 461) ^ 643) ^ 344) ^ 747) ^ 138) ^ 239) ^ 615) ^ 444) ^ 819) ^ (-1651653077)) {
                case -1858997641:
                    return false;
                case -1720092664:
                    String str2 = "ۥ۫ۧۘ۬ۜۘۨۜ۫ۗۨ۬۟ۤ۬۠ۢۛۦۢۧۤۙۗۗۘ۬۫ۧ۟ۦۘ۫ۗۦۘۖ۠ۜ۫ۤۜۧۡۘۘ۟۫ۧۙ۠ۢۢۤۘۘۗ۫ۤۡۚۥ۠ۡۧۘۡۜ۟ۨۘۧ۟۬ۦۘۙ۫۬";
                    while (true) {
                        switch (str2.hashCode() ^ (-95022873)) {
                            case -2129288192:
                                String str3 = "ۤ۠ۘۛۨۖۤۗ۫ۘۘ۟۬۟ۥۘۧۜۖۡۗۖۘ۠۬ۧۖۦ۬ۜ۟ۥۘۡۘ۫ۥۥۘۚۢ۠ۧۘۥۗۢۦۘۗۙ۠ۥ۬۫ۧۗۧۦۚۧۙ۫ۜۘ۟۟ۘۘۡ۟۫ۜۗ۫۠۠ۨۖ۠ۜۥۡ۫ۗ۬ۨۘ۠۟۬۠ۨۛۛ۫ۡۘۦۚۦۙۧۘۢۜۘۤۥۘۘ۫ۜۗ";
                                while (true) {
                                    switch (str3.hashCode() ^ 641454188) {
                                        case -1610601955:
                                            str2 = "۟۬ۡۘۗۧۘۘۛۦۚۢۡۧۘۦ۬ۗۥۧۙۢۧۚۘۗۖۘۜۥۜ۟ۘۢ۫۫۠۠ۚۢ۬ۨۨۗۗۢۧ۫ۧ۠ۧۗۚۢۨۘۢۗۚۖۧۨۘۧ۫ۡۘۖۡۦۚۚۘۘۙۚۙۜۡۜۘۦ۠ۥۘۖۗۗ۬۟ۡۘۧۙۛۚ۬ۛۧ۟ۨۘ۟ۗۢۜۢۦۘۦۜۗ۬ۛۥۦۤۜۚۡۥۘۥۜۥۘۡ۫۫ۖ۫ۥۘ۫ۛۡ۬ۡۖۘ۬ۦۙ۠ۦۘۧۤ۫ۡۙۡۘ";
                                            break;
                                        case -1357738820:
                                            str3 = "ۘۛۘۘ۠ۛۨۘۙۙ۠ۗۙۘۨۦۥۙۨۘۛۙ۠۟۠ۜۘۚۥۢۛۚۖ۫ۚۥۘۧۘۥۘ۬ۢۜۘۙۧۡۘۧۥۨۛۗ۟ۤ۟ۚۚ۟ۦۘ۟ۥۢۧۥۦۘۗۦۧۘ۫ۦ۫ۘۖ۫ۥ۟۫ۡۖۧۘۦۖۘۗۗۘۚۦۚۤۘۡۘۘۧۖۡۦۘۤۥ۫ۨۛۖ۠ۖۗۧۚ۬";
                                        case -738113071:
                                            str2 = "ۥۖۦۘۚ۟ۛۘۖۦۦ۫ۨۘ۟۟ۜۤ۠ۨۘ۬ۡۥۛۤۖۨۨۡۚ۫ۥۘۜ۟ۨۘۨۢۧۦۜ۬ۧۜ۟ۜ۬ۦۗۥ۫ۛ۬ۛۤۢۘۘ۬۬ۥۘۘ۫ۥۘۨۦۦۘۛ۬۫ۘۗۖۘ۟ۗۚۜۘۙ";
                                            break;
                                        case 1035705916:
                                            String str4 = "ۘ۟ۛۖ۠ۥۘۤۛۨۘ۟ۡۦۘۦۖ۠ۖۢۖۘۦۘۦۘۚۛۦۙۘۜۘۦۧۥۚۛ۟ۥۨۤ۟ۡۗۡۙۡۘۧۨۦۥۖ۫ۨۘۛۚۤۘ۬ۚۡۘۧۤۥۙ۫۫۠ۛ۫۬ۧ۫ۢۙۡۧ۠۫ۨۨۦۜ۬ۨۜ۬ۙ۠ۖۘۥۗۦۘ۫ۢۜۦۛ۟ۚ۟ۚ۠ۨۥ۟۠ۖۙۖۚۥۤ۟۫ۜۘ۟ۢۙۢۛ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 1252698289) {
                                                    case -741709706:
                                                        String str5 = "ۚ۠ۦۘۨۘۥۛۘۖۘۛۦ۬ۗۙۤۦۡ۬۫۟۫ۛۧ۫ۤۘۖۗۤۧۗۢ۟ۨۨۡۘ۠ۡۤۜۦ۫ۜۘۗۨۛۘ۫ۖ۟۬ۚۘۘۡۘۘۦۡۡۧۙ۠۟ۗۖۘۜ۬ۚۜ۬ۙۥ۠ۡ۠۫ۘۥۖ۟ۨ۬ۧۜۖۘ۟ۦۦۗۛۥۘۦۧۡۛۗ۫۟ۡۛۜۘۢۤۛۧۜۨۤۧۥۘۛۚۖۚۘۚ۟ۧۙۨ۫ۦۡۘۖۥۦۘۙۘ۟";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ 1557543020) {
                                                                case -1586614045:
                                                                    str4 = "ۡۘۗ۟ۨ۬۫ۨۚۘۛۨۢۡۤۛۜۜۙۨۦ۠ۛۦۤۢۨۘۦ۟۟ۙۡ۠ۛۤۨ۫ۤۢۨۥۥۘۨۙۨۗ۟ۛۚۚۨۨۖۨۙۜۖۘۜ۠ۥۥۖۧۘۜۙۡۨۦۘ۟ۜۨۜۛ۬";
                                                                    break;
                                                                case 34343426:
                                                                    String str6 = "ۥۥۨ۫ۘۛۗۖۘۘۖۢ۟ۛۚۗۢۤۥۘۛۖ۬ۧۛۢۡۜۥۥۡۨۤ۬ۜۘۥۤۤۨۥۚۥۜۤ۫ۡۘ۠۟۠ۧۛۘۘ۠۬۬ۤۢۥۘ۟ۥۙۖۥ۠ۚۜۥۜۦ۟ۤ۟ۦۧۧ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ 1727240106) {
                                                                            case -755316731:
                                                                                str6 = "۟ۗۖۖۦۛۡۗۜۘۙۚۡۢۦۖۘۢۦۤۧۥۨۘۨۨۨۤ۬ۤۘۛ۠ۜۗۙۤۤۜۡۧۦۙۧۘۡۗۥۡۖۨۘۥۗۚۧ۫ۦۖ۫ۥۘۘۜۧ۟ۢ۫ۘ۟۟ۡ۫۬ۥۥۦۘۡ۫۠ۨۛۧۖۨۘۡۢۚ۫ۙۥۛۧ۫";
                                                                            case -594660742:
                                                                                str6 = Build.VERSION.SDK_INT <= 30 ? "ۙۢۚۤۤۖۧ۫ۘۘۚۗۡ۠ۗۚ۟ۚۚۤ۬ۦۦۧۡ۬ۤ۬ۧۡۥۘۗۜۧۙۛۨۘ۟۠ۤۛۖۦۦۦۘ۬۠۟ۗۥۡۘۡۛ۟ۙۦۧۘۜۗۨۘۗ۠ۜۘۙۙۥۘۘۖۦۘۡۦۖۡ۬ۘۖۛۥۘ۬ۦۡۗۚۦۡۥۨۘۢۥۖۢۥۡ۠ۖۤۘۜۨۘۙۨۢۧۛۤۧۗۖۘ۠ۥۙ۫ۨۚۘۜۘۨۡۛ" : "۟ۙۖۙۧ۫ۢۨۛۨۧۖۗۦۨۨۛۤۖۘۜۖۙۥۖۙۢۦۜۘۘۘ۠ۢۙۧۨۛۨۦۚۡ۬ۙۛۢ۬ۧۧۚۢۥۜۧۘ۟ۗۜۘۡۢۧ۬ۙۖۘۚ۟ۖۘ۟ۦ۠۠ۢۙۘۥ۠ۖۡۢۙۙۦۦۖ۠۬ۘۗ۠ۛۛ۠ۥۨۛۦۘۖۤۙۤۚۗۛۡۧۗۛۥۗۢۖۘۙ۫ۘۤۘ۫ۘۨۘ";
                                                                            case -396165551:
                                                                                str5 = "۫ۛۦ۫ۧۜۘ۟ۖۘۘۜۖۘۘۖۨۜۧۚۨۙۗۨۘۡۧ۬۟ۥۤۢۧ۫ۦۘۖ۬ۢۜۜۖۨۦۢۘۜ۠۟ۧ۠ۤۜۜۘۦۡۡۘۨ۬ۨۘۙۛۜۘ۟ۡۦۘۚۨۨۘۘۗ۫۟ۦۖۘۙۢۧۥۡۡۙۡۙۚۙۖ۟ۨۖۢۛۜۘ";
                                                                                break;
                                                                            case 1741052236:
                                                                                str5 = "ۜۡۘۤۧۙۧۥۦۘۜۤۙۨۦۨۘۜ۬۬ۥۡۗۖ۠ۗۙۛ۫ۘ۫۬ۡۦۘۛۚۤ۬ۧۦۦۦۡۘۥۦۙ۟ۖۥۘۥۦ۠ۦ۬۠ۙۥۧ۠ۘۢۥۥۘۥۛۚۗۡۗۗ۟۬ۢۜۦۤۛۜۘ۫۫۠۫ۥۘۤۤۢ۟ۘۚۚۥ۟ۤۚۗۜ۟ۡۘۖۜۥۧۢ۫ۥۨۘۡۢۛۥۚۡۘۙۥۚۤۥۛ۟ۢۚۛۧۡۤۜۢۧۤۛ۠۠";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case 597591028:
                                                                    str4 = "۫ۛۜۦۗ۫ۧۖۦۘۙ۫ۧۗۗۤۚ۫ۖۗۛۡۖۧۖۜ۬۫۠ۥۖۧۛ۠ۡۜۘۘۗۗۥۢۙۗۖ۬۬ۨۢۥۢۥ۫۠ۙ۬ۚۥۖۥ۫ۙۤ۫ۚۛۡۦۖۜۧۘ۟ۛۨۧ۫ۥۘ۠ۜۥۡۘۘۘۘۡۜۧۜۡۜۖۗۛۨۧۘۥۜۘۘۚۦۖۘ۬ۙۙۤۢۜۧ۠ۦۧۢۗۡۢۖۗۦۘ۫۬۠";
                                                                    break;
                                                                case 1815475966:
                                                                    str5 = "ۦ۬۟۠ۤۗۙۡۜۘۥۚۗۧ۟ۥۘۡۢۘۘۧۦۘۖ۬ۦۘۦۖ۟ۨۤۘ۟ۗۡ۫ۙۜۤۥۦۘ۠ۧۛۤۤ۠ۡۧۦۢۡۧۘۡۢۜۘۦۡۥۖۢۗ۟ۖۘ۫ۢۤۧۚۦۘۜۢۨ۬ۛۖ۫ۜۧۜۗۖۘۛۤۜ۟۬ۡ۟ۘۚ";
                                                            }
                                                        }
                                                        break;
                                                    case -417585437:
                                                        str3 = "ۥۚۙۦۙۜۘۧۧۢۥ۠ۗ۟ۛۙۙ۫ۛ۫ۖۘ۫ۘۧۧۖۨۘۛۚۖ۫۫ۚ۬ۛۦ۟ۤۨۜۦۚۛۜۧۥۘ۫ۤۜۘۦۧۗ۠ۤۡۡۧ۠ۥۢۦۥۜۘ۟ۚۗۙۗۜۘۤۦۡۘۜۢۘۤۥ۫ۨۙۘۘۦۥ۟ۢۗۦۤ۟۫ۥۙۦۘۗۚۘۘۚ۟ۖۡۜۨۘۨۧۦۛۜۡۜ۬ۖۘۖ۠۠۫۟ۜ";
                                                        break;
                                                    case -134651256:
                                                        str4 = "۟۫ۖۛۨۢۧ۬۠ۛ۫ۖۘ۫ۖۗۢ۠ۗۡۤۦۧۛۤۥۢۘۘۗ۠ۡۤۘۙۧۡۙۡۦۨۚۙۧ۟ۜۡ۬ۛۡۘۜ۟ۢۤۧ۟ۧۢۦۘۥۧۡۘۨۧ۫ۢۧۤۡۖ۟ۘۢ۬ۖۘۨۙۤۥۘۨۛۖۧۥۢۤۤ۫ۨۚ";
                                                    case 1070314104:
                                                        str3 = "ۚۘۘ۬ۦۚۛۚۙۗۙۢۙۚۤۨ۬ۦۘۦ۠ۨۘۜۜۥ۫ۤۨۘۡۦۘ۠ۨ۠ۦۡۨۖ۠ۜ۫ۚۖۘۘۖۨۛۥۖۘۢ۬ۥ۠ۤۦۤۤۦۦ۠ۥۘۤۡۧۘۨۨ۫ۡ۟ۜۘۥ۫ۨۘ۠ۜۤ۠ۚۧۡۡۘ۟ۜۥۘۛ۟ۥۦۧۜ۫ۡۤۦۥۘۧۚ۠ۗۖ۬ۘۙۡ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case -1795597001:
                                str = "۬ۧۗۗۥۡۥۜۚۛۡۖ۠ۥۜۜۜۜۘۤۦۢ۟ۖ۫ۧۖۜۦۜ۫ۖۗۡۘۥ۫ۦۘۘۨۘۖۧ۫ۛۖۖۘۡۤۜۘۖۤۢۨ۫ۘۘۡۨۧۘۘۙ۟ۢۚ۫ۛۢۜ۫ۘۦۖۡۚۛۦ۬۟ۗۤۦۘ۟ۗۨۚۥۘۡۘ۠ۧۢ";
                                continue;
                            case -1423581417:
                                str = "۠ۚۥۜۙۘۘ۟۬ۦ۠ۨ۬ۜۨۡۘۚۧۧ۟ۨۜۘۧۗۦۘۧۦۢ۟۬ۥۤۘ۬ۖۡۜۘۘۤۗۜۤۨۘۚ۬ۢۨۧۗۛۡۡۘۧۥۛۛ۬ۤۢ۟ۦۨۛۛۙۨۥۘۨ۟۬ۙۥۧۖۢۥ۟ۙۙۨۦۧ۟ۜۘۨۡۧۘ۫ۙۖۘ";
                                continue;
                            case 865565633:
                                str2 = "ۚۧۘۤۥۥۘۤۙۙۛۖۧۘۨۨۘۘۦ۫۟ۙۤۙۧۘۡۚۧ۬۟ۙۡۡۢۨۘ۟ۘۦۥۖۗۧۛۘ۟ۙۧۖۚ۟ۙۥۗۧ۠ۗۢ۬ۤۜۧۢۛۤۛۘۦ۠۫ۛۨۢۛۙۖۖۙۙۦۤۙۙۚۘۖۗۨۙۨۤۥۙۜۚۨۥۡۤۜۢۦ۫ۤۗۢ۫";
                        }
                    }
                    break;
                case 1525678389:
                    return true;
            }
        }
    }

    public static boolean isA12above() {
        String str = "۫۫ۦۨۤۢۜۗۥۘ۫ۦۨۘۖۘۘۤۛۜۛۧۥۘۢ۟۟ۜۜۖۘۜۧۛۡ۫ۖۘ۠۫ۨۘۖ۟۟ۢۗۘۚ۠ۨۘۤۨۖۗۦۨۧۛ۫۟ۤ۫ۗۜۧۗۧۨۘۜۙۥۚ۬ۘۘ۫ۖ۬ۘۤۡۘۡۤ۬ۙۥۘۘۘ۟ۜۘ۠ۙۜۘۜ۠ۘۤۘ۬ۡۦۧۘ۠ۤۚۛ۠ۛ۬ۘۛ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 55) ^ 151) ^ 772) ^ 171) ^ 160) ^ 985) ^ 488) ^ 178) ^ 918) ^ 160) ^ 637) ^ 940) ^ 811) ^ 688) ^ 980) ^ 793) ^ 813) ^ 778) ^ 124) ^ 484) ^ 144) ^ 286) ^ 474) ^ 663) ^ 919) ^ 893) ^ 171) ^ 859) ^ 795) ^ 215) ^ 869) ^ 1276381694) {
                case -1923124782:
                    return true;
                case 1521017196:
                    return false;
                case 1546679629:
                    String str2 = "ۙۘۤۦۚ۬ۡۙۘۘۙۚۚۥۧۢۚۡۜۢۦ۬ۡ۠ۤۤ۟ۙۨۤۡ۬ۨۥۜۡ۟ۢۤۘۙ۫ۛۧۥۦۗۡۧۖ۬ۢۤۛۜۙ۟ۘۘۘ۠ۨۦۦۡۢ۟ۥۘۦ۠ۗۚۦۧۘۛۚۖۘۗۧۤۗۗۤۗۦۦ۫ۜۜۘۥ۫ۙۧۜ۫ۧ۬ۨۘ۠ۢۖۤۤۜۘ۫ۨۖۜۦۥۗۚۡ۬ۘۡ۬ۖۧۘ۫ۙۨۘ";
                    while (true) {
                        switch (str2.hashCode() ^ 946315726) {
                            case -425681026:
                                str = "ۢۡۚۙۡۘ۠۫ۨۘۙۨۘۗۧۜۤۚۖۘ۟ۙۚۜۖۙۧۙۨۘۘۙۘۖ۠۫ۡ۫ۖۘۘۤۜۘۗ۫ۖۘۗۥۜۘۗۛۨۘۥۢۖۘۦۨۚ۠ۥ۫ۢۨۙۙۙۙۖ۟ۖ۬۟ۘۙۚ۟۬ۦۘۡۢۖۘۚ۫۬ۗۗۘۧ۬ۤۥۘۡۘ";
                                continue;
                            case -310867924:
                                str2 = "ۥۨۧۜۛۘۛ۟ۦۘۛۜۧۧۢۡۘۤۧ۫ۚ۟ۥۘۚۗۗۦۖۚۗۤۘۖ۟ۤۧۙۦ۟ۖۦۜۦۧۘۗۨۥ۬۬ۙۘۚ۫ۚۤۥۡۨۤۥۖۘۥۘ۠ۧۢ۬ۖۚۦۘۗۜۚ۬ۦ۟ۤۢۥۜۘۨۘۜۥۦۜۛۧۧۨۖ۠۫ۨۘۦۛۡ۠۫۠۬ۘۢ۫۟ۘۥ۠۟ۦ۬۬ۛۖۗۜ۟ۤۦۘۧ۠ۗۧۗۘۘۘ۠ۡۙۢۡۘ";
                            case 1729863279:
                                String str3 = "۬ۡۜۘۢۗۡۦ۟ۤ۫ۦۢۨۢۡۘ۠۫ۗۥ۟ۗۛۚۦۘۦ۬ۨۘۘۢۘۘۛۡۙۦ۫ۘ۬ۗۘۧ۬ۚ۫ۢۘۤۧۨۘۧۖۥ۫۟۬۠۟۫۟ۘۗۜۖۖۘۡۧۨۘ۟ۨۙۗۛۘۘۖۚ۠۠ۛۜ۬ۘۘۖۧ۬۬ۚۙۢۚۖۘۤۘۖۘۤۘۘۚۖۨۘۡۤۨۘۡۢۦ۫ۥۨۘۜۡ۬۟ۢۦۘ۠ۨۢۥۨۤۨۤۡۛۜۡۨ۬ۧۦ۠ۡۧ۠ۦۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-279861730)) {
                                        case -1484609699:
                                            str2 = "۫ۧۨۘۖۤۡۘ۬ۗۘۘۢۖۨ۟ۘۥ۬۠ۤۢ۠ۜۘ۬ۧۨۚۛۨۘ۬ۧۜۘۛ۫۬ۦ۟ۘ۫ۛۡۘۚۥۙۦۗۥۙ۠۫ۛۖۗۚ۟ۦۗۙۘۘ۟ۤۢۧۡۧۘۦۨۛ۠۬ۙۚ۟۫۠ۢ۬۫ۖۖۘۛۜ۟۬ۡ۠ۙ۫ۚۙۘۜۧۚۨۧۧ۫ۗۖۨۘۦۨۦۘۘ۬ۘۘۛۧۦۧۚۛۜۨۨ۠ۧۜۘۚۦۥۘ";
                                            break;
                                        case 1884221464:
                                            String str4 = "ۧۘۨۘۘۡۚۦۜۚۜ۫ۤ۠۬ۥۘ۠۠۬ۜۦۢۛ۫ۡۘۜۗۚۨۘۡۘۧۖۖۘۢۛۦۦۛۜ۟ۧۤۡۦۜۢ۫ۧۤۦ۠ۜ۠ۖۘۤۙۗ۫ۥۤۧۦۘۚۚۗ۬ۗۡۨ۠ۘۤۨ۟ۦ۟۫ۖۥ۟ۚۢۡ۫ۚ۬ۧۦۘۘۚ۠ۦۘۘۗۚ۠ۧۙۙۘۨۘ۫۠ۖۚۛۜۤ۫ۜۘۨۨۨۛۗۤۢۘۧۘۗ۫ۥۙ۠ۡۘۚۛۙۢۚۚۧۘۥ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 1474074173) {
                                                    case -2135818729:
                                                        String str5 = "ۜۙۖۘۨ۬ۢۧ۫ۥۘ۟ۚۗۗۜۧۘۧۤۛۗ۠ۦۘۗۛۡ۟ۨۖۘ۟۟ۦۘ۫۟ۗۜۧۚ۟ۚ۬۬ۤۘ۫ۚۚۘۚۜۛۥۧۘۧ۠۟ۢۨۦۘ۬ۧۘۦۡۘۗۨۘۘ۠ۡۖۘۨۥۘۘۛۙ۬";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ (-1890773093)) {
                                                                case 287552514:
                                                                    str4 = "ۖ۟ۜۘۥۡۘۦۚۖۘۦۙۨۘۥۛۦۘۤۜۧۘۛۥۜۘۗ۬ۚۙۢ۬۫ۦۙ۫ۘ۠ۧۛ۟ۧۖۘ۠ۖۜۘۨ۬ۜۘۧۡۤۛ۫ۥۘۥۡۨۡۨۧۘۖۖۚۛۧۙۛۙۙۨۦۨ۬ۜۥۘۨۜۧۘۥۨۡۘۧۛۛۖۨۦ۠ۦۡۘۡۤۗۜۘۧۧۨۜۘۛۦۧ۬ۤۡۘ۬۟ۨ";
                                                                    break;
                                                                case 580168097:
                                                                    str4 = "ۥۢۤۖۡۦۘ۠ۢ۠ۖۛ۠ۗ۬ۦۘ۬ۤۢۛۧۥۘۙۚۢۢ۫ۛۗۘۡ۬ۖۘ۫ۛ۬ۚۚۚۚۢۚۘ۟ۢۦ۠ۙ۫ۙۡ۫ۦۚۤۖۙ۬۠۫ۙۗۦۖۡۧۘ۟۫ۗۨۗۥۘ۟ۜۚۙۨۘۘۗۘ۬ۨ۬ۘۘۙۜۗۧۥ۟ۖۦ۬ۖ۟ۡۥۛۛ۟ۡۘۖۖۨۘ";
                                                                    break;
                                                                case 749077868:
                                                                    str5 = "۟ۥۗۚ۟ۗۤۜۘۙۡۦۖۘۥ۠ۘۜۧۗۜۘۘۗۙۖۗۨۘۦۦۛۘۚۨۘۢۨۨۘۙ۬۬ۨۛۗۗۛۨۘ۠۟ۢۘۙۜۧۨ۟۟ۨۥۘۢۙۧۦۥۥۘۥۧۘۨۛۦۢۘۧ۟ۧ";
                                                                case 1000724346:
                                                                    String str6 = "ۧۚۡۤ۟ۢۖۛۥۘۚ۠ۛۗۧۥۘۡۦۛۨۡۧۗۛۢۛۖۤۡۢ۟ۛۨۖۢۦ۟ۙۛۖۡۖۘۛۘۡۘۚۗۨ۫۫۫ۥ۟۬ۗۤۨۘۤ۟۫۠ۜۥۦۢ۠ۙۨۦۘ۬۟ۧۨۦ۫۠۬۬۟ۢۙۥۤۨۖۥۦۘۤۖۗۙۨۥۡۘۢۡۜۘۡۚۗ۫ۜۚ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ (-475425959)) {
                                                                            case -1055663992:
                                                                                str5 = "ۢۚ۫ۢۢۧۡۛۤۙ۠ۜۘۤۡۜ۫ۚۦۘۜ۟ۧۖۛۢۢۦۛۖۛ۠ۚۥۚ۬ۦۚۚۦۥۘۧۜۖۤۚۜۘۘۗۡۘۜۙ۠۟ۚۨۙ۟ۖۘ۟ۨۜ۠ۜ۠۬۟ۦۘۥۙ۫۫ۨ۬ۜۡۘ۟۠۬۠ۚۥۘۧۦۙ۫ۨۜۘۜ۠ۘۖۚۧۗۛۛۢۖۘ۟ۗۨۚۖۘ۬ۤۥ۟ۜۤ۫ۛۖۘۘ۠ۢۤۧۘۘۦۤۗۘۗۦۛۜۡۘۖۢۖۦۜۡ";
                                                                                break;
                                                                            case -255601706:
                                                                                str5 = "ۦۜۦۘۚۛۙ۟ۡۖ۫ۨ۬ۙ۬ۜۘ۠ۜۚ۟ۗۡۘۧۗۛ۟ۘۡۜ۬ۚ۫ۤ۟ۤۦۚۛ۬ۖۚۛۜۘۛۡۢ۟ۨۘۥۚۘۗۦۘۢۗۡۘ۠ۢ۠ۗ۫ۧۛۖۜ۟ۖۖۘ۬۟ۜ۫ۚۦۘ۬ۛۜۘۘۘۧۘۨۨۘۘۜۖۥۘۥۦ۬ۤۖۙۗ۠ۖۘۜۙۦۦۢۖۜ۬ۨۘۡۛۡۘۙۦ۫ۛۖۘۘۜ۠ۛ۬ۖ";
                                                                                break;
                                                                            case 203135322:
                                                                                str6 = Build.VERSION.SDK_INT >= 31 ? "ۤۖۙۙۙۤۜۛۦۘۙۦۧۘۗۤۥۤۨۡ۬ۚ۫ۛ۟ۡۨ۫ۥۘ۫۠ۜۘۤۗۚۚۦۥۛۤۥۘ۟ۛۦۘۡۤ۟ۗۥۘۘ۫۫۫ۚۥۢۜۜۙۨۧۦۨ۬ۦۛۖۖۘ۟ۖ۫۠ۤۘۦ۬ۥۘ۫۫ۖۘۤۖ۫۬۬ۤۡۘۨۗۛۦۚۥۨۘۗۧۙۛۧۛۚ۬ۦ۬۫ۨۘۤ۫ۜۘۚۘۨ۬۠ۧۧۗۡۘۜ۠ۨ" : "ۛۜۨۘۗۢ۬ۘۢۨۘۤۦۖۙ۫ۙۥۘۘۢۗۨۘۚ۫ۥۘۧۛۦۨۚۧۨۦۘۨۢۙ۫ۦۘ۬ۢۥۘۤۨۨۗۢ۬۬۫۠ۚ۬ۜۘۛۖۚ۫ۗۖۘۧ۟ۡۖۤۡۚۚۢۛۘۘۗۙۖۘ";
                                                                            case 2146244652:
                                                                                str6 = "ۙۧۚۛۨ۫ۨۘۥۘۛۡۦۘ۟ۧ۠ۥ۟۟ۚۢ۟۬ۤۨۘۡۘۖۘۛۙۦۛۛۜۛ۫ۨۛۡۧۘۗ۫ۨۚۧ۫ۚۨ۬ۢۦۧۤ۠ۛۧ۫ۨۘۧۢۦۡۤۘۘ۠ۨۨۘۤۧۧۢۨۨۘۖۤۜۘۘۡۘ۫ۙۥۤ۟ۜۘ۫ۛۨۗۘ۠ۢۘۙۡۖۦۘ۠ۛۘۛۥۖۘۖۤۗ۫ۜۘ۠ۥ۟ۧۦۨۘۙۤۘۧۚۚۡ۠۟ۛۙۗۙۘۧۖۡۘ۟ۚۥ";
                                                                        }
                                                                    }
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case -1223242665:
                                                        str3 = "۫۫ۦۢۤ۠ۤۧۤ۫ۢۚۜۥۘۥ۫ۚۨۨۖۘۤۚۘۥۖۙ۬۠ۢۗ۟ۧ۟ۜۜۘۨۥۗ۬ۥۜۘۚۨۧۙۨۥۗ۟۫۫ۧۖ۬ۛۛۗ۫ۘۤۜۦۛۛۚۤۦۥۧۚۥۘۧۘۧ";
                                                        break;
                                                    case -1012521504:
                                                        str3 = "۟۟ۜۥۙ۬۠۟۬۬۠ۜ۠ۖۘۨۙۜۘۧۙۜۘۨۡۗ۠۫ۜۛۤۡۢۥۜۘۧۘۖۘۨۘۦۘۜۙۘۘ۫ۛ۫ۧۨۧۛۗۧ۠۠۬ۗۡۦ۫ۘۜۦ۬ۥۘۘۢ۠ۚۡۖۘ۬ۢۡۘۛۥۥۢ۫ۥۥۚ۠ۚۨۨۘۧۥۨۥ۟۫ۚۜۧۘۙ۫ۗۘۜۜۘۥۚۜ۬ۛۖۘۥۜۧۖۢۢ۠ۦۖۘ۬ۖۚۜ۠ۜۘ";
                                                        break;
                                                    case -816369392:
                                                        str4 = "۟ۧۘۡۧۦۘۚۥۨۘۖۛۡۘ۫ۤۛۨۛۡۘۡۥۧۘۘۢۛۦۘۙۛۜۤۙۜۤۗ۫ۧۨۦۧۗۤۘۖۦۘۙ۟ۘۘۢۙۙۜۛۚۛۢۡۖۢۡۛ۠ۨۘۛۙۤۧۨۢۗۡۘۘ";
                                                }
                                            }
                                            break;
                                        case 2025573103:
                                            str3 = "ۖۢ۫ۢۥ۬ۦۥ۫ۛۦۢۖۦۚۗۘ۠ۦۘ۬۬ۨ۟ۜۥۧۘ۟ۙۥۖ۟ۥۦۡۦۘۡ۟ۚۗۖۡ۠ۗ۟ۤۨۘۧۖۛۡۗۖۘۡۖۡ۫ۖۘۘۥ۬۠ۗ۬ۘ۫ۘۢۜۤۛۙۜۨۘ";
                                        case 2087629877:
                                            str2 = "ۦۢۛۙۧۨۘۘ۬ۤۦ۫ۡۘۥۖ۟ۜۙۙۗ۫ۦۙۦۥۘۛۖۥ۠ۜۖ۬ۜۘۨۗ۟ۧۥۢۘۜۜۘۛۧۡ۫ۙۨۖۥۘۡۖۘۘۗۗۙۧۜۦۧ۠ۡۘ۠ۢ۫ۗۢۗۖۖ۠۫ۚ";
                                            break;
                                    }
                                }
                                break;
                            case 2016649551:
                                str = "ۢ۬۟ۜ۟ۥۨ۬ۜ۟ۥۘ۫ۘۜۘۧۛۘۘ۟۠ۡۢۖۜۡ۟ۙۖۜۘۘۢ۬ۨۘۜۥ۠ۘۘۧۘۥۨۨۘ۠ۤۡۚۥۡۧۥۧۘۘ۠ۥۜۦ۫۟ۛ۠۟ۖۨۦۚۜۘۜ۟ۛۨۤۛۚ";
                                continue;
                        }
                    }
                    break;
            }
        }
    }
}
