package kentos.loader.utils;

import android.util.Log;
import androidx.core.view.InputDeviceCompat;
import androidx.core.view.PointerIconCompat;
import androidx.recyclerview.widget.ItemTouchHelper;
import com.google.android.material.card.MaterialCardViewHelper;
import kentos.loader.BuildConfig;
/* loaded from: classes2.dex */
public class FLog {
    public static final String TAG;

    static {
        String str = "ۙ۠ۡۦۙۜۛۡۗۙۙ۠ۥۜۜۢۤۨۙۙۘ۬ۚۖۨۥۧۘۥۘۚۗۥۦۚۥۘۡۥ۠ۥۨۡۘۨۜ۫ۛۡۦۘ۟ۖۨۘۛۜۤ۟ۚ۠ۖۨۤۚۘۥۧۜۦۚۨۤۗۚۦۢۜۘۥۙۥۘۦۙۡۛۘۡۘۘۥۥ۬ۛۖۘۘۤ۫ۨۗۦ۠ۚۤۤ۟۫ۙ۫";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 777) ^ 504) ^ 950) ^ InputDeviceCompat.SOURCE_DPAD) ^ 471) ^ 340) ^ 545) ^ 369) ^ InputDeviceCompat.SOURCE_DPAD) ^ 782) ^ 721) ^ 518) ^ 559) ^ 638) ^ 392) ^ 281) ^ 737) ^ 34) ^ 767) ^ 669) ^ 752) ^ 318) ^ 109) ^ 87) ^ 771) ^ 533) ^ 683) ^ 342) ^ 667) ^ 252) ^ 124) ^ 999520283) {
                case -2032992825:
                    TAG = FLog.class.getSimpleName();
                    str = "ۚۧۙۙ۫ۗۢۙۨ۬ۡۛۨۚۡۘ۠ۨۥۗ۟ۙۤۗۤۗۦۨۨۘۘۖۢۨۘۢۤۘۘۘۖ۠۫۟ۢ۫۫۫ۚۗۘۤ۟ۚ۟ۨۨۘۧۥۡۘ۫ۧۖۛۚۦۘۙ۠ۦۘۛۗۥ۠ۗۙۖۡۘۢ۫ۘۛۖۡۘ۟ۢۘۛۨۜۘۘ۟ۛۘۦۥۘۦۡۘۘۖ۠ۡۙ۠ۛۛۨۖ";
                    break;
                case 50949908:
                    return;
            }
        }
    }

    public static void debug(String str) {
        String str2 = "ۦۙۥۚۜۘۘۡۡۧۥۖۘۚ۠ۘۘۢۢۖۙۡۛۨۚۤۙۚ۬ۦ۠ۚۧۧۢۤۥۙۥۢۗۢۜۗۙۦۖ۫ۤۚۤۗۜۦۢۥۘۖۨۛ۫۠ۘۦ۠ۖ۟ۙۦۙۖ۬ۚ۟ۤۤ۫";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 430) ^ 795) ^ 678) ^ 116) ^ 201) ^ 209) ^ 438) ^ 843) ^ 829) ^ 547) ^ 416) ^ 770) ^ 139) ^ 288) ^ 544) ^ 204) ^ 466) ^ 961) ^ ItemTouchHelper.Callback.DEFAULT_SWIPE_ANIMATION_DURATION) ^ 348) ^ 869) ^ 468) ^ 280) ^ 100) ^ 816) ^ 986) ^ 136) ^ 332) ^ 548) ^ 666) ^ 423) ^ (-1340383059)) {
                case -560290422:
                    String str3 = "ۧ۫ۜۘۨۗ۠ۙ۟ۢ۫۟ۥۘ۬ۗۘۘۨۘۡۘۚ۫ۤۡۛۘۘۙۙۧۖۧۡ۟ۛۥۘۖۜۨۖۙۜۗۘۧۚۖۘۤ۫ۘۗۛۡۤۡۛۧ۟ۘۧۘۤۚۛۡ۠۟۟ۛۖۘۧۧۙۜۛۛ";
                    while (true) {
                        switch (str3.hashCode() ^ 1246110166) {
                            case 404261920:
                                str3 = "ۨ۬ۥۘۚۚۥۘ۠ۗۛ۬۟ۗۜۛۤۗۜۡۙۦۚۛۥۗۚۥۖۥۢۨۘۢۘۘۘ۬ۜۥۘۘ۬ۥۙۥۘ۬۫ۘۘۛۢۘۛۘ۠ۘۥۤۧۤۛۖۡۘۘۖۤۥۘۧۜۗ۫۟ۡ۬۟ۨۘۛۖۚ";
                            case 430835679:
                                str2 = "ۥۧۨۦ۠۬۟۫ۘۚۢ۠۠ۖۥۗۚۦۘ۫۠۠۬ۘۜ۟ۚۢۧ۟ۨۤۤ۟۠۟۫ۜۦۜۨۛۜۜۦۨۘۘ۟ۛ۟ۥ۫ۛۨۖۘۛۢۡۘۗۨ۬ۚۧۡۤۘۦ۬ۥۤۥۖۖۘۧ";
                                continue;
                            case 553228916:
                                str2 = "ۘۚ۠۬ۥۚۘۗۘۙ۟۠ۨۨۖۨ۟۬ۧۖۚۗ۠ۨۘۨ۬ۧۘۘۘۘ۠۫ۖ۠ۚۦۨۨ۠ۧۘۘۦۜ۟ۢۧ۟ۥۜۤۜۗ۫ۤۢۢ۬ۛۜۦۢ۠ۘۜۧ۟ۥ۟ۦۦۜۘۡ";
                                continue;
                            case 1334012991:
                                String str4 = "ۚۢۖ۟ۜۦۘ۠ۗۥۖۗ۟ۙۖۘۨۧۦ۬ۛۛ۠ۖۦۘۗۚۡۡۜۛۥۧۨۘۗۖۡۘۜۗۥۤۜۦۖۡۜۘۢ۬۟ۖ۬ۨۥۤۨۘۜۧۘ۠۟ۡۤۚۙۡۖۘۡۨ۬ۘۜۖۚۧۜۘ";
                                while (true) {
                                    switch (str4.hashCode() ^ (-1865015457)) {
                                        case -1925302086:
                                            str3 = "ۧۗۧ۬ۚۢ۫ۤۚۦۦۥۘۧۨۥۘ۬ۦۖۘۖۛۘۘۦۙۜۘ۬ۦۛۗ۠ۡۘۛۢ۬ۦۡۖۘۨۦۗۙۙ۠ۧ۬ۥۖۘۙۗۛۙۢۦ۫ۘۨۗ۬ۗۧۧۛۨۘۨۘۚۙۦۢۢۤۘ۫ۛۜ۫ۚ۠۫ۥ۬ۦۘۦۛۚۜۨ۠۬ۦۢۜۖ۠ۘۖۘۗ۠ۙۢۥۡۘ";
                                            break;
                                        case -1106805475:
                                            str4 = "ۚۜۡۘۘۖۥۘۘ۫ۢ۫ۧۛ۫ۛ۬ۚۧۧۘ۫ۧۦۧۥۖۡۧۘۤۛۚۨۗۥۘۦۥۜۘۙۨۘ۟۬۟ۨۛۖۘ۬ۥۨۗۥۖۦۢۖۢ۫ۚۗۧۦۘۦۥۜۜۙۜۦ۠ۖ۟ۨ۫ۥۗۨۘۛۖ۠ۦۤۧ۫ۦۛۨۜ۟ۙ۠ۡۘۜ۫ۖۘ۬۬ۖ۬ۡۘۨۚۥۘ۫ۘۘ";
                                        case 905686488:
                                            String str5 = "ۥۡۘ۫ۥ۟ۥ۟ۤۢۤۨۘۙۨۙۦۖۖۘ۟ۢ۟ۛ۫ۜۘۧۦۘۘۜ۬ۡۛۡۚۦۗۡۘۥۛ۠ۥۨۖۗ۟۠ۥ۬ۥۘۖ۟ۗۘۨۚۗۢ۟ۦۤۨۖۤۧۦۗ۠ۜ۫ۤۤۡۖۡۙۘۘۛۗۨ۠ۤۖۘۚۢ۫ۜۛۖۡۘ۟";
                                            while (true) {
                                                switch (str5.hashCode() ^ (-174040377)) {
                                                    case -908661872:
                                                        str5 = "۬۬ۗۧۜۥۘۡۤۗ۠ۥۖۖۙۡۖۨۘۦۨۙۢۛۨۚ۠ۢۤۖۢۘۖۘ۟ۖۖۘۧۚۗۛۥۥۢۛۢ۠۫ۗ۬ۖۛ۫۠ۡۗ۠ۜ۟ۙۧ۠۟ۡۦ۠۠ۖۖۘۘۦۖۙۚۥۥۘۧۗۨۘۨۧۦۛۛۖۖۗۜۜۡۨۘۖۘۘۘۙ۟ۖۘۡ۫ۘۘۦۖۧ";
                                                    case 491816884:
                                                        str4 = "ۧۚۙۦۜۧ۬ۧ۠ۡۖۡۘۗۢۥۘۧۗۗۗۦۦۡۦۘۖۚۙۜۡۡ۫ۡۗۢۦۢۘۤۦۘۡۗ۬ۗۚ۠۠ۧ۠۟ۘۦۘۥ۟۬ۗۥ۫ۛۜ۟ۜۘۦۖۦۘۜ۟۟۫ۧۘ۫ۨۡۢۡۤۜۥ۟ۨۚۨ۟ۜۦۘ۟ۙۜۙۦۖۘۤ۟ۤۚۙۘۙۙۡۘۨۨۤ۠۫ۛۧۥۖۙۗۖۘۗۨۦۘۗ۟ۦ";
                                                        break;
                                                    case 1649692590:
                                                        str4 = "ۡۥۨۘۚۘ۬ۗ۟ۦۘۚۗ۫ۨۜۥۘۤۡۘۘۖۜۖۙ۬ۗۦۤۤۤۚۖۖۛۨۘۤۜۥۘۜۡۗۜۧۥۡۨۗۦۘۙۨۢۡۘۖۚۦۘ۫ۡۖۘۢ۠ۚۚۘۧۤۨۨۘۡۡۗۥۡۘ۬۬۟ۛ۠۬ۦۗۛ۠ۦۛۤۦ۬ۤۨۤ";
                                                        break;
                                                    case 2035717569:
                                                        String str6 = "ۙۦۜۛۧۧ۬ۖۛۥۛ۠ۗ۠ۢ۠ۜۢۥۛۧ۠ۢۙۚۥۦۧ۬ۡۢۗۖۦۜۜ۟ۜۗۤ۫ۤۤۥۜۚۛ۠۫ۙۘۚۧۦ۫ۚۘۘۤۖۡۘۧۜۨۘۜۘۧۡۦۨۢ۠ۥۥۥۘۘ";
                                                        while (true) {
                                                            switch (str6.hashCode() ^ 459978954) {
                                                                case -1451680492:
                                                                    str5 = "ۜ۫ۤۘۖۦۘۙۖۗۨۡۜ۫ۚۖۖۦۥۥۦۢ۫ۗۛۗۧۖۘ۫ۖۢۡۡۚ۟۫ۘۘ۫ۗ۟ۢۛۘ۫ۤۛۨۛۨۘۧۖ۠۠ۗۥۘ۫ۛۧ۠ۧۥۘۦۜۘ۠ۨۘۤ۠ۚۛۡ۬ۥۡ۟";
                                                                    break;
                                                                case -415214315:
                                                                    str6 = "ۛ۫ۗۙۦۖۖۥۘۜ۫ۤۖۛۨۘۥۜۤۙۡ۠۟ۚۢۜ۬۟ۜۜۗ۫۠ۘۗۗۛۨۛۜ۫ۚ۬ۖۛ۟ۗۙۜۘ۟ۗۨۙ۬۠ۘۜ۟ۗۥۧۘۦۥۥ۬ۜ۟ۗۨۢ۠ۧۘۘۜۜۖۧۥۡ۠ۚۧۛۦۘۢ۟ۘۜۛ۫ۤ۬ۙۛۜۡۘۧۥۤۧۡۚۨ۫۬ۢ۬ۜۛۦۡۘۧۥ۬ۨۥۜۘۨ۫ۡۘۡۜ۬۬ۤۡۖۤۙۛۨ۬ۤۚ";
                                                                case 843583738:
                                                                    str5 = "ۘۥۜۘۤۧۜ۫۬۬ۦۘۚۘۢ۬ۥۧۥۘۡۛۢۥۥۛۤۛۨۘۛ۠۫ۙۖ۟ۥ۬ۥۘ۟ۢۘۘۢۛۖۤۧ۫ۦۧ۟۟ۜۛۢۤۙۗۡۖۜۦۖۗ۫ۧۡۛۜۨۡۥۘۗ۬ۥۢۨۥۙ۫۬ۧۛۥۨۙۨ۫ۜۘۘۘ۫ۢ";
                                                                    break;
                                                                case 1851737172:
                                                                    String str7 = "۬ۖۨۘۦۛۥۘۚۤۡۘۢ۫ۡۘۚۢۨۘۚۗۛۖۦۦۦۦۨۢۦۖۘۘۘۧۘۨۙۘۘۤ۬ۘۘۗ۠ۧۨۡۘ۬ۦۢۙۥۘۤ۫ۢۧ۟ۢۗۥۙۥۜ۠۬ۚۤۗۛۡۖۧۖۜۗۧۗۢۢۚۘۘۥۡۘۥۢۖۢۥۗۙ۫ۘۤ۬ۘ۫ۨ۠ۘۥۧۘ۠ۡۖ۬ۨۥۦۢ۫۟ۖۗ۫ۥۨۘۛ۟ۥۘۛۧۡۘ";
                                                                    while (true) {
                                                                        switch (str7.hashCode() ^ (-649230815)) {
                                                                            case -51437808:
                                                                                str7 = !BuildConfig.DEBUG ? "۬ۥۗۦ۠ۗۘۖۘۜ۬ۖۜۧۥ۫ۜ۫ۦۚۢۦۜۡۘۨ۟ۡۗ۬ۖۘۧۥۖ۬ۧۚۙۜۨۘۖۤۡۜۥۨۜۘۜۘۗ۫ۖۖ۟ۦۚۦۦۖۢ۟ۜۖۘۦۗۜۛ۟ۜۘۥ۟ۚۚۦۖۘ" : "ۧۨۥۘۤۜۤۡۘۙۙ۟ۢۡ۫ۖۘۦۜۥۘ۫ۤۥۦۙۥۘۜۤۖۘۖۥۦۘۗۧۥۘ۫۫ۖۘۨۖۙۖ۫ۘ۠۫ۜۘۜۛۡۘۘۤۛۢۧۢۥۘۢۖۡۖۘۛۨۙۗۨۜۘۛ۬ۘۘ۬ۚۥۙۗۘۘۖ۟ۦ۫۫ۗۖۦۚ۠ۘۘۢ۠ۘ۬ۧۖۙۥۨ۟ۖۥۥۢۨۘ۫ۧ۬ۘۧۦۘۗۙ۠ۜۘۨۜۚۨۡۛ۫";
                                                                            case 1070917036:
                                                                                str6 = "۫ۛۨۘۚۥۚۖۜۨ۫ۨۦۘۢۧۦ۠ۦۙۚۦۡۘۧۧۢۧۦۗۥۧۧۚۢ۠ۡۛۦۘ۟ۖ۟ۥۗۢۗۡۘۘۛۙۢۛۥۘۘۛۥۧۘۜۥۡ۠ۨۜۢۦ۠ۖۦ۟ۧۦۘۦۡۤ۫ۦۛۚ۬۬ۚۦ۠۫ۘۘۖ۠ۘ۟ۗۥۘ";
                                                                                break;
                                                                            case 1497678806:
                                                                                str6 = "۟۟ۥ۬ۖۧۘۙۤۡۘۥۤۙۧۡۨۤۚۛۚۘ۠۫ۦۘۘ۬ۧۖۘۛۤۤ۬ۦۗۨۥۢۚۧۜۜۚۛۤ۠ۜ۠ۨۡۙۥۘۥ۬ۡۡۨ۟ۘۘ۫ۘۜ۠ۚ۟ۛۚۖۨۛ۠۫ۥ۫ۥۤۧۜۛۤۚ۠ۥۙۘ۟۟ۙ۫ۨۘ۠ۖۖۘۤۡۥۘ۬ۦۤۚ۬ۛۦۛۘۘۚ۬ۦۗۙۥۘۤ۫ۨۘۦۖ۬ۨۜۨۘ۬ۛۖۛۜۥۘ۬ۡ۠ۚ۟ۚۚۨۧۘ";
                                                                                break;
                                                                            case 2006992895:
                                                                                str7 = "ۨۙۘۥۢۘۘۛۛۚۗۦۖۘ۠ۨ۫ۤ۟ۙۗ۬ۡۘۧۘۚۘۙۤۘۨۖۘۨۛۤۡۙۖۘۥۨۘۧۚ۠ۚ۬ۨۧۘۛۘۧۥ۫ۖۘ۬ۥۨ۫ۗۖۘۗۨ۬ۖۘۨۖۙۧۥۦۧۡۘۛۥۦۘۦۡۜۥۥۜۙۢۢۡ۠ۗۘۦۘ۟ۦۡۦۨۧۜۦۥۘ۫ۤ۟";
                                                                        }
                                                                    }
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1393489414:
                                            str3 = "ۛۙۗۢۙۢۜۖۦۘ۬ۜۥۨۥۡۘۜ۫ۤۚۨۥۛۤۖۖۢۗ۠ۡۨۘۗۡۖ۟ۘۖۘۖۛۜۖۚۚۙۚۥۘ۠ۙۥۙۘۢۙ۟ۦۘۜۛۥۘۜۘۧۘۜۙۡۘۛۚۛۢۛۥۗۡۥۘۡۥۜۡ۫ۡۗۦۢۛۖۡۘۥۜۧۘ۫ۧۙ۫ۘۧۧۛۖۡ۬ۤۖۖۡۤۨۧۘۚ۟ۧ۬ۛۚۤ۬ۨۘ۫ۛۥ۠ۗ۟۬۟ۡۢۥۦۗ۠۠ۨۜۡۘۡ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 19197143:
                    Log.d(TAG, str);
                    str2 = "ۧۛۡ۬ۜۦۘۘۤۚۗۢۧۧ۠ۤۗۙۧۙۡۙ۬۟۟ۡۨۘ۫ۦۡۘ۫۫۠۟ۚ۫ۛۘۡۘۡۗۖۘ۟ۗۤۙۚۧۙ۟۬۠ۥۦۙ۫ۚ۫ۛۛۗ۟ۡۘۡۙۨ۫۫ۦۦ۟ۘۛۤۛ";
                    break;
                case 426923299:
                    str2 = "ۧۘۘۨ۬ۖۘۙۥۦۘۖۜۦ۠ۘۘۜۚ۬ۛۖۥۘۡۢۜۨ۬ۖ۠ۛۤۡۥۜۘۜ۠ۡۨۤۢ۠ۗۡۘۜۘۨۢۜۚ۟ۖۘۘۚۡۘ۬ۛ۫ۢ۫ۚۚ۫۠ۧۧۨۘۗۡۢۛۦۜۗۙ۬ۛۤۧ۬ۡۡۧۢ۫۟۫ۦۜۧۡۡۧۡۘۘۢۙ۫ۢۦۧۧۦۤۛۚۡۢۦ۫ۧۦۘۧۥۘۙۘۘۙۘۜۜۜۨ۫ۤۖۨ۫ۧۛ۫ۖ۫ۗ";
                    break;
                case 473276982:
                case 1736140713:
                    return;
            }
        }
    }

    public static void error(String str) {
        String str2 = "۫ۤۥۥۗۜۨۚۗ۠ۖۡۘ۠ۜۢۨۧۖۧۜۤۘۤۛ۟۫ۤۜۜۜ۠ۗۡۘۤۗۘۘۨۨۡۘۡۡۖۘۚۗۜۘۧۗۨۘ۫ۚ۬ۗۙۜۙ۟ۦۘ۫ۦۤۢۥۤۜۥۙۛۦۨۨۛۜۥۘۚۜۢۦۘۛۤۦۗ۫۫ۙۖۖۘۙۜۜۘۙۚ۠ۤۦ۬ۧۖۖۘۙۨۨۘۜۚۧ۬ۧۡۤۜۚۨ۬ۧۢۛۚۦۖۘۘ۬۫ۘۘۗۗۦۧۥ۫ۦۧۦ۫ۗۗ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 174) ^ 530) ^ 693) ^ 444) ^ 938) ^ 766) ^ 444) ^ 765) ^ 591) ^ 865) ^ 213) ^ 246) ^ 846) ^ 335) ^ 652) ^ 725) ^ 30) ^ 499) ^ 510) ^ 644) ^ 380) ^ 707) ^ 741) ^ 954) ^ 890) ^ 428) ^ 911) ^ 134) ^ 735) ^ 464) ^ 852) ^ 56986514) {
                case -1975395985:
                    Log.e(TAG, str);
                    str2 = "ۙۦۘۙۥۗ۫ۚۜۘۘۧۖۘ۠۫ۦۘۙۛۦۜ۫ۦ۬ۗۙۗۖۦۨۤۛۤۜۜ۬ۧ۠ۘۡ۬ۗۧۙ۫ۢۨۛ۬ۢ۠ۙۗ۠ۨۘۡۤۗۤۤۦۜۤۤۨۘۜۦۡ۟ۢۡۥۨۡۧۦۘۡۢۨۘ۬ۜۜۘۗۜۧۘۢۢ۟ۢۥۜۘۦۙۙ۬۬ۨۛۘۗۧۥۡۘ";
                    break;
                case -1631127425:
                case -634205365:
                    return;
                case -868121100:
                    str2 = "ۡۘۧ۟ۡۥۘ۠ۜۧۖۗۜۘۤ۬۫ۨۧۜ۫۬ۨۛ۟ۖۘۧۜۤۦ۬ۙۚۨۡۘۢۤۨۘۢ۟ۡۘۥ۬۫۫ۗۡ۠۟۠ۡ۫ۨۧۖ۟۠ۥۙۦۘۜۘۤۘ۫۟ۤۧۘۖۥۘۡۜۦ۬ۡۨ";
                    break;
                case 341717111:
                    String str3 = "ۙۧۨۘۥۚۦۢۤۨ۬ۗۧ۬ۚۘۘۜۗۧ۟ۚ۠۟ۗۚۘۦۘ۟ۛ۠ۨۧۤۨۢ۬ۜۤۛۨۢۦۚۖۜ۟ۜۙۢۤۜۘۥۙۨۘ۠ۜۘۦۥۡۘۙ۬ۨۥۚۘۘۛۖ۫ۧۚۦۤ۫ۥۘ";
                    while (true) {
                        switch (str3.hashCode() ^ (-144201552)) {
                            case -1925338095:
                                str3 = "ۥۙ۟ۢۨۚ۫ۡۘۗۙۥۘۨ۫ۘ۬ۥ۬ۜۦ۫ۛ۬ۖۨۙۦۜۗۘ۟ۚۚۗ۬ۢۙۧۥۚۛۢ۠۠۫ۗۜۖۚۖ۟ۘۨۗۛۛۦۤ۠ۜۘ۫۠ۖۘۚۙۗۦ۫۟ۧۢۖ۟۟ۦۚۜۡۙۡۧۘۥۡۦۘۢۧۢۜۘۥۢۙۙ۟ۡۨۘۖۚۢۤ۠ۧ۬ۢۘۘ";
                            case -986026366:
                                str2 = "ۙۧۨۗۢۢۥۨۗۙ۟۠ۦۦۧۘۨۤۨۘ۠ۥۖۛۡۜۘ۬ۧۦۛ۫ۡۘۧۚۢۡ۫ۗۧ۟ۚۡۜ۬ۥۘۘۖۖ۟ۘۜۦۘۗۘ۟ۛۖۦۤۙ۠۟ۜۚۘۨۜۗۡۘۛۖۛۘ۠۬ۦۧۦۘۚۨۜۢۥ۟ۙۢۦۥ۫ۜۘۧۘۘۘۜۘ۬ۛ۠ۖۦۜۤۗۡۥۘۛۥۡ۟۟ۘۘۙۥۦۘۙۦۘۙۜۛۗۡۘۘۘۡ۠ۗۙۘۜۖۡۘ۫ۦۘۘ";
                                continue;
                            case -267227395:
                                str2 = "۬ۢۘۗۧۥۖۘۧۜ۫ۧۙۥۘۜۚۖۘ۠ۥ۠۫ۖۘۧۚۜۘۢۥ۟ۨ۬ۘۖۖۤ۠ۙۘۘۦۢۜۘۥۜۡ۟ۛ۠ۖۜۘۧۥۤۥ۫ۤۤۧۜۙۖۨۘ۟ۗ۫ۜۖۡۘۦۖۡۘ۬ۖۨ";
                                continue;
                            case 238677749:
                                String str4 = "ۧۦ۬۫ۥۘۖۙۧۘ۫ۘۘۖۖۥۛۛۙۧۗۨۘ۫ۗۖۘۛۨۘۜۤۜۧۡۦۘ۫۠ۖۦۧۘۥۘۦۦ۬۟ۖۜۧۧ۟ۚۨۥۦۘۘۡۧۚۜۘ۠ۨۚۦۚۢ۟ۛۦۘ۠ۤ۠ۧۚ۠ۙۘۖ۟ۦ۟۫ۙۖ۠ۦۨۢۘۡۥۦۤ۫ۧۦۦ۠۠ۤۚ۟۫";
                                while (true) {
                                    switch (str4.hashCode() ^ 751042639) {
                                        case -837094822:
                                            str4 = "ۘ۬ۥۘۜ۬ۤۨۙ۫ۛۗۘۛۦۥ۟ۦۖۘ۫۠ۜۡۘۜۡۧۚ۠۠ۚۡۤۤۡۥۛۙ۬ۢۦۢۚۘۥۚۛۛۢۜۜۡ۟ۙۧ۠ۤۘۘۡۛۚۧۗۜ۟ۦۧۘۡ۠۫۬ۗۨۙۚۜۘۙۚۤۥۨۘۛۨۨۙۥۛ";
                                        case -371079187:
                                            str3 = "ۘۙ۬ۤۛۡۗ۟ۘۘۜ۟ۙ۠ۘۨ۠ۗ۬ۡۢ۬ۛۨۡۡۘۤۡۜ۟ۡ۫ۚۗۦۘۖۙۚ۫ۤۨۘ۬ۙ۬ۗۡۗ۟ۤۡ۬ۧ۫ۛۘۦۘۚۚۥ۟ۙ۫ۥۛۨ۬ۜۤۨ۠۬۫ۡۦۘۖ۠۬ۙۤۘۗۖۦۘ۬ۖۦۢ۬ۦۚۜۦۙۥۦ۫۟ۚ۬ۖۘ۫ۦ۟ۢۧۘۚ۠۠ۜۦۘۘۢۤۨۘۨۡۢۚۖۨۖ۫ۢۧۛۜۢۜۡۚۘۖ";
                                            break;
                                        case 1816534978:
                                            String str5 = "ۜۖۧۤ۫۠ۨۘۡۘۜۗۘۖۧۘۤۙۘۘۦ۬ۖۤۦۧ۠ۗۘ۠ۗۗۥۥۚۨۧۗۙۖۙۛۛۚۙ۟ۥۙۢۨۙۜۛۘۢ۬ۤۖۘۡۘۛ۠ۡۘۜ۫ۖۘۚۤ۫۟ۦۜۙۥۨۘۗۛۚۧۧۖۘ۟ۦۧۘۦۗۗۨۖۜ";
                                            while (true) {
                                                switch (str5.hashCode() ^ 1596623504) {
                                                    case -1726644404:
                                                        str5 = "ۗ۠ۗۗۘۨۘۚ۬ۘۨۗۗ۫ۢۧۨۖ۠ۘ۫ۗۨۧۥۨۘۤۡ۫۠ۡ۫ۚۗۜۘۨۤۜۢۗۤۗۧۦ۬۫ۖۙۘۨۘۖۧۥۚ۟ۚ۟ۤۢۛۜۦۘۤۤۨۘ۟ۗۗ۟ۚۧۡۘۦۥۖۘۚۢۗ۟۬ۥۘۛ۠ۧۘۚۡ";
                                                    case -286910835:
                                                        str4 = "ۛۡۜۘۡۢۦۡۛۡۜۡۙۗۢ۟ۚۜۘۘۦۘۡۘ۠ۡۡۨۢۛۚۜۘ۟ۜۡۘ۟ۡ۫ۨۢ۠ۚۛۖۘ۠ۡ۟ۖۘۜۘۨۚ۟ۜ۟ۢۛ۠۟ۦۡۡۛۘۨ۟۬ۙۥۧۙۦۜۛۧۚ";
                                                        break;
                                                    case 24070042:
                                                        String str6 = "ۙۗۤۨۜۡۘۙۘۘۘۜۛۥۡۦۜۧۘ۫۬ۨۛۘ۬ۦۘۙۖۨۘۘ۟ۢۙ۬ۨۘ۟ۜۦۗ۫ۧۡۡۢۧۚۛ۟ۗۗۜۘۙۧۚۙۡ۬ۛۜ۬ۨۘۨۘ۫ۨۡۘۗۤ۬۟۟ۚۗۦۢۜۡۘۦۘ۬ۥ۫ۜۘۚۙۜۖۥۗۚۡۜۘۡۖۜۚۜۢۢۨۛۙۤۙۘۜۡۘۖۥۙۤۨۗۤۛۦۘۤۦۜۘ";
                                                        while (true) {
                                                            switch (str6.hashCode() ^ 1384652728) {
                                                                case -1572809628:
                                                                    str5 = "ۛۤۜۥۙۡۘۗۦۥۘۥۙۛۢۦۡۧۘۜ۬ۧۚۜۥۘۜۥۘۛ۟ۢۤۘ۠ۦ۠۫ۨۜ۬ۥۗۤۥۦۘۖ۠ۜ۫ۦۖۘ۟ۧۘۘۛۗ۟ۗۘۤۡۙۧ۠ۥ۟ۘۧۘۖۢۛۜۖۚ";
                                                                    break;
                                                                case -431413100:
                                                                    str6 = "۟۠ۨۜۤ۬ۤۦۙۢ۬ۚۗۘ۫۟ۚۧۥۘۨۥۧۘۡۛ۟ۨ۠ۤۘۨۥ۬ۥۢۨ۬۬۬۠۬ۜ۠ۚ۬ۖۤۜۗۢۦۛۦۘۗۚۥۖۨۤۧۜۧۘۦۢۡ۠ۚۧۚۘۜۘۥۢۗ";
                                                                case 1293672494:
                                                                    str5 = "ۙۛۥۨ۬۟ۦۨۡۘۨۢۚۜ۟ۘۘۖۡ۬ۖ۫ۥۘۖ۠ۤۤۢ۟۫ۨۖ۬ۖۡۘۢ۬ۥۚۡۗۗۜ۟ۚۜۚۗۧ۠۠ۚۦۧۘۛۨۘ۫ۚۖۚۨۘۘ۬ۦۢۗۖۧ۫۟ۢۤۧۨ";
                                                                    break;
                                                                case 2029775699:
                                                                    String str7 = "۟ۖۜ۬ۦۘۗۨۛۜۛۢۜ۠ۖۜۛۖ۫ۢۘۦۤۜۨۖۦۖۛۨۥ۠ۚۦۛۗۙ۬ۨۨۦۘۨ۫ۡۘۖ۫ۗۨ۠ۖۘۤۖۜۘۘۙۨۘ۫ۧۡۜۨۘ۬ۙۛۜۖۙ۬ۗۡۘ۫۠ۗۤ۠ۧۚ۬ۦۙۛۡۙۢۢۘۜۡۧۙۡۘۦۜۡۗۚ۠۫ۧۥۦۧۡۙۢۡۙ۟ۜۛۙۛۚۥۦ۬ۜۘۖ۟ۤۤۡۗۥ۠ۦۢۤ۟ۥۡۖ";
                                                                    while (true) {
                                                                        switch (str7.hashCode() ^ (-150271542)) {
                                                                            case -1009893359:
                                                                                str7 = !BuildConfig.DEBUG ? "ۨۜۦۜۡۘۧ۬ۗ۟ۢ۠۟ۜۘۦۦۙۢۖۡۦۡۚۗۚۨ۬ۨ۫ۡ۠ۦۘۢۚ۫ۖ۫ۡۘۘۚۙۚۙۢۧ۫۬ۥۤۦۘۜۦ۫۫۠ۢۚۢۜۘۚۤۥۘۗۤۗۢۗۥۙۦۨۘ۬ۖۗ۟ۦۧۘۛۜۥۘۖ۠۫۠ۘۤۢۨۦۘ۠ۡۗۡ۫ۗۖۨۦ۫۫ۙۗۛۦ" : "ۢۖۡۘ۬۬ۘۡ۟ۖۘۗ۫ۖۘ۠۬ۘۚۡۧۘۡۗۙۢۡۗۚۨۛ۬ۡۜ۟۟۫۬۫ۨ۫ۚ۬ۡۦۜۘۚ۬ۗۤۧۙۡ۟ۨۘۛۦۜۘۦ۫ۤۡ۟ۙ۠ۢ۬ۚۙۧۦۥ۟ۛۦۧۚ۟ۨۘۦۛۗۙۖۜۘۤ۠ۖۘ۠۫ۙۗۜۡ";
                                                                            case -329867979:
                                                                                str7 = "ۢ۬ۤۥ۠ۖۤۖۡۘۘۚۜۘۧۥۜۘۦۜۡۘۚۤۜۘۗ۫ۘۘۛۢۜۘۖ۫ۤۛ۬ۖۘۡۤۡۘۧ۫ۧۨۛ۠ۜۡۗۚۖۦۛۦۜۗۗۘ۠۠ۦۘۤۚۚۗۖۡۙۦۦۘۤ۫ۙۗ۬ۨۘ۬۠ۚۧ۟ۦۘۡ۠۫ۛ۟ۨۖۧۘۙۨۥۘ";
                                                                            case 769803148:
                                                                                str6 = "ۡۨۜۘۤۛ۟ۜ۬ۦۘۨ۠ۡۢۛۘ۫ۗۡۘۜۢۡۘۘۛۘۘۙۘۜۘۚۙۦ۫ۙۖۧۜۜۘۗ۟ۧۙ۫ۖۙ۬ۜۘۖۤۜۘۦۛۖۘ۟ۖۦۘۘ۟ۛۡۚۖۚۢ۫ۧۖۡۘۥ۠ۖۘۦۥۦۘۙ";
                                                                                break;
                                                                            case 1648326458:
                                                                                str6 = "ۚ۠ۘۘ۟ۖۘۥۚۨۘۦۛۥۜۖۖۢۨ۟ۗ۠ۡۦ۫ۡۘۘۤۙۙۧۡۗۚۛ۠ۥۗۛۦۥ۠۟ۨۤۦۥۖ۫ۜۘۚۛۡۚۧۥۘ۟ۚۨۦ۫ۦ۟ۖ۠ۘۤۚۜۨ۫۬ۦۖۘۗ۠ۥۘۛ۟۬ۦۧ۫ۛۢۢۗۤۡ۠ۖۡۖ۟ۘ۟ۤۘۨۛۨۘۢ۠ۨۘۧۡۦۘ۠۬ۖۘۛ۬ۦۘ۫ۦۘۘۚ۬ۘۢۧۖۘ";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 711133889:
                                                        str4 = "ۜۡۜۘۖۤۨۙۡۡۘ۟۫ۦۘ۟ۛۦۘۦۡ۬ۤ۟ۥۨۢۤۛۧ۟۬ۚۥۘۢۨۘۘۘ۬ۗ۫ۙۥۘۡۤۧۦۤۘۚۤ۠ۖۦۨۢ۟ۨ۬ۜۛۛۡۢ۟ۛۗۖ۠۬۟ۖۛ۫۟ۥۜ۠ۨۘۗۧۡۚۦ۬۠ۢ۫ۥۖۗۚۤۦۘ۠ۖۙۘۤۧۤۧ۠۬ۢۢۨۧۦۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1869086005:
                                            str3 = "۬ۦۖۛۦ۬۬ۛۗۦ۠ۛۘۜۖ۬ۧۘۥ۫ۨۘ۬ۖۨ۫ۗۨۘۧ۫ۤ۬۫ۢۦۜۘۤۥۡۜۘۨۘۚۦۨۖۜ۬ۥۜۤۜۘۜۖۘ۠ۖۘۛۡۜۗۗۥۘۦۘۨۧۨۘۛۦۛ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
            }
        }
    }

    public static void info(String str) {
        String str2 = "ۜ۟ۡۘۖۥۗ۠۠ۢۙ۫ۘۘۘۧۨۘۗۤۢۨۥ۬ۖۙ۠ۖۨۘ۟ۦۘۗ۬ۡۡ۟ۚۦۚۡ۫۟ۦۢۨۡۘۦۥۥۗۡۤۨۚ۫ۘۦۧۖۘ۠۫ۧۛۧۘۨۛ۠ۖۘ۬ۢۦۢۛۨۚۡۥۘۡۢۖۘۗۗۖۘۢۧ۟۫ۡ۬";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 607) ^ MaterialCardViewHelper.DEFAULT_FADE_ANIM_DURATION) ^ 104) ^ 215) ^ 890) ^ 811) ^ 275) ^ 968) ^ 659) ^ 63) ^ 351) ^ 137) ^ 670) ^ 155) ^ 534) ^ 204) ^ 231) ^ 302) ^ 440) ^ 519) ^ 313) ^ 967) ^ 790) ^ 221) ^ 786) ^ 566) ^ 196) ^ 226) ^ 497) ^ 336) ^ 590) ^ (-1535544471)) {
                case -652742608:
                case 356689436:
                    return;
                case -264995412:
                    str2 = "ۧۧۨۘۖۜۢۙ۠ۦۘۙۘۢ۟ۡۘۜ۠ۨۢ۬ۜۘۜۘۢ۠ۥۘ۠۬۬۫ۥۥۗۢۘۛۚ۟ۛۘۘۡۜ۬ۥۦۚ۫ۡۧۧۖۥۨۛۛۨۗۛۗۤۦۡ۬ۛۥۦۢۧۥۚۜۦۘ";
                    break;
                case 888614418:
                    Log.i(TAG, str);
                    str2 = "ۗۘۜۘۤۦۘۙۤۦۧۛۜۘۛۛۙۜۚۧ۠ۘۘ۠۫ۚۢۤۛۜۤۗۧ۠ۚۖ۟ۚۗۢۜۘ۬ۧۜۛۦۨۘ۬ۤۛۘۨۚۤۙۤۙ۬ۚۛۦۦۥ۬۫۠۬۫ۧۦ۠ۖۛۜۛ۠ۨ";
                    break;
                case 1877976681:
                    String str3 = "ۧۡ۠ۢۚۦۘ۫ۚۦۘۖۡۧۧۚۡ۠ۨۜۗۨۦۤۢۜۘ۬ۜ۬۫ۢۘۘۚۡۨۢۢۜ۠ۙ۬۟ۗ۠۠ۥۙۜۗ۠۫ۦۢ۬ۜۨۗۨۚۧۥۛۜۖۦۘۤ۠۠۫ۖۧۘ۟۟ۨۖۘۖۘۥۦۡۨ۟ۗۛ۟ۜۘۙ۠۟ۖۨۦ";
                    while (true) {
                        switch (str3.hashCode() ^ (-751395536)) {
                            case -1601726214:
                                str3 = "ۚۛۘۢۧۜۘ۠۟ۘۘۙۖۨۘ۬۠ۜۘۘ۬ۚۨ۬ۥۚ۠ۙۢۘۡۘۨۖۥۙۥۡۥۘۥۘۤۤۚۦۚۘۘۖۧۦۘۢۡ۟ۘۦۘۛۧۖۘۤۖۘۘۡۚۚۗ۫۟ۜۜ۠ۨۛ۫ۦۢ۟۬۟۫ۡۛۜ۬ۡۘۥۗۧۧ۫۫۟۬ۘۘ۠ۨۨۤۤۘۘۖۢۜۘۚۦۚۤۦۥۘۡۧۛ۠ۚۡۘۡ۠ۢ۬ۢ۟ۚۨۢ";
                            case -735063888:
                                str2 = "ۤۦۡۖۢۛۤۤۜۘ۬۬ۚ۟ۦۘۡۜۙۜ۫ۘۛۙۘۢ۠ۜ۠ۘۙۢۡۘۥ۟ۙۘ۬۬ۥۨ۫ۧۧۜۗۤۧۜۘۡۘ۫ۧۨۘۗۘۛۚۢۖۘۛۘ۠ۨۜۤۦ۬ۛۜ۟ۗۢ۬";
                                continue;
                            case -312358186:
                                str2 = "ۥۗ۠ۦۚۖۘۚۦۥۘ۫۬۫۫۫۬ۡۨ۫ۥۨۥۘۥۚۛ۫ۖۚ۫ۧ۬ۥۨۥۨۤۛۚۦۤۦۢۗ۫ۙۤۢ۟ۖۘۧۧۘۘۤ۫ۖۚ۟ۢۖۦ۟ۢۙۦۘ۬ۛۧۙۚۜۤۡۜۘۧ۟ۙۜۧۜۘۢ۠ۙۘۤۘۡۨ۫ۥ۠ۛۦۙۨۘ۬ۗ۠ۘۜ۠ۤ۟ۢۚۥۧۘۦ۫ۦۘۧ۫۫ۤ۫۟ۢۜۘۙۖۖ۟ۛۙۖۘۛ۬ۛۥۗۚۗۖۦۖۘ";
                                continue;
                            case 347397247:
                                String str4 = "ۢۜۖۘۜۛ۬۟ۡ۬ۛۖۥۢۛۖ۬ۡۡۘۗۛۧ۟ۤۤۥۜۥۘۦ۬ۢ۬ۗۥۢۜۘۤ۬ۚۨۢۤۙۘۚۢۙۜۘۛۡۗ۫۫ۛ۟ۨۘۘۦۡ۟۫ۧۘۦۛۛۤۚ۬ۨۧۡۡۧ۫ۢ۬ۡۘۖ۬ۥۘۖۦۦۘۖۚۦۖۧۨۘۛ۟ۘ۬ۨ۠ۡۡ۬۬ۨۛ۬ۗۘۘ";
                                while (true) {
                                    switch (str4.hashCode() ^ (-18918640)) {
                                        case -1690435965:
                                            String str5 = "ۥ۠ۘۘۨۘۖۘ۬ۖۘۘۥ۫ۨۘ۟۟ۧۤۘۡۥ۟ۡۘۢۗۤ۫ۥۜۤۦۜۘۢۖۜۘۧۜۙۢ۫ۡۘۥۗۘۘ۠ۤۜۘۙۢ۟ۥۦۧۘۧۤۨۢۢۗ۠ۛ۫ۜۧۤۨۨۡۘۦۗ۟ۘۢۤۙ۠۬۫ۦۗۡۡۧۘۢ۟۠۬۬ۜۧۘۢ۟ۧۛۗۖۘۗ۠۫۬ۨ۠ۜۢۖۘۛۗۗ۟۠ۧۤۤۢۡ۫ۨۘۘۨۧۡۜۦۘۥۘۚۢۥ۫ۥۜ۫ۨۥۘ";
                                            while (true) {
                                                switch (str5.hashCode() ^ (-1422710781)) {
                                                    case -613097814:
                                                        str4 = "ۦۡ۟ۖۥۥۡۙۜ۫۠ۧۢ۠ۘۘ۬ۧۧۤۗ۟ۥ۠۟ۤۡۨ۠۫ۙۧۦۧۡۜۗۤۗ۫ۦۗۗ۬ۘۧۘۛۨ۠ۥۗۙ۟۫ۛ۟ۦۘۜۛۖۙۖۗۘ۬ۦ۫ۨۛ۫۬ۗۡۨۗۧۢ۠ۥۚۦۖۨ۫ۦۥۘۙۧۡ";
                                                        break;
                                                    case -155861265:
                                                        String str6 = "ۥۙۡۘۛۦۡۘۢۛۖۘ۫ۡۛۙۖ۬ۧۜۘۘ۫ۜۙۤۘۘۙۚ۬ۧ۫۫ۛۢۚۜۘۗ۬ۚۚۘۨۘۤ۬ۗۧ۬ۛۡۚۚۘۨۖ۬ۛ۫ۘۙ۠ۚۧۗۖۤۨۤۚۖۡۜۛۗۖۧۚۚۧۙۚۤۨۥ۟ۦۥ۫ۥۤۡۦ۠۫ۢۢ۟ۧۖ۠۫۟۫ۨۘۘ";
                                                        while (true) {
                                                            switch (str6.hashCode() ^ 1104908332) {
                                                                case 151344594:
                                                                    String str7 = "ۤۡ۬ۥۡۨۗۨ۟ۥ۟ۡۘ۠ۜۥۙۢۥۘۨۤ۠ۥۧۖۚۖۨۘۢۘۙۖۛۡ۫ۜۡۤۨ۟۠ۗۘۘ۠ۢۜۦۧۗۜۧۘ۠ۛ۟ۧۗۛۢۗۚۚ۟ۙ۫ۧۦۧۜۘۡۛ۬ۜۢۢۘ۠ۚۡ۬ۘۦ۬ۜۚۗ۫۫ۙۗۧۦۗۡ۠ۨۘۥ۬ۥۘ۠ۜۤۡۖۘ";
                                                                    while (true) {
                                                                        switch (str7.hashCode() ^ (-1191609097)) {
                                                                            case -1365311730:
                                                                                str6 = "ۢۤۧۘۙۘۢ۟ۖۖۦۖۘۤ۫ۨۘۢۙۖۘۜۥۦۨۢ۫ۤۙۚۨۚۙۡۨ۠ۨۙۢۜۛۦۘۧۢۨۖۗۙۚ۫ۦۦۚۡۡۘۙۢۖۘۚۘۜۖۖۗۚۨۛ۟ۤۥۘۘۧۦۘۜۧۢۜۧ۟۟ۡۗۗۢۙۢ۬۠ۛ۫ۥۢۢۥۚۥۜۡۢۥۦۗۚۜۥ۟ۥۗۗۦۨۚۨۚۥۘ۟ۚۖ۬۫ۙۗۦۦۘۘ۬ۖۘ۠ۛۛۡ۬ۧۛ۫ۦ";
                                                                                break;
                                                                            case -1034406985:
                                                                                str7 = "ۦۘۡۘۚۧۤۤ۠۬ۗۚۛ۠ۘۤۙۛۖۘۗۡۡۘۜ۬ۦۘ۬ۙۥۘۚۢۧۤۡۚۘۢۡۢۛۘ۟ۢۨۙ۟ۥۘۜ۠ۥ۠ۚۖ۠۠ۘۦ۬۠ۗۨۖ۟ۜۢۚ۟ۖۧۛۥۚ۬ۨ۟ۢۚ";
                                                                            case 859225230:
                                                                                str6 = "ۘۘۧۘۢۜۦ۟ۥۧۘ۫ۙۖ۫ۥۥ۟ۖ۬ۢۨۘۘۢۜۖۧۧۜۗۡۧۢۙۦۘۙ۟ۨۘ۫ۡۘ۠ۗۥۚۧۙۗ۫ۧۜ۠ۖۘۜۛۛۖۢۛۙۤۚۨۖۖۘۛۘۥۧۜۢۜۗ۠ۥۥۨۘ۟ۗ۠ۚۘ۬۠ۚۛ۟ۨۘۘۜۥۡۢۜۥۡۧۜۘ۠ۢۜۙۦۥۚۥۜ";
                                                                                break;
                                                                            case 1496181761:
                                                                                str7 = !BuildConfig.DEBUG ? "ۜۜ۠ۥۧۨۘ۫ۡۙۨۘ۫ۡۖۡۦ۠ۨ۫ۦۥۙۥۖۘۚ۟ۤۗۨۧۘۧ۬ۖۘۦۨۡۙۢ۟ۚۥۢۗۚ۫ۚۨۦ۟۟ۡۧ۫ۘۘۜۛۗ۠ۦۥۘۡۨۦۘۗۨۦۘۖۚۨۘۤۥۥ۫ۘۧۦ۬ۡ۠ۘۘ۠۠ۜۥۚۡۖ۠ۗۢۜۤۦۘۥۘۢۜۨۘۗۡۛۚۖۦ" : "ۘ۫۠ۧۚۜۚۛۨۘۜۧۦۢۙۦۘۢۡۦۚ۟ۖۘۨ۠ۦۘۘۦۨۘۢ۬ۦۤۙۜۨۨۘۘۡۦۤ۠ۜۘۜۜۘۘۖۗۧۛۡۥ۠۠ۡۘۥ۫۫ۖۗۘ۫ۜۘۢ۠۠ۦۚۖۘۧۜۛۗۨۗۢۦۘۧ۠۬۫۟ۖۘۧۢۖ۫ۖۥۜۦۜۘۧ۠ۦۚ۠ۗۛۥۨۘۦۜۖۜۚۧۚ۟ۙۙۥ۟۟ۧۛۢۚۦۧۢ۫ۛ۠ۧۜۘۤۥۙ۠ۙۧ";
                                                                        }
                                                                    }
                                                                    break;
                                                                case 1005925808:
                                                                    str5 = "ۤۙۜ۠ۨۘۖۤۡۛۖۡ۫۠ۦۢۦۘۗۢۗۛۧ۫ۘۗۜۢۙۖۘۘۡۜۘۖ۠ۛۙۧۜۘۗۙۦۘۢ۟ۦۥ۬ۦۘ۟ۘ۫ۦۚۦۘۦۧ۠۬ۚۘۘۦۜۨۘۢۚ۬ۥۗۢ۬ۘۗۨۛۜۘۤۧۙ۠ۜ۠ۙۙۥۡۙ۠۟ۨۘۘۦۗ۟ۛۨۛۥۛۢۥۘ۬ۗ";
                                                                    break;
                                                                case 1421653537:
                                                                    str6 = "ۖۗۥۘۛۧۡۙۢۙۛ۠ۥۙۤ۫۬ۖۨۘۜ۫ۜۗۥۙۧۜۙۤۢۙ۟ۡۦۥ۟ۨۘۤۙۚ۟ۦۙۤۘۦۚۧ۟ۚۨۦۘ۬ۜۦۘۨۥۛۢ۫۫ۛۡۥۘۧۚۜۘۛۢۤۗ۬ۘۥ۠ۦۘ";
                                                                case 1871667026:
                                                                    str5 = "۠ۨ۠ۚۥۘۦۜۡۘۖ۬ۧۤۚۡۘۤۧۦۘۤۛ۟۬ۗ۫ۤۙۤۦۤۦۘ۫ۘۚۧۨۜۘ۬۬ۥۘۖ۫ۢۗۜ۫ۨۦۥ۬۠ۥۘۜ۟ۘ۟ۘۡۢۜۧ۟ۢۨۦۦۘۘۙۗۥۘۢۘۛۙۖۥۘۧ۟ۖۤۗۡۨۘۘۡۚ";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 257336470:
                                                        str4 = "ۧۡۜۘۥ۠ۜۤۡۚۡۘۥۚۨۧ۫ۖۡۘۖ۬ۙۦۤۖۡۛۜۧۙۥ۬ۢۥۥۜۗۗۡۦۚۤۡۙ۫۫۫ۚۦۥۦۘۨۢۦۘۥۦ۠ۙۙ۬ۘۙ۬ۙۦۦۥۧۘۙۘۦ۫ۧۥ";
                                                        break;
                                                    case 1511222949:
                                                        str5 = "ۘۦۖۘۥۦۚ۫۫ۦۘۥۗۖۘ۟ۤۘۘ۠۫ۚۖۨ۟ۦۛۚۗۨۘۘۦۛۜۥ۬ۜۘۜۜۜۢ۫ۖۘۤۛۘۘۢ۟ۗۖۤ۬۟ۘۖۚۗۚۧۡۥۘۨۦۧۜۥۜۘۖۡ۟۠۬ۥ۟ۦۢۧۧۦ";
                                                }
                                            }
                                            break;
                                        case -248893070:
                                            str3 = "ۦۛۧۡۚۨۘۘ۫ۗۤۘ۠۟ۡۥۘ۟۟ۢۡۗۤۜۘۨ۟ۢ۫ۖ۬ۜۨ۫ۜۜۗۥۥۛۧۢۥۘۙۤۚۥۢۦۙ۠ۦۘ۟ۖۜۘ۠ۚۖۙۜۖۡۤۛۗۦۨۜ۬ۥۛۦۘۤۨۨ۫ۦۜۘۚ۠ۛ۬۟ۗۦ۟ۦۤۚ";
                                            break;
                                        case 1321429808:
                                            str3 = "۬ۢ۫ۙۜۛ۠ۤۥۘۤۛۢ۬ۖ۠ۛۦۚۧۛۨۘۥ۠ۡۘۖۧۢۢ۬ۧۗۢۦۗۥۛۙۨ۬ۜۘۙۜۚۨ۠۟۬ۘۦ۬ۗۢۨۘۢۜۡۘۨۖۘۥۨۘۘ۟ۛۥ۫ۢۡ۠ۛۖۘۥۥۦۘۥۧۘۘۗۤۨۛۥۥۘۧۖۧۘۢۡۨۘۚۤۚ۠ۤ۠ۜۗۙۜۜۤ۟ۚۚ۬ۗۚۜۘۦۚ۫ۛۥۘ۬ۚۦۘ";
                                            break;
                                        case 2021762361:
                                            str4 = "ۚۗ۬ۙۚۨۘۚۖۖۧۧۥۧۜۗۤۦۦۧۙۡ۟ۥۛۡۢۚۛۜۚ۬ۨۜۘۗۤۨۙۡ۟ۧۨۥۧۘۧۘۨۙۧۤۛ۟۬ۚۛ۫۠ۧۤۦۡۘۜۧۦۢ۫ۡ۟ۡۚ۬ۚۨۤ۠۠ۧۡۡۘۥۦ۫ۗۢۚ۟ۧۖۘۡۤ۫ۥ۬ۜۘ۬ۗ۬۟ۗۡۘ۫ۧۦۘۢۨۥۘ";
                                    }
                                }
                                break;
                        }
                    }
                    break;
            }
        }
    }

    public static void warning(String str) {
        String str2 = "ۥ۬ۙۨ۟ۥۥۤ۫ۡۘۘۖۦۗۘۦۙۤ۬۟ۨۡۗۖۚۗۤۗۦۘۜۨۗۚ۟ۛۙۜۜ۠ۘۖۜۦۦ۬ۗۥۘۦ۟ۘۘۜۢۘۘۨۥۖۘۚۛ۬ۢ۟ۛۤۤۖۗۡۚۗۨۘۦ۠ۡۘۜۗۗۥ۠۟ۘۡۗۖۙۨۤ۠۫ۧ۬ۧ۠ۤۙۛ۠ۛۛۗ۫ۡۘ۬ۜۥۘ۠ۗۥۘۢ۟ۨۖۦۙۖۖۧۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 47) ^ 608) ^ 56) ^ 83) ^ 664) ^ 827) ^ 975) ^ 811) ^ 78) ^ 465) ^ 484) ^ 209) ^ 669) ^ 912) ^ 442) ^ 35) ^ 320) ^ 210) ^ 583) ^ PointerIconCompat.TYPE_ALIAS) ^ 357) ^ 124) ^ 670) ^ 587) ^ 683) ^ 531) ^ 99) ^ 995) ^ 387) ^ 75) ^ 708) ^ 1755529775) {
                case -1883269134:
                case 1092330825:
                    return;
                case -1042646844:
                    Log.w(TAG, str);
                    str2 = "۬۟ۘۗۛۤۛۘۧۨۨۘ۟۠ۥ۫ۙۤۗۢۨۡۚۖۘۖۘۛ۟۫ۛۖۨۘۢۙۗ۫۟ۨۖۡۧۨۧۖۘۗ۠ۦۘۤ۬ۥۘۢۘۨ۫ۖۦۚۢۚۢۚ۟۟ۢۚۛۤ۬ۨۚۧۢۨۙۦ۫ۧۤۥۡۛۜۗۜۘۜۨ۫ۜۘۡۗۡۘۨ۫۫۟۟ۡۘۚ۬ۘۘۜۘۡۘۗۗۘۘۖۧۨۡۖۘۤۡۛۚۙۚۛۘۘۚۤۚ۟ۖۧۘ۬ۡۧۖۘۖ";
                    break;
                case 622149405:
                    str2 = "۫ۙۥ۠۬ۗ۬ۧۧۧۤۡۘۡۜ۠ۦۗۜۦۥۜۦۨۖۚ۬ۗۨ۫ۥۘۧ۟ۧۡۨۘۘ۟ۡۚ۬ۡۘۘۨ۬ۘۨۨۜۛۙ۠ۡۦۛۧۜۧۘۦۢۡۜۧ۠ۤۘ۠۠ۗۛۗۤۥۡۡۘۚۚۜۨ۠ۤۦۥ۠۟۫ۥۘۘ۟ۛ۠۟ۥۘۙۚ۠ۜۦۧۘۢ۬ۥۘ۬۟ۜۘۖۥۖ۬۬ۛۚۖۘۧۥۘۘۙ۠ۨۢۗۙۤ۠ۨۧۙ۫ۧۘۡۘۜۛۤ";
                    break;
                case 1998698761:
                    String str3 = "ۗۡۤۥۤۢۤۖۚ۫ۤۖۘ۠ۛۗۗۥۙ۬ۡۘۘ۠ۤۖۖۗۧۦ۟ۚۨۙۗ۬ۛۥۖۨ۫ۢۥۘۢۚۖۘۢۡۦۘۖۘۛۢۚۘۘۦۨۤۚ۠ۥۛ۬ۜۥۗۙۚۘۦۘۖ۟۬ۚۖۦۘ";
                    while (true) {
                        switch (str3.hashCode() ^ 1961072790) {
                            case -308422462:
                                str3 = "ۗۜۦۘۦۜۨۘۨۘۨۘۜۘۖۗ۟۫ۜۗۜۡۦۘۚۜۧۘۚ۟ۧۤ۬ۜۤ۬ۨۘ۠ۚۡ۠ۦۘۢۦۜۘۙۢۡۘۤۡۦۘۚۚۧۗۘۘۜۧۗۦۜۗۧۗۧ۠ۘۖۘ۫ۗ۟ۢۗۘۘۤۥۖۘ";
                            case 1164162464:
                                str2 = "۟ۡۜۘۚۙ۟۫ۥۛۘۗۗۨۙۖۘ۟ۙ۠ۘۘۗۚۜۧۘۖۨۦۘ۫ۗۥۘۤ۠ۡۢ۫ۙۖۧۖۘۢۚۘۚۢ۬ۘۖۘۧۙۥ۠ۨۧ۫ۜۥۘ۫ۘ۟ۚ۟۫ۜۜۘۡۛ۬ۗ۟ۨۘۤۗۗ";
                                continue;
                            case 1321585259:
                                String str4 = "۬ۡۥۗ۠ۜۘ۫ۦ۬ۨۢۜۘۘۘ۬ۥۢۖۥۛۜ۟ۤۦ۠ۨۢۡ۟ۦۘۘۚ۫ۜ۫ۤۥ۫ۛۖۗۦ۫ۚۦۜ۠۠ۦۢ۠ۛۜۘۘۥ۠ۧۛ۬۠ۚ۟ۙۘۘۘۛۛۥۘۚۢۛۛۧۡۦۜ۟ۛ۠۬ۡۦ۠ۡ۫ۖۨۤۗۦ۫ۖۘۛۧۜۗۦۗ۠ۙ۠ۙۙ۟ۦۡۜۘۤۙۤۙۙ۫ۘۢۧۚۚۦۘۗۜۧۡۤۨۘۚۛۘۘۘ۠ۥۘۜۙ۫";
                                while (true) {
                                    switch (str4.hashCode() ^ 593418035) {
                                        case -1453699371:
                                            String str5 = "ۚۗ۫۟ۘۡۙ۠ۚ۠۬ۛۦۥۜۘۤۖۥۜ۬ۗۖۨۥۘۢ۫۫ۦۗۚۘۖۘۛۖۡۖ۫ۡۘ۟ۤۨۜۚۙۤۤۖۡ۬ۖۘۤۙۡۘۥۥۘۚۢۨۘۛۡ۠۬ۗۖۘ۟ۦۛۜ۠ۡۜۘۥ۬ۧۦۖۛۜۥۘۢ۫ۘ۫۬ۥۘ۠ۜ۟ۚ۫ۦۘۥۡۗۧۙۦۘۜ۫ۖۘۛۖۘۦ۠ۦۘ۟ۛۘ۬ۘۙ۫ۨۘۘۙۤۢ۫ۤ۫ۦ۠ۚۦ۠ۖۢ۬ۘۘ";
                                            while (true) {
                                                switch (str5.hashCode() ^ 1480210242) {
                                                    case 631513192:
                                                        str5 = "۫ۨۖۘۗۢ۠ۨ۫ۦۘۚۜۧۘۘ۬ۜۘۛۚۗ۟۫ۨۗۙ۫ۜۛۡ۬ۘۘۗۨ۬ۡۥۘۨۚۘۜۜ۬ۤۥۤۦ۠ۦۤۖ۠۫ۡۘ۬ۛۖۨۡۘۘۥۡۗۢ۟ۦۚۢۨۤۦۘۗۦۨ۬ۤۛۚۤۡۘ۠ۨۧۘ۠ۘۨۘ۫ۜ۠ۤۢۨۘ۟ۢۖۙۛۗۡۥۧۥ۟ۨۙ۠۬ۥ۬ۨۘ۫ۡ۫ۥۨۥۦ۠۫۠ۧ۠۠۬۬ۖۧۨۘۖۘ۬ۙۨۤ";
                                                    case 1087666599:
                                                        String str6 = "ۦ۬ۜۘۦۜۖۦۘۦۘ۠ۢ۬۠ۛۜۘۚۡۜۘ۟ۦۡۘۖ۫ۙۘ۟ۦ۠ۧۧۗۥۘۙ۟ۨۘ۟۟ۛۘ۟۠ۜۗۘ۠ۚۜۨۘۦ۫ۡۘۥ۬ۗۜۢۛۦۘۨۢۧۤۜۨ۬ۨۥۘۗۡۧۘ۫۫ۦۖ۟ۦۘۨۖ۫ۦۘۘۘۖۥۦۘۗۨۘۙۗۤۤ۫ۡۤۤۥۚ۫ۧ";
                                                        while (true) {
                                                            switch (str6.hashCode() ^ (-153599156)) {
                                                                case -1233045255:
                                                                    str5 = "ۧۙۚ۟ۧۦۘۥۧۖۘۢ۟ۦۘۙ۟ۙۛۗ۬۠ۖۘۘۢ۫ۛۤ۫ۤۜۘۗۨۦۘۢۡ۬۫ۤۤۧۨۛۜ۫ۢۤۥ۫ۜ۬ۡۘ۫ۤ۟ۚ۟ۤ۬۬ۢۙۚۚۨ۬ۥۡۥۙۗۖ۟ۛۢ۫";
                                                                    break;
                                                                case -928423321:
                                                                    str6 = "ۡۤۛ۫۟ۥۘ۠ۛۨۘۢۦۗ۟۟ۘۘ۫۬ۧۗۘۧ۬ۘۢۡۗۥ۫۟ۥۘۨۢۗۦۡۖۘ۬ۘۥۘۦۡ۫ۖۚۢۖۨۙۨۡۗۛۙۗۤ۫ۘۦ۫ۦۘۚۢۤۡۛۥ۠۟ۦۥۥۤۦ۠۫";
                                                                case -63759581:
                                                                    String str7 = "۬۠ۖۙۨۢۙۗۧۗۨۖۡۨۖۢۙۘۗۘۘۘۜۥۡۘۤۦ۫ۗ۫ۧۧۘۘۘۨ۫ۘۦ۬ۛۥ۠ۙۖۡۘ۟ۛ۫ۤۥۜ۟ۢۜۘۡۢۡۨۖۡۡۧۦۘۖۤۨۡۦۘۖۗۗ۬ۥۧ۠ۡ۬ۡۦۥ۠ۜۢۗ۟ۙ۬ۢ۬ۗۛۢۥۥۘۨۨۜۙۨ۠ۡۤۤۜۥۘۘۛ۫ۖ۠ۦۡ۟ۙۚۡۙ۬ۙۖ۟ۗ۟ۗۨۗۡۥۡۘ۟۠۠";
                                                                    while (true) {
                                                                        switch (str7.hashCode() ^ 2104526727) {
                                                                            case -2074462985:
                                                                                str6 = "ۖۤۨۨۚۡۘ۟ۤۘۛۙۧ۫ۖۖۘۜۧۗۘۘۥۘ۟ۛۦۘ۬ۡۙ۬ۨۢۚ۟ۜۘ۫ۘۥۗۛۨۘۤۢۦۚ۬ۨۘ۬۫ۖۘۚۖۦۦۙۨۘۙۦۖۘۤۦۤ۟ۛۦۛۛ۟ۙۗۤ۬ۨ۠ۧۨۡۘ۟ۢۜۦۘۥۘ۫ۨۦۛۜۘۤۖۧۘ";
                                                                                break;
                                                                            case -923798436:
                                                                                str6 = "ۢۢۤۦۢۥۧۜۧۤۘۖۖۘۢۙۤۘۜ۠ۜۦۛۚۚۧۖۘۚۘۖۙۚۥۨۙۦۡۗۗۦۙۡۘ۬ۦۧۧ۠ۗۙ۟ۡۛۘۖۘۨۢ۟ۨۨۥۙۨۛ۬ۗۜۘۨۧۦۡۡۘۤ۫ۨۦۚۢۡۦۨۚۦۢۛۗ۬ۚۡۥۧ۠ۧۧ۠ۘۢۖۘۦۦ۫۬ۤۤ";
                                                                                break;
                                                                            case -860222411:
                                                                                str7 = "ۡ۫ۘۘۧۗۖۛ۟ۥۘ۬ۘۗۢۢۚۘۤۡۘۢۤۙۜۙۖۨۨۙ۫ۤۨۛ۬ۚۦ۬ۥۙ۠ۜ۠ۚۜۘۛ۠ۙ۠ۙ۠ۖ۫ۘۖۗۘ۬۬ۥۘۛۜۤۤۘۘۨۙۚۜۚۥۙ۠۫ۥۡۤۦۧۛۙۦۧۘ۬ۥۘۦۥۘۘۡۢۤۗ۠ۜۘۚ۠ۦۘۗۙۨۘۙ۟ۦۘ۬ۚۛۥۢۤۥ۟ۡۖۦۧ۬ۗ۫۠۠ۥ۬ۢۨۖۦۡۙۙۡۢۛۜۚ";
                                                                            case -558687890:
                                                                                str7 = !BuildConfig.DEBUG ? "ۙۗۨۗ۬ۜۨۤۖۘ۬ۛۨ۟ۡۨۤۗۡۘ۫ۚۜۘ۫۠ۛۛۛۥۘۙ۠ۘۘ۫ۗ۠۫ۧۘۘۙ۬۫۠ۢۦۢۚۖۥ۫ۘۥۗۙۤۙۜۜۚ۟ۜۡۤۦۡۡ۠۫ۢۥ۫۫ۦ۠ۖۜ۫ۘۖۙۘۦۜۦۜ۫ۛۢۛۖۦۖ" : "ۦ۫۬۠ۨۡۘۖۗ۬ۤۨ۟ۛۜۗ۬ۘ۟ۗ۬ۗ۠ۡۖۨۧۖۘۢۡۨۨۨۨۘۢۜۢۤ۬۫ۗ۫ۙۤ۫ۘۘۜۗۗۘۗۨۘۖۙۛۛۗۦۛۡۘۙ۟۫ۖۛۜۚۚۢۤۖۦۘۧۚۧ۟ۗۡۜۘ۬ۗ۫ۨۘۙۦۖۛ۠ۘ۠۫۟۫۠ۘۘۦۙ۠ۤۢۨ۟ۧۦۘۡۤۙۛۨۦۚۦۥۤۡ۠ۤۜ۬";
                                                                        }
                                                                    }
                                                                    break;
                                                                case 199866637:
                                                                    str5 = "ۡۦۡ۫۬ۡۘۤۙۦۘ۬ۖۜۜۥۙۗ۬ۦۢۗۥۚۛۘۘۥ۫۬۟۬ۖۘۜۡۖۚۨ۟ۥ۬ۡۘۘ۫ۦۘۜۖۘۘ۫ۚ۟ۛۘۡۘۤۡۢۙ۫ۘۘۘۙۙۛ۟ۖۘۙۥۢۗۤۨۙۥۡۘۧۦۥۘۙۥ۬۬ۙۜۙۤۗ۠ۜۗۗۗ";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 1787964850:
                                                        str4 = "ۧ۠ۦۜۡۡۘۜ۬۟۫ۡۨۘۡۥ۟۟ۜۘۤۖۜ۫ۘۥۥۛۢۘۖۦۖۜۨ۠ۥۧۘ۠۠ۥۙۛۘۖۙۚۘۛۦۧۙ۬ۚۘۘۘۧۖ۠ۛۤۚۢۥۜ۠ۖ۫ۚۤۛۜۖۨۘۗۧۧ";
                                                        break;
                                                    case 1877953776:
                                                        str4 = "ۙۧۡۛۤۧ۬۬ۗ۬ۗ۟ۤۡ۠ۗۢۜۘۦۚۖۥۙۦۨۤۢۧۙۤ۟۟ۖۘۡ۟ۗ۟۫ۙۛۢۘۨۤۦ۠ۡۖۘۧۖۡ۫ۛۘۖۛۘۘۗۢۤ۬ۧ۠ۡۙۖۡۗ۫۬ۗۘۢۧۜ۫ۗۚ۬ۜۨۘۜ۫ۡۘ۟ۡۦ۫ۖۥۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -963001918:
                                            str3 = "ۢ۠ۜۘۨۜۥۧۦ۠۫ۜۘۙۘۥۤۥۢۘۤۙۘۢۜۘۤۧۡ۠ۡ۠۫ۡۘ۬ۤۜ۫ۦۜۘ۬ۗ۫ۢ۫ۢۥۢۚۥۧۘۘۨۜۘۘۥۚۙۥۙ۠ۚۙ۟ۨۜۚۜۘۡۘۤۥ۫ۨۘۤۖۗۗ۟ۨۘ۠ۦۖۛ۟ۤ۟ۙۢۦۦۖۘۧۨۦۘۗۙۛ۟ۛ۠۫۠ۚ";
                                            break;
                                        case 796192789:
                                            str4 = "ۤۚۨۘۡۡۖۘۨ۟ۖۚۚۜۡ۟۟۟ۧۗۛ۠ۡۜۥۘۧۙۖۘۙۙۨۘ۠ۙ۫ۤ۬ۢ۫ۖ۫ۨۥۘۥۨ۬ۚۙۨۘ۫ۤۡۙۗۦۧۢۙۚۦۘۧۖۘۛ۠۟ۜۜۡۦۛ۠۠ۚۢۗ۫ۚۗ۬ۥ۟ۦۘۖ۠ۘۘۙۧۨ";
                                        case 859574670:
                                            str3 = "ۥۜۦۢۛۡۘۥۧۖۧۦۡۘۥۚۨۥۘۨۘۨۘۜۘۧۡۜۘۥ۟ۡۚۥۘۚۥۖۖۜۚ۬ۦۤ۫ۘۛ۬ۤۘۘۖ۫ۦۢۗۖۘۥۧۖۘ۠۬ۨۘۦۘ۫ۥۡۘۘ۬ۥۜۘۗۢۖOۘۡ۠ۜۚۨ۫۠ۖۘۖۗۧ۠ۦۥۡۘۨۡۜۧۘۨۦ۟ۗۡ۫ۦۜۘ۠۟ۙ";
                                            break;
                                    }
                                }
                                break;
                            case 1716844408:
                                str2 = "ۡۧۥ۟ۙ۫ۙ۟ۗ۬ۥۛۡ۬ۤۡۙۖۨۤۨۤۖۢۦۖۜۘۡۤ۟۫ۨۢۜ۬۟ۦۚۥۘۙۜۚۖۛۛۘ۟ۨۘ۬ۦۡۥ۠۬ۦۚ۟۫ۖۘ۟ۙۗۗۢۨۘۖۨۚۦۥۚۦ۠۬ۧ۟ۥۘ۬۠ۖۘۥۙۚۢۦۨ۬ۥۘۘۛۛۨۦ۫ۛۛۘۘۨۛۧ۬ۨۘ";
                                continue;
                        }
                    }
                    break;
            }
        }
    }
}
