package kentos.loader.utils;

import android.content.Context;
import android.content.SharedPreferences;
import android.preference.PreferenceManager;
import androidx.core.app.FrameMetricsAggregator;
import androidx.core.view.InputDeviceCompat;
import androidx.core.view.PointerIconCompat;
import androidx.recyclerview.widget.ItemTouchHelper;
import java.util.Set;
import okhttp3.internal.http.StatusLine;
import org.lsposed.lsparanoid.Deobfuscator$$app;
/* loaded from: classes2.dex */
public class FPrefs {
    private static final boolean DEFAULT_BOOLEAN_VALUE = false;
    private static final double DEFAULT_DOUBLE_VALUE = -1.0d;
    private static final float DEFAULT_FLOAT_VALUE = -1.0f;
    private static final int DEFAULT_INT_VALUE = -1;
    private static final long DEFAULT_LONG_VALUE = -1;
    private static final String DEFAULT_STRING_VALUE;
    private static final String LENGTH;
    private static FPrefs prefsInstance;
    private SharedPreferences sharedPreferences;

    static {
        String str = "ۨۖۨۚۗۡۘۡۧ۟۠ۘۧۘۙۖۥۘۥۛۥۖۖ۫۟ۘۡۘۦۛۢۘۡۤ۟ۘۜۘۗۢ۠ۙ۫ۘ۟ۛۦۘۗۡۧۘ۠ۛۡۘۖۧۙ۬ۚ۠ۧۡۘۤ۫ۥۘۗۚۦ۟ۥۘۘۖۘۨۘ۬۟ۦۘ۟ۙۦۛۡۡۢۡۜۘۨ۟ۖۘۨۘۡۢۜۘ۫ۗۗ۟۟ۗۨۡۘۘۖۜۜۦۨ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 931) ^ 650) ^ 663) ^ 480) ^ 942) ^ 789) ^ 486) ^ 588) ^ 993) ^ 488) ^ 488) ^ 118) ^ 180) ^ 475) ^ 966) ^ PointerIconCompat.TYPE_WAIT) ^ 528) ^ 20) ^ 259) ^ 177) ^ 795) ^ 484) ^ 42) ^ 114) ^ 446) ^ 806) ^ 413) ^ 582) ^ 438) ^ 216) ^ 438) ^ 1133539644) {
                case -356799458:
                    return;
                case -306870087:
                    LENGTH = Deobfuscator$$app.getString(-3440722426205134665L);
                    str = "۠ۨۘۘ۟ۤۜۘ۟ۚۜۜۦۖۦۧۡۘۢۨۧۘ۠ۢۨۘ۠ۗ۠ۡ۫ۖۦۘ۠ۢۥۧۘۘۥۦۘۧۤۗۤۡۜۘۙۚۡۘۥ۠ۨۘۛۜۧۘ۠ۧۢۧۡۦ۬ۦۗۥۥۦۡۘۡ۟ۨۦۘۨۗۥۖۖۦ۫ۘۥۘۢ۬ۡۛۦۘۖۦۜۤۥۘۘۥۘ۫ۡۜۦۜۥۨۜۤۘۘۤۨۖۘۛ۬ۧۦۤۨۘۤ۫۟ۗ۫ۥۨ۫ۜۙ۠۫۬ۡۘۖ۬۠ۥۨۦۘۢۥۨۘ";
                    break;
                case -296932237:
                    DEFAULT_STRING_VALUE = Deobfuscator$$app.getString(-3440722391845396297L);
                    str = "ۤۡۜۘۙۖۦۘ۠۬ۜۘۚ۟ۨۥۨ۫ۢۥۦ۟ۙۢۚ۠ۡۘۤۖۜۘ۟ۤۨۡۙۜۦ۫ۖ۬ۥۧۘ۠ۦۥۘۛۡۥۘ۟ۜۥۛۢۡۘۨ۠ۦ۫ۚۘ۠ۘۤۢۥ۠۟ۢ۫ۚۖۢۡۨۨۥۗۥۦۢۥۤ۬۬ۢۡۥۡۙۡۜۥۛۜۚۜۘ۟ۜۖ۟ۦۤۤۡ۟ۗۖۖۡۚۖ۬ۖۗۦۜۘۘۦۦۗۤۢۜۥۤ۬۬ۖۛۢۤ۬۫ۨۦۘۘ۠ۙ";
                    break;
            }
        }
    }

    private FPrefs(Context context) {
        this.sharedPreferences = PreferenceManager.getDefaultSharedPreferences(context);
    }

    private FPrefs(Context context, String str) {
        this.sharedPreferences = context.getApplicationContext().getSharedPreferences(str, 0);
    }

    public static FPrefs with(Context context) {
        String str = "۬ۜۡۘۚ۠ۚۙ۫ۦۥۖۜ۫ۢ۠ۥ۟۟ۡۧۡۘۥۥۤۥۗۛۚۜۡۤۛۘۙۖۘ۟ۛۖۘۢۢ۫ۜۜۘۧۙ۠۫ۖۡۘ۫ۛۨۘۤۡۗۨۛ۬ۥۜۡۘ۟ۜۨۘۤ۫ۛۖۨۘ۫۫ۨۘۥۗۜۚۦۚۖۙۚۡۖۘۦۘ۠ۧ۟ۜۘ۠ۖۦ۬۠ۢۤۖۚۥ۬ۙۛۨۛۜۛ۟ۦ۟ۥ۟ۘۜۦۧۥ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 295) ^ 603) ^ 578) ^ 466) ^ 436) ^ 814) ^ 593) ^ 576) ^ 792) ^ 766) ^ 534) ^ 712) ^ 800) ^ 641) ^ 438) ^ 170) ^ 420) ^ 576) ^ 707) ^ 319) ^ 729) ^ 487) ^ 301) ^ 574) ^ 170) ^ 27) ^ 290) ^ 144) ^ 646) ^ 521) ^ 704) ^ (-1145157619)) {
                case -1414438824:
                    return prefsInstance;
                case -760705955:
                    str = "ۜۤۥۖۖۨۘۜۡۖۦ۠ۡۘۨۘۖۨۧۨۘۛۦۤۦۚۘ۠ۡۙۖ۠ۨ۫ۡۘۜۖۨۘۛۥۘۘۤۜۙۚۗۖ۬ۜۖۤۦۜۜۧ۬۠ۜ۠ۜۖۢۖ۫ۡۛۘۧۘ۟۬ۙۙ۟۟ۢۙۗ۬ۦۡۡۢۢۦۚۥۘۜ۠ۤۢۖ۠ۤۥۨۘۢ۟ۨۘ۠ۢ۫ۤۙۜ۠ۨۛۡۥۛۜ۟ۦۘۚۙ۟۠ۥۦۘۨۜ۟ۤ۟ۜۥۘۜۘۖۡۘۨۡۤ";
                    break;
                case 620756312:
                    prefsInstance = new FPrefs(context);
                    str = "۠۟ۥۘ۠۫ۗۘۛۛ۬ۙۥۡ۫ۧۦ۫ۛۢۖۛ۬ۜ۫ۙۦۖ۬ۜۘۥۗۘۘۖ۟ۙۤۚۧۢۦۧۘ۟ۙ۬ۜۨۘۘ۟ۙۨۘۤۘۜۘۙۜۚۖۙ۟ۢۢۢ۫ۘۗۨۛۙۛۛۧۤۢۦۘۚۛۤۢۙۥۘ۫ۢۛۢ۠ۖۜۘ۬ۨۡۘۡۚ۬ۡۨۥۘۖۡۛ۫۟ۡۘۜۘۦۘۨۜۘ۠۟ۨۛۨۜۘۚۛ۬ۛۗۜۘ۫ۚۤۦۦۗۚۡۖۘ۫ۧۦ";
                    break;
                case 1314502429:
                    String str2 = "ۛۗۨۨ۫ۜۘ۬ۧ۫ۘۜۘۘۗۙۜۘ۟ۘۗۗۚۦۧۙۤۧ۫ۢ۫ۦۦۥۛۢۖۘۘۡۧۛۙۙۙۙ۬۟ۘ۠ۘۘ۟ۘۘ۟ۘۙۜۗۥۘۘ۬ۘۘۤ۟ۥ۠ۘۚۜ۬ۦۘۨۢۥۚۙۘۘ۟ۚۨ۬ۥۖ۬ۥۜ۬ۢۗۢۦۡۘۜ۠ۡۘۤۡۡۘۥ۠ۨۘۗۢۥۨۛۚ";
                    while (true) {
                        switch (str2.hashCode() ^ (-1637440776)) {
                            case -2083187374:
                                String str3 = "ۘ۬ۥۘۗۛۙۧۜۛۥ۬ۡۘ۬۫ۜۘ۠ۘۦۘۛۜۛۥۜۖۘ۠ۨۨۛۗۡۘۢۜۗۨ۟ۨۘۘۥۘۘ۠ۤۦۖۗۜۥۙ۫ۛۜۜۗۗۛۡۥۢۧۨۢۙۢۢۛۧۘۥۗۢۤۗۘۧۙۜۘۚۥۜۜۢۡۘۛۘۥۘۤۨۥۡۥۗۘ۠ۜ۟ۥۙۨۡۗۗ۟ۢۛ۟ۘۘۢۥۘۘ۬ۨۜ۟۠ۢۘۜۢۙۥۘۜ۟ۡۘۛ۫ۙۧۛۨ۠ۡ۫ۡۙۙ";
                                while (true) {
                                    switch (str3.hashCode() ^ 550830068) {
                                        case -1498422474:
                                            str3 = "ۛۘۧۘۢۡۡۗۙۙۖۖۤۖ۫ۢۖۖۤۢۤۦۘ۠ۨۡۘ۬ۗۘۜۚ۠ۖۥۘۚ۟ۘۘۨۘ۬۫ۙۚۥۖۧۘۥۖۢۨۛۚۚۖۙۥۚۜۘ۟ۦۖۚۜۖۥۙ۠ۘۦۦۘۗۚۘۡۨۢۖ۠ۦۘۗۢۙۖ۟ۘۘۥۜۡۘۜۘ۬ۖ۬ۘۘۚۚۜۘۚۘۧۛۥۥۘۦۥۤ";
                                        case -212423394:
                                            str2 = "ۤۡۦۘۥۨۗۚۥۘۘۗۥ۠ۧۛۨۗ۟ۘۘۤ۠ۖۤۘۘۘۡۨۘ۬ۤۙۛۡۧۘۢۜۦۘ۬ۛۛۦ۫ۖۘ۬۬ۡۧۥۗۛۢ۟ۦۜ۫ۨ۫ۡۗۚ۫ۡۢۚۛۡۧۦ۟ۥۜۘۙۦۖۖۖۦۘۨۘۡ۫ۧۗ۬۟۠۠ۙ۬ۦ۟ۖۘۘۥۘ۟ۥۖۢۦ۟ۤ۠ۖۨۜۤۙۢۤۘۨۛۢ۫ۖۤۜۥۘ";
                                            break;
                                        case 416253224:
                                            String str4 = "ۜۗۜۘ۫ۨۨۘۥۗ۟ۤۢۙۘ۠ۤۖۤۘۘۤۘ۠ۢۦۧۘۨۨۜۘۦ۠ۦۤ۠ۖۘۜ۬ۢۨۨۧ۫ۤۥۘۨ۠ۨۗۘۚۘۙۧۧۢ۟ۨۨۗ۟۫ۦۘۢۡ۫ۛۨۧۘ۬ۙۘۘۜ۟ۥۘۧۗۖۘۧۗۗۘۤۖۜۦۖۘۙ۫۫ۚۧۨ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-243870863)) {
                                                    case -1150992487:
                                                        String str5 = "۫ۨۦۖۢۚۤۥۡۜۗۖۘۦۡۤ۟۫۟ۛۗۗ۫ۧۘۘۜۚۨۙۡۗ۫۫ۢۙ۠ۡۘ۠ۤۦۘۛۦۘۘۘۖۖۢۘۚۛۧۘۘۨۜۤۥۖۧۘۖۜۥۘۚۥۨ۫۬ۜۙ۫ۛ۬ۙۘۦۧۘۢۙۦۘ۠ۗ۟ۜۢ۠۫ۙۖۛ۟ۢ۠ۘۦ۫ۘۜۘۥۚۨۖۤۜۥۛ۟";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ (-27603859)) {
                                                                case -1175258550:
                                                                    str5 = "ۧۤۥۙ۬ۖ۬ۤۦۘۡۨ۫ۘۖۦۘۚ۠ۡۘۥۗ۫ۤۧ۠ۢ۟ۨۧۖۤۖۧ۬ۧۛۢۡۖۜۘۧۚۛ۬ۛۘۖۘۛ۫ۡۖۗۧۖۗۜۘۘۨۤۚ۬ۧ۫۫ۛۙ۫ۨۘۙۦۘۘۦۗۙۡۥۛۧ۟ۦۨۧۢۧۘۤۤۧۖۧۧۖۘۢۚۚۡۥۡۘۖۥۢۜۜۦۘۗۚۦۙ۫ۛۦۨۖۢۡۘۨۨ۬۟ۥۦۘۥۙۦۦۜۢۜۜۚۚ۠ۡۘ";
                                                                case -985139906:
                                                                    String str6 = "ۛۗۧۥۦۜۘۦ۫۬۠ۙ۫ۧۤۚۨۙۧ۫۟ۦۖۨۖۦ۟۟ۢۜۨۘۙۗۗۗۥۘۤۛۖ۫ۥ۬۟ۨۙۧۙۨۢۨ۟ۤ۠ۙ۠ۗ۠ۦ۠۟ۙۡۘۡ۫ۡۨۙۛۚ۬ۤ۟۟ۦۦۧۜۘۢۚۥۨۚۤۘۛۖۨۛۧ۬ۧۦۘ۫ۧۚۦۚۚ۬ۚۤۢ۫ۙۤ۟ۦۘۜۥۡۚ۟ۖۘ۫ۗۜۚۖۚۙۛ۠ۨۧۨۜۜۥۡۢۥۦۜ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ (-1510600666)) {
                                                                            case -1706033574:
                                                                                str5 = "ۚۚۢۦۖۘۢۘۥ۫ۢۙۛ۟ۨۘۛۧۨۡۨۧۛۙۥۚۦ۠ۤ۫ۖ۬۠ۜۘۗۦ۟ۚۤۛۚۚۥۧۗ۠۬ۥۖۘۧۢۛۥۜۡۤۧۖۡۖ۬ۚ۟ۖ۟ۚۙۨۖۘۙۛ۫ۥۖۧۘۤۗۢۧۗ۠ۧ۠ۥۙۖۧۡۗۧۗۢ۠ۨۜ۫۫ۚۤۜ۟ۦۤۡۢ";
                                                                                break;
                                                                            case -1704925099:
                                                                                str6 = prefsInstance == null ? "ۚۜۨۘ۟ۗۦۢۜۙۜۖۛۢۘۦۘۖۡۡ۟۫ۗۜۦۡۜۥۖۖۨۜۘۨۙۜۛۖۛۡۤ۫ۜۖۦۘۜۚۥۘ۠ۖ۟ۖۛ۬ۙۥۘۘۗۧۘۘۛ۬ۤ۟۟۬ۧۖۗۥ۠۬ۧۜۤۛ۫ۤۡۧۥۨۘۜۘۥۘۙ۬ۜۢۨۗۜۦۘۘ۫ۜۡۢۡ۫ۨ۫ۥۘۧۛۘ" : "ۨۘ۠۬ۡۖۘۤۖ۟۬ۜۗۧۨۥۘۥۘۘۙۢۘۘۡۘۦۢۛۥۢۛۙ۫۬ۨۘۖۙۡۥۚۨۘ۫ۛۙۡۙۜۘ۫ۘ۬ۖۧۧۢۛۦۡۛۜۘ۠ۨۘ۬ۤۡۘ۫ۨۦۖۢۛۧۚۘۘۢۙۦ";
                                                                            case 410207464:
                                                                                str5 = "ۗۡۡ۠ۦۥۖۤۖۦ۟ۨۛۢۛۨۤ۫۬ۙۤۥۤۙۘۤۘۢۧۛۡۘ۠ۘ۠۬ۥۧ۬۬ۥۗۚۤۙۥۙۦۜ۫۬۟ۖۚۜۥۧۘۦۢۖۤ۬ۦۘۚۚۥۢۡۦۘۤ۫۫ۛ۠ۜ۟ۥ۟ۛۦۘۦۗۥۘۛۨۗۡۙۖۧۘۨۘ۬ۘۦۙۖۦۨ۠۟ۡ۫ۡۢۤۤۚۨۨۘ۫ۚۘۘۨ۠ۖ";
                                                                                break;
                                                                            case 1947205362:
                                                                                str6 = "ۘ۬ۙ۫ۨۖ۫ۢۤۛ۬ۡ۫ۘۡۘۗۚۤۡۦ۫ۘۙۘۚۚۨۘۛۨ۬ۜۘۧۘۚۚۘۗۧۜۘۦ۫۫ۢ۫ۢۙۘۤۡ۠ۥ۬ۤۖۘۗۧ۟۬ۗۡۚۛۘ۟ۥۦۡۛ۠ۡۡۘۖۥۖۡۡۜۡۢۘ۟۫ۘۘۛۨۡ۟ۚ۠ۖۦۦ۟ۧۡۘۛۗۜۘۖۥۢ۫۫ۨۘ۬ۙۢۜۧ۟ۙۗۜۘۗۛۥۘۤۢ۫ۗۙ۟۬۬۠ۘ۠ۨۘۢۤۘ۟ۗ";
                                                                        }
                                                                    }
                                                                    break;
                                                                case 296674341:
                                                                    str4 = "ۛ۟ۤ۠ۥۖۘۙۡۚۥۨۛۧۜۨۥۦۦۘۧۜۡ۠ۜ۠ۤۖۧۘۗۡۦۘۖۥۗۥۗۜۘۚ۫ۙۥۨۡۦ۟ۡۘۦ۬ۤۥۨۘۘۤۤۥۘۡۨۜۥۖ۠ۤۖۘۜۤۖۛۙۙ۫ۢۚۥۚۜ۬ۧۛ۟ۡۙۖۡۖۦۘۢۢۜۧۨۖۘۦۚۢۜۤ۠ۛ۟ۥۘۘ۬ۨۗۤۛۘۖۜۤۡۘ۫ۢۤ۬ۚۨۙۗۖۘۚۖۡۘ۫ۚۗ۬۟۬۟ۦۧۘ";
                                                                    break;
                                                                case 1838884884:
                                                                    str4 = "۫ۗۘۘۗۘۦۘۗۨۖۘۥ۟۫ۦ۟ۥۥۘۢۗۛۡۜ۟ۧۙۙۤ۬ۥۥۘۧۘۥۜۛۖۦۥ۠ۙ۫ۗۘۖۚ۟ۜۘۡۛۡۘۛۙۛۤۗۡۘ۠ۥۡۘۗۚۡۚۙۡ۬ۦ۫ۛۤ۫۫ۡ۫۟ۤۙۖۜۘۨۚۛۧ۠ۢ۠ۨ۟ۗۢۡۘۨۛۘۙۙۡۘۛۗۛۛ۟ۜۘۧۘۜۤۜۘۚۘۡۧ۫ۙۜۘۥ";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case -556409842:
                                                        str3 = "ۗۢۖۤۘۧۧۖۘۙۥۛۘۥۛ۠۟ۤ۫ۡۢۚۥۢۨۨۨۚ۟ۡۘ۬ۖۦۧ۠ۨ۬۫ۛۖ۫ۤۗۚۦۦ۬ۙۨۡ۠ۖۡ۟ۦۜۜۡۙ۠ۚۜۘ۫ۥ۟ۥ۬ۙۜ۫۟ۗۛ";
                                                        break;
                                                    case -198152641:
                                                        str3 = "ۤۨۥۧۥۘۘۥۜۧۘۗ۬ۡ۟ۖۧۧۧ۟ۚۖۖۥۜۥ۠ۙۖۘۡۚۛۖۧ۫۟ۜۜۨۗۙۢۧۘۘۜۚۧۧ۠ۧ۟ۨۧۘۨۙۤ۬ۙ۬۠۫ۘۘۚۜۙۤ۠ۘۚ۟ۡۦۡ۬ۛۜۙۘۥۘ۫ۨۚۚۖۖۤۥۦۘۥۛ۫ۖۗۥۘۜۘ۬ۜ۠۬۟۟۫ۘ۫ۧۤۜۘۙۡ۟ۙۤۜۘۦۚۤۘ۫۟ۖۙ۬ۙۛۦۢۚۤۘۘ۠ۧۘۜۘ";
                                                        break;
                                                    case 1539828222:
                                                        str4 = "۠ۛۙۧۘۡۘ۬ۨۥۘ۟ۢۢۤ۬ۛۚۖۤۨۘۜ۟ۖۘۜۢۚۧۦ۟ۥۦ۟ۡۖۡۖ۟۬۬ۨۜۛۘۘۨۘۚ۬ۚۦۘۧۥۖۘۨۗ۫۠۟ۖۗۚۚۦۘۗۗۘ۟ۥ۟ۡۥۥۚ";
                                                }
                                            }
                                            break;
                                        case 1469625529:
                                            str2 = "ۖۡ۬۬ۛۥۘۛۘۘۘۡۗۤۦ۠ۡۘۦۘۙ۟ۢۜۘ۟۟ۗ۠ۤ۟ۗۖۖۤۨۨۛۨۘۚۤۘۘۜ۠ۦۨ۟ۡۤۚۨ۠ۥۗۘۤۧۘۨ۫ۘۛۛ۫۠ۤۙۚ۠ۤ۫ۢ۟ۥۗۥۧۥۘ۟ۧۘۘۘۗۙۚۛ۠ۥۗۡ۬ۡۘ۠ۨۡۘ۫۟ۥۚ۫ۧۚۜۚۧۙۗۡۘۨۘ۟۟ۙۦ۠ۘۢ۬ۧ۟ۡۗۡ۟ۚۦۘۘۖۗۡۘۢ۠ۚۧۡۘ";
                                            break;
                                    }
                                }
                                break;
                            case -1702146091:
                                str = "۠۟ۥۘ۠۫ۗۘۛۛ۬ۙۥۡ۫ۧۦ۫ۛۢۖۛ۬ۜ۫ۙۦۖ۬ۜۘۥۗۘۘۖ۟ۙۤۚۧۢۦۧۘ۟ۙ۬ۜۨۘۘ۟ۙۨۘۤۘۜۘۙۜۚۖۙ۟ۢۢۢ۫ۘۗۨۛۙۛۛۧۤۢۦۘۚۛۤۢۙۥۘ۫ۢۛۢ۠ۖۜۘ۬ۨۡۘۡۚ۬ۡۨۥۘۖۡۛ۫۟ۡۘۜۘۦۘۨۜۘ۠۟ۨۛۨۜۘۚۛ۬ۛۗۜۘ۫ۚۤۦۦۗۚۡۖۘ۫ۧۦ";
                                continue;
                            case 1446055821:
                                str = "ۢ۠ۡۘۗۜۖ۟ۛۘۘۛۧۜۘۢۧۜۘۥۙۥۖۛۜۘۢۧۥۘۥۧۜۘۚ۠۫ۢ۠ۤۢۙۧۨۤۜۘۧۚۙ۟ۢۥۘۢۥۨۘۜ۠ۛۖۥۢۙۖۚۤۢۗۨۗۡۘۙۨۥۛۚۗۘۧۘۘۖۘۗ۬ۜۦۢۡۖۗۘۦۜۘۗ";
                                continue;
                            case 1498389904:
                                str2 = "۠ۨۗ۟ۢ۟ۗۘۧ۫ۨۧۘۤۤۢۚۢۦۘۢۢۤۚۘۥۜۘۘۘۚ۬ۖۘۧۛۥۢۦۡۗ۬ۛۙۜۘۧۗ۠۟ۘۥۘۖۖۖۘۢۜۧۘۗۚۛۦۜۜۘۘۗۜۗۛۙ۠۠ۙ۠۫ۛۦ۬ۜۘ";
                        }
                    }
                    break;
            }
        }
    }

    public static FPrefs with(Context context, String str) {
        String str2 = "ۖۧۥۘ۟۫ۦۥۗۜۛ۬۟۫۬ۡۤۜ۬ۧۧۖۘۤ۠ۥۜۦۖۘۤۦۤۧۤۜۘ۬ۖۜۜۘۦۘۙ۠ۥۘۛۡۜۘ۫ۨۗۗۘۤۦۨۖۘ۠ۙۤۤ۫ۖ۬ۛۨ۫۟ۘۘ۬ۖۨۘۜۗۖ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 261) ^ 649) ^ 783) ^ 479) ^ 181) ^ 337) ^ 969) ^ 383) ^ 499) ^ 3) ^ 590) ^ 49) ^ 616) ^ 193) ^ 499) ^ 260) ^ 393) ^ 220) ^ 449) ^ 133) ^ 666) ^ 591) ^ 379) ^ 71) ^ 122) ^ 447) ^ 61) ^ 606) ^ 781) ^ 941) ^ 997) ^ 2100615527) {
                case -1767767014:
                    prefsInstance = new FPrefs(context, str);
                    str2 = "ۖۘۡۘ۫ۦۘۦۖۛۙۢۜۘۚۖۚ۬ۧ۬۠ۨ۫ۨ۟ۡۘ۟ۙۦۜ۠ۥۧۗۘۘ۫ۧۤۚۢ۠ۡۜ۫۟ۜۜۘۙۖ۫۫ۨۥۘ۠ۜۧۘۡۤۜۨۜۨۤ۟۫ۛۥۙۤۚۨ۠۫ۛۘۦۥۜۢۘۘۙۜۡۜۢۡۧۙ۠ۜ۠ۧۜۢۧ۫ۜ۟ۥ۟۬۠ۨۥۗۜۜۘۜۖ۫۠ۤۘۘۡۗۤۧ۫ۥۘۘۛۖۚ۠ۥۘ۫ۥۖۤۢۤ۫ۥۧۤۢۨۘ";
                    break;
                case -1422423736:
                    str2 = "ۤ۠ۗۜۗۡۘۢ۠ۤۥۨ۟ۧۙ۫۠ۦۡۢۜۡۛۙۜۘۙ۫۫ۖ۟ۜۘۖۖۢۜۘۛۨ۬ۨۨۛۘۘۙۦۖۗۗۖۘۜۗۘۛۘۖۢۛۤۙ۫ۘۘۧۢۢۜۤ۬ۡۥۜ۠ۜۘۙۦۦۦ۠ۚ۠ۚۧ۟ۧۧ۫ۚ۬ۗۤۥۘۛۛۗۚۧ۫۬ۢ۫۟ۥۖۚۜۧۧۢۧۢۥۗۛۛۗۡۖۙ۫ۨۡۥۖ۠ۙۨۘۧۢۘۨۡۜۘۤۜۜ";
                    break;
                case 545933108:
                    String str3 = "ۗۛۖۘۙۡۜۘ۟۟۟ۡ۫ۤ۠ۚۖۘۗۗۜۘۧۡۘۘۘ۫ۜۘۚۧۥۦۛ۠ۗۚۙ۬ۢۗ۫ۡۘۧ۫ۡۘۙۙۛۘۛۡۘ۟ۖۨۘۖۡۢ۟ۥۙ۬ۛۚ۟ۦۗۨۙۜۘۗۡۡۜۙۗۙۗۦۜ۬ۜۡۢۨۥۤۖۘ۫۠ۗۜ۫ۦۨۨۘۘۢ۟ۥۘ۫ۨۧۙۗۗۧۜۗۖۘۘۤۙ۫ۢۗۘۢۥۦۖۥۘ۠ۢۘۘۦ۠۫۬ۢ۬ۛۚۖۘۙۡۛ";
                    while (true) {
                        switch (str3.hashCode() ^ (-784820693)) {
                            case -1775724867:
                                str2 = "ۖۘۡۘ۫ۦۘۦۖۛۙۢۜۘۚۖۚ۬ۧ۬۠ۨ۫ۨ۟ۡۘ۟ۙۦۜ۠ۥۧۗۘۘ۫ۧۤۚۢ۠ۡۜ۫۟ۜۜۘۙۖ۫۫ۨۥۘ۠ۜۧۘۡۤۜۨۜۨۤ۟۫ۛۥۙۤۚۨ۠۫ۛۘۦۥۜۢۘۘۙۜۡۜۢۡۧۙ۠ۜ۠ۧۜۢۧ۫ۜ۟ۥ۟۬۠ۨۥۗۜۜۘۜۖ۫۠ۤۘۘۡۗۤۧ۫ۥۘۘۛۖۚ۠ۥۘ۫ۥۖۤۢۤ۫ۥۧۤۢۨۘ";
                                continue;
                            case 728290287:
                                str2 = "۠ۚۘۘۖۢۤ۟ۙۦۗۧۘۦۙۜۘۜۤۙۡۙۘۘۤۤۘۘۧۨۖ۠۫ۗۤۚۘ۟۟ۜۛ۬ۜۘۦۦۘۘ۟ۡ۫ۜۧۦۘۜ۫ۢۥۦۦۘ۟ۘۤۗۡۧۥۙ۠ۨۖۘۘۛۧۡۘۨۦۜۢۛۘۚۚۖۨۦۡۨۧۡۦۙۛۢۙۦۥ۟ۢۘ۟ۖۖۧۚۧۡۙۙ۫ۧ۟ۜۘۛ۫ۥۘۧۖۨۘۗۨۧۘۙۦۡۘ";
                                continue;
                            case 2132795807:
                                str3 = "۟ۢۛۤ۬ۦۘۚۡۗۙۧۖۘ۟ۜۦۘۧ۬ۙۦۙۘۘۚۤۗۘ۬ۡۦۨۘۦۗۧۜۜۡۘۚۜۚ۬ۙ۫ۖۚۨۘۗ۬۫۫ۧۦۘ۠ۘۙۨۙۡۤۢۡۚۥۨۤۨۖۧۢ۬ۚۖۤۛۡۜۗۘۘۖۥ۫ۗۙۦۘ۠۬ۖۨۛۢۜۧۘۘۨ۠ۜۙۦۤۘۗۦ۬ۤۨۘۛۗۡۢۥۜۘۥ۟ۜۘۦ۠۬ۜ۟ۡۘۤۘۧ۟۠۠ۧۘۙۧ۬ۡۡۖ۟";
                            case 2147006763:
                                String str4 = "ۥ۫ۚۦۡۖۘۖۡۡۘۤۡۡۘۘۡۡۘۦ۟ۗۥۨۘ۫ۜ۠ۚۙۡ۟ۢۨۛ۬ۛ۠ۖۘۨۛۘۘۨۜۡۘۨۛۨۘۗۨۡۥۡۡۥۡۙۛۤۢۡۙۗۧۥ۬ۙۦۘۨ۠ۨۗۛۡۘۢۚۤ";
                                while (true) {
                                    switch (str4.hashCode() ^ (-1741479695)) {
                                        case -1483632237:
                                            str3 = "ۜۖۖۘۙۡۦۘۤۘۧۚۖۜۙ۠ۤۢۗۦۘۜ۬ۢۥۢۦ۬ۢۖۧۖۘۙۡۛۗ۠ۛۢۡۘۖۚۨۘۛۚۜۚ۬ۥۢۨۡۜ۬۠ۜۚۜۘۡۚ۟ۙ۬ۚۙۛۖۘۛۡۢۙۖ۬ۤۤۨۘۘۛۗۙۖۜۘ۬ۖۥۤۗۙۗ۟ۛ۟ۙۚ۠ۗۥۥۘ۟۫ۖۘۤۚۤۡۖۧۘۦ۫ۧ۬ۤۜ۬۠ۦۘۛۨۛ";
                                            break;
                                        case 639948608:
                                            str3 = "ۗۧۡۘۜۜۥ۠ۢۨ۫۬ۨۘۢۖۧۘۡۘۜۥۧۙۙ۬۫ۗ۬ۛۡ۠ۢۤ۟ۚ۫ۥۘۜۖۦۧۤۦۖۘۥۖ۫ۢ۟ۥۘ۫ۜۙۨۨۜۧۧۖۘۡۡۖۥۘ۟ۥۨۖۘۛۦ۫ۦۜۦ۫ۛۨۥۥ۠ۥ۟ۘۘۤۛۢ۫ۘۢۚۢۘۘۖۢۖ۫۠ۚۨۖۘۘ۟ۧۦۘۨۦ۠ۗ۟ۖۚ۬ۚ۟ۖۗۤۢۡۘ۟۠ۡۗۦۛۜۡۙۢۗۙۧۘۙ";
                                            break;
                                        case 1449681179:
                                            str4 = "۠ۧۡ۟ۦۚ۫ۗۘۘۦۥۢۦۥۨۥۜۤۚ۫ۛۢۢۧۦۖۦۘۙۥۖۢ۬ۘ۫۟ۡۘۗۖۚ۬ۦۨۨۨۢ۫ۜۖۘۡۡ۬ۜۖۧۙۥۜۦۤۗۚۦ۫ۧۚۨۘۚۢۡۡۗۙۖۜۧ";
                                        case 1638482574:
                                            String str5 = "ۡۨۢۧۧۘ۫ۗۢ۠ۖۧۘۙۚۘۧۢۧۡۖۥۘۖۜ۬ۚ۠ۨۥۚۨۘۤۜۧۛۨۥ۠۫ۘۘۖۦ۬ۦ۟ۡۡۜۜ۬ۖۙۧۛۗ۟ۥۤۤۙۚ۟ۢۨۦۤۜۘۙ۟ۥۘ۠ۧۤۦۚۨ";
                                            while (true) {
                                                switch (str5.hashCode() ^ (-1336370461)) {
                                                    case -2011831376:
                                                        str5 = "۫ۛۚ۫ۥۖۥۡۚۘ۟ۛۧ۟۟ۨ۫ۡۘۦۛۘۗۦۡۨ۬ۚ۟ۡۚۜۥۡۘۚۧۨۨ۟ۖۘۛۢۨۛۛۨۙ۬ۥۡۡۛۜ۠ۢۢ۫ۘۤۧۜ۬ۛۚۥۜۘۜۘۗۥۚۥۘۤ۬ۡۗۚۖۘۚۢۘۙۡۤۥۗۛ۫ۙۛ۟ۤۖ۟ۚۖۙۥۖۢۗۜ۟ۤ";
                                                    case -948162824:
                                                        str4 = "۟ۜۧۘۦۢ۬ۘۙۙ۠ۚۜۨۤۥۙۥۘۨۛۥ۬ۖۡۘۧۤۖۘۢۨۜۤ۠ۘۘۛۘۚۗۨ۟ۜۜۘۘۜۛۢۜۜۜۗۖۖۧۘۘۙ۠ۛ۬۟ۗۛۦۦۖۚۨۧۜۛۛۙۜۦۥۢ۫ۤۜۗۖۘۡ۫ۧۗۚۖۘ۫ۗۚ۟ۢ۠ۙۖۜۛۙۘۘ۠۬ۡۘۥۧ۫ۗ۫۟ۥۨۜۨۨۨۘۤۥ۠ۜ۠ۘۘ";
                                                        break;
                                                    case 1346282514:
                                                        String str6 = "ۨۖۜۜۛۘۘ۫۫ۦۗۙۥۤۘۘۢۦۦۛۥۗۖ۠ۡ۫ۦۨۘۤۜۨۘۙۜ۟ۗۡ۫ۤۨۖ۫ۦۘۘۢ۫ۧۛۜۧ۠ۜۘۥ۟ۛ۟ۡۢۖ۟ۦ۬ۖۦۧۡ۠ۦۖۘۙۘۡۖۧۡۘۡ۠ۧۤۢۙۦۘۙۦۚۤۧۢۨۜۨۙ۬ۤۘۘۗۥۨۨۧۗۛۥ";
                                                        while (true) {
                                                            switch (str6.hashCode() ^ 1382887292) {
                                                                case -614499697:
                                                                    str6 = "ۘۢۦۘ۠ۛۜۢۘۦۙۘ۠ۡ۟ۧۤ۟ۦۘ۟ۙۜۚۥۦۤۙ۟ۢۡۖۙۛۜ۟ۛۡۘ۫ۢۜۖ۟ۚ۟ۨۜۘۤۥۧۘۨۘۨۡۘۘۡ۬۫ۙۡۜۜۨۦۛۜ۬ۥ۟ۘۘۛ۫ۙ۠ۙۨۘۖۗۡ۠ۢۙۨۖۖ۬ۜۘۢۚۙۜ۟ۘ۫۬۬۠ۗۘۢ۬ۘۘۗۤۖۖۢ۬ۥۨۚۙۛۦۦۗۦۘ۟ۤ۠";
                                                                case -225186967:
                                                                    String str7 = "ۗۡۖۘۖۤ۫ۛۛۚۥ۬ۧۤ۠ۧۚۡۜۢۛۚۗۢۖۤۘۧۘۡۧ۬ۢۧۖۚ۫ۦۘۖۘۖۘ۠۫ۜۚۨۢۤۦ۟ۦۦۢ۬ۨۧۥۦۜۥۚ۟ۨۘۘۦۧۘۥۢۖۘ۬ۘ۬ۨ۟ۥۘۜۢۖۘ۫ۥۘ۠۬ۧۧۤۖۗ۟ۤۚۜۤۢۖۥ۬ۗ۬ۖۜۧۦۚۦۢۦۦۢۢۢۗ۠ۤ۫۠ۘۘۦ۠ۡۤۗۜۤۡۥۙۗۦۡ۬ۡۖۖۘ";
                                                                    while (true) {
                                                                        switch (str7.hashCode() ^ (-633069291)) {
                                                                            case -1570812250:
                                                                                str7 = "۟۫ۦۘ۠ۤۙۡۨۜۜۙۧ۟ۢۚ۠ۨۘۦۘۛۡۛۗۦ۫ۗۡۜۚۧۦ۬ۥۘۘۨۘۤۢۖۥ۫ۜ۬ۢۡۥ۫ۗۗۨۜ۫ۡ۠ۗ۫ۖۛۖۧۘۛ۬ۥۘۗۦۦۢۚۨۘۡ۟۠ۢۢۥۘ۟ۡۜۘۡۡۧۘۢۙ۠ۜۨۜۨ۫ۤ۬ۨۦۙ۟۫ۛۦ۟ۗۨ۠ۥۜۜۘۗۤۚ۠ۗ۬ۨۦۖۡ۠ۗۘ۠ۜۘۥۦۨۘۛ۫۠ۥۗۡۘ۠ۙۥ";
                                                                            case 94735856:
                                                                                str7 = prefsInstance == null ? "ۤۜۥۘۤۧۖۘ۠ۚۡۥۘۧۘۜۧۡۗۢۥۡۚۜۢۡۘ۟ۨۧۘۡۙۙۢۡۘۙۤۨۜ۟ۖۘۜۥ۬ۚۗۥۚۧۥۚۛۨۘۥ۟ۡۘۜۚ۬ۢ۫ۗ۟ۖۚۧۗۖۢۜۧۜۨۖۧ۠ۘۘ" : "ۦۗۧ۬۟ۨۤۧۖۘۢۡ۟۟ۧۦۘۜ۬ۖۘۡۚۚۘۨۧ۬۫ۖۘۜۗ۬ۡۛۛۖۘۢۡۥۤۘۜ۫ۥۚۜۦۦۘۗۡ۬۠ۚ۫ۖ۬ۧ۟ۗۢۡۡۜۘ۠۠۠ۖ۬ۙۡۥۖۘۙۚۦۧۡۧۜۛۚ۟ۨۘۙۧۛۚۜۘۜۢۨۘۨۘ۫۬ۜۚۚۤۡ۠ۛۖۤۗۥۚ۟۠۟۫۠ۘۦۖۘۜۢۨ";
                                                                            case 1374366840:
                                                                                str6 = "۠۟ۨۘۗۢۤۤۨۨۘۤۖ۠ۡۜۜۘۥ۬ۨۘۖۥۚۧ۬ۥۘۤۦۚۜ۟۟ۤۘۤ۟۬۫۟ۜۥۤ۫۟ۙۖ۫ۘۥۖۘۘۖۜۥ۠ۦۘ۟ۥۙۗۚۥۤ۫ۙ۠ۨۛۦۦ۠ۡۜۦۖ۫ۜۘ۫ۜۨۗۧۖۥ۫ۙۜۗۖۘۤ۬ۦۘ۫۬۠ۚۧۦۖ۠ۥۘۘۙۨۘۜ۠ۛۨۚۦۚ۬ۨۘ۠۟ۦۘۜ۫ۖۚ۫ۙ";
                                                                                break;
                                                                            case 2112059070:
                                                                                str6 = "ۛۘۧۘۚۥۡۘۥ۟ۡۘۜ۬ۛۧۦۜۘۥۙۨۘ۟۟ۘ۠ۢۜۘۤۘۥۧۘۘۥۗۡۗ۟۟۬ۦۚ۟ۢۤۧۥۘۧۜۖۘۚۜۦ۬ۛۘۜۨۦۘۘۢۥۤۗۘ۫ۡۨۖ۟ۜۘۦ۫ۧ۬ۨۨۡۡ۫۬ۦۛۘۜ۬ۜۗۢۚۙ۬ۨۦۚ۫ۥ۠ۦۧۘۧۢ۠ۗ۠ۖۚۦ۫۫۠ۘۜۡ۠ۘ۟ۜۙۤۖ";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case 433848341:
                                                                    str5 = "ۧ۬ۧۙۦۨۥۥ۠ۡۖۥۤۤۧۘ۟۠ۢۧۜۢۦۚۛۡۘ۠ۖۛۨۢۡۧۖۚۜ۫ۖ۠ۥۨۘۨۡۧۘۙ۫۠ۚۖۨۘۨۘ۠ۚۧۤ۫ۧۡ۬ۦ۬ۥ۬ۗۥۧۘ۟۠۬ۢۡۘ۫ۦۤ۬ۜۨۘۨۤۦۥۡۤ۫ۖۥۦۖۢ۟ۘۨۙۤۙۜۗۙ۠";
                                                                    break;
                                                                case 2059764829:
                                                                    str5 = "ۥۖ۬۠ۙۢۦۖۜۘۘۗۨۘۘۧ۠۟ۖۜۘۦۧ۟ۦۙ۟ۗۜۧۡ۟ۘۘۖۦ۬ۜ۫ۘۘۘۦۥۚ۫۬ۨۦۦۢۘۧۘۢۤۥۙۗۨۘۖۘ۠۟ۘۙۗ۟ۘۜۧۤۘۢۦۧۡۢۜۗۦۘۡۖۗۗۥۗۢۚۧۚۚ۠۠ۛۤۦۖۘۤۡۨۘۖۢۢۜ۟۬ۥۘۤ";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 1865530335:
                                                        str4 = "۠ۖ۠ۜۘۖۦۧ۬۫ۚۖۘ۟ۦۚۧ۟ۘۘ۟۬ۘۦۗۜۘۖۙۡۘۘۧ۫ۜۛۛۧ۠ۥۧۡۦ۟ۛۥۘۜۙۗۧۧ۟ۡۙ۠ۦۡ۠ۖۦۘۛۗۧ۫۬ۨۘ۫ۡۖۘۜ۟۠ۛۜۦۘۨۥۘۗۛۧۚۢۘۤ۬ۜۘۙ۫ۨۘۙۜۧۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 1451751999:
                    return prefsInstance;
                case 1545462190:
                    str2 = "ۧۥ۫۟ۖۖۙۛۡۗۢۨۘۙۙۖۡ۟ۙۨۖ۠ۦۡ۠ۚۚۘۛۜ۬ۗ۬ۘۚ۫ۧ۟۠ۘۢۘۘ۠۫ۛۜۚ۟ۜۧۤۤۜۥۦۜۘۚۥۧۥۥۘۘ۬ۖۚۧۨۧۘۥۢۥۘۢۘۧۘ۠ۤۜۘ۫ۥ۠ۢ۠ۨۘۖۧۖۘۗۘۘۘۚۢۛۨۘۘۘۨ۟۬ۢ۫ۜۗۙۡۛۢۛ۟ۛۘۘۗۡۨۘ۬ۨۤۘ۟ۙ";
                    break;
            }
        }
    }

    public static FPrefs with(Context context, String str, boolean z) {
        String str2 = "ۧۙ۫ۡۤۧۜ۟۬ۚۖۙۙۛۦۜۡۛۗ۟ۙۥۨۧ۠ۘۦۛۤۜۙ۫ۜۘۗۥ۟ۡۦۡۘۜۧۤۥۨۖۤۙۦۖۘۖۘۗ۫ۦۘۡ۟ۖۘۨۙۖۘۥۘۘۗۗۚۨۥۡۗ۟ۖۙۧۘۢۜۖۛۜ۠ۛ۬ۡۘۦۨۘ۬ۤۖۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 560) ^ 854) ^ 420) ^ 200) ^ 884) ^ 373) ^ 161) ^ 1023) ^ 294) ^ 560) ^ 214) ^ 651) ^ 686) ^ 832) ^ 89) ^ 148) ^ 617) ^ 878) ^ 836) ^ 964) ^ 184) ^ 236) ^ 983) ^ 548) ^ 319) ^ 236) ^ 804) ^ 681) ^ 185) ^ 103) ^ 492) ^ (-698161119)) {
                case -1638569252:
                    prefsInstance = new FPrefs(context, str);
                    str2 = "ۘۙۘۙۖۘۘۜ۟ۥۘۗۤۖ۬۬ۜۖ۠ۜ۫ۧۥۜ۫ۛۗۘۛ۠ۜۘ۫ۖۘۧۦۧ۫۟۫ۗۨۛۧۙۘۘ۠ۥۜۖۛۙۘۘ۠۠ۢۨ۫۬ۖۘۨۨ۫۟۟ۦۘ۠۟ۜۡۧۙۚ۬ۙ";
                    break;
                case -901664860:
                    return prefsInstance;
                case -764368840:
                    str2 = "ۘۜۦۥۦۙۦۢۙۗۦۤ۫ۙۢۨ۫ۦۚۢۦۘۡۧۘۘۡ۟ۛ۟ۛۖۛۦ۫ۨۧۦۜ۟ۡۖۛۜۧ۟۬ۛ۬۬۟ۛۛۗۚۤۛۥ۟۟ۥۘۖۗۛۦ۠ۛۢۛۛ۬ۜۘۚۡۘۨۙۘۦۨۜۚ۠ۢۡ۟۬ۥۧ۫ۧۜۧۘۨۘۨۥۧۖۘۖۨ۬ۧۛۚ";
                    break;
                case -360713870:
                    str2 = "ۛۥ۠ۛۛۡۖ۬ۦۘۤۨۖۚۚۚۥۦۘۘۥۙۙۗۥۧۘۛۗۧۜۥۙۡۤۢۗۡۥۘۗۖۧۘۛ۬ۗۤۤۘۛۤۗۚۧ۬۬ۘ۫ۜۘ۫ۛۖۘۜۜۘ۫ۡ۬ۘۛۧۖ۟۠۟ۤۧۤۥۡۘۡ۟۠۬ۦۥۚۦۧۢۛۖۘ";
                    break;
                case -337939009:
                    String str3 = "ۖ۠ۙ۠ۖۖۘۙ۟ۧ۫ۚۨ۫ۜۥۘۘۢۢۘۨ۟ۥۧۙ۟ۛۜ۟ۗۙۖۨۘ۟ۨۖۦ۬ۨۘ۫ۧۜۘۜۦۜۥۨۛۛۚ۟۫ۘ۠ۦۥۘۦۚ۫ۨ۟ۖۘۨۥ۠ۨۛۘۡۢۨ۠ۚۧۙۤۤ۬ۡۢۨۧۡۜۢ۠ۡ۟ۛۧ۟ۨۘۖۛۡۘۨۛۚۨۙۦۤۦۦۘ";
                    while (true) {
                        switch (str3.hashCode() ^ 610172768) {
                            case -1348413581:
                                str2 = "ۖۖ۬ۗۥۥۡۧۥۘۙۘ۫ۤۙۜۘ۫۠ۥۘۡۤۨۘۦۤۧ۠ۚۦۚۜۘۘۛۡۦۢۘۜۘۥۤ۬۬ۤ۫ۜۙۘۘۘۧۖۘۢۧۥۘۗۥۖۘۗۥۚۙ۫ۚۙ۬ۛۡۧۚۜۛۙۗۤۥۤ۟ۢ";
                                continue;
                            case 759515233:
                                str2 = "ۘۙۘۙۖۘۘۜ۟ۥۘۗۤۖ۬۬ۜۖ۠ۜ۫ۧۥۜ۫ۛۗۘۛ۠ۜۘ۫ۖۘۧۦۧ۫۟۫ۗۨۛۧۙۘۘ۠ۥۜۖۛۙۘۘ۠۠ۢۨ۫۬ۖۘۨۨ۫۟۟ۦۘ۠۟ۜۡۧۙۚ۬ۙ";
                                continue;
                            case 1404042380:
                                String str4 = "ۜ۫ۚۥۜۧۘ۫۟ۛۛۥ۬ۧۖۤۤۛۖۘۧۜۚۦۨۛۚۘۦۙۛۛۖۛۛۜۧۚۨۦۧۘ۟۟ۘۘۤۘۥۡۤۙۦ۟ۡۛۤۢ۠ۥ۠ۚۜۚۚۤۤۨۥ۠ۨۤۘۘۡۖۛۨۦ۠ۚۧۗۘۘۦ۠ۧ۠ۧۚۧۚ۠۠ۥۙۨۦۥۘۦۜۗۦۚۡۘۢۛ۠ۤۨۡۘۚ۫ۤۦۢۢ۬ۢۡۜۚۥۘ۠ۚۢۘۤۦۘ۬ۥ۠ۖۙۦ۬ۜۜ";
                                while (true) {
                                    switch (str4.hashCode() ^ (-1746683498)) {
                                        case -425378656:
                                            String str5 = "ۧۛۡۗۗۤۖۨۗ۬ۧۙ۠ۤ۟ۚۧۧ۠ۧۥۘۖۜ۟ۥۜۜۤۙۡۢۘۙ۠ۛۥۘۖۘ۫ۨ۬ۜۖۜۖ۠ۖۖ۠ۨۛ۫ۚ۬۟ۦ۫ۨۧۖۜۗ۫۟۬۟۬ۥۖۦۡۤ۟ۙ۠ۜ۠ۘۜۜۜۘۖ۟ۗۘۚ۠ۙۙۢۙۧۚۤۤۢۜۘۦ۬ۥۧۘۙ۠ۥۘ۟ۗ۟ۦۛۖ۠ۤ۬ۦۤۙ۠ۡ۟ۤۡۘ۠ۥۘۨ۫ۢۘۤۖۖۡۧ";
                                            while (true) {
                                                switch (str5.hashCode() ^ 451888251) {
                                                    case -1556677838:
                                                        str4 = "ۨۜۗ۬۫ۤۨۦۘۡ۬ۙۢۧۘۘۧۘۖۙۦۛۙ۟ۥۡۛۡۗ۟ۜۘۛۥۥۦۤۙ۫۟ۘۧۛۛۖۡۦۛۜۘۦۦۧۘۡۥۚۢۜ۬ۗۦۜۘۘۗۘۘۥۙۥۛۦ۬ۙ۫ۚ۟ۖۘۜۖ۠ۘۢۖۘۙۥۧۘۧۥۘ۫ۙۖ";
                                                        break;
                                                    case -937960940:
                                                        str5 = "ۖ۫ۨۘۖۢۖ۬ۥۜۙ۬ۤۨۘ۟ۘۙ۬ۛ۟ۗۦۢ۫ۙۤۛۙۙ۬۫ۤۥ۠ۥۘۢ۫ۦۘۘۨۜۘۧۛۜۘ۫ۧۤۗۜۖۘ۫ۘ۫ۤ۠ۖۘۧۨۦۘ۬۬ۥۘۢۗۘۥۥۨ۟ۙ۠ۦ۟ۖۛۡۖۥ۫ۘۢۨۗۢ۠ۛۧۤۡۘ۟ۤ۟ۤۡۤۗ۟۬ۜۜۦۘۦۨۧۘۥۢۦۙۙۨۖۡۢ۟ۚۥۘۦ۬ۛۥۧۘ۬ۗ۬ۜۗۡ۠ۖۡۘۖ۬ۘۘ";
                                                    case 1089446765:
                                                        str4 = "ۡۙۨۘ۟ۙۤۤۚۦۦۖۢ۠ۜۧۘۙۖ۬ۤۥۦۘۗۘۧۢۚ۫۬ۥۘۘ۬ۡۙۘۤ۬۟ۡۦۘۖۚۨۘۚ۫ۢۡ۬ۙۘۛۖۛۗ۬ۗۢۘۘۚۙۢۤۥۘۘۨۗۛۥۦۨۘۢۧۧۥۡۤ۬۬ۦۥۘ۬ۜۢۜۥۜۨۡۢۜۘۘۡۛۥۤۦۚۗۧۗۦۚۛ۠";
                                                        break;
                                                    case 1720253031:
                                                        String str6 = "۠ۘۤۢ۬ۤۧۥ۟ۨۚۡۥۖۘۦ۫۫ۜۤۨۧۗ۫ۢ۫ۖۘۢ۟ۨۛۢۖۘۗۛۦۢۗۜ۟ۙۡۘۚۘۖۘۢۢ۫۫ۛۨۘۘۚۧۡ۟ۡۙۙۖۡۦۗۛۖۚۗ۟ۥۙۤۦۢۘۛ۠ۤۚۧ۬۟ۤۘۘ۟ۥۙۦۛۡ۠ۙۦۛۥۨۘ۬ۚۡۘۤ۠ۢۧۨ۟ۗ۫ۡۘۤۥۗۧۡۜۧۛۗۜۥۦ";
                                                        while (true) {
                                                            switch (str6.hashCode() ^ 607568730) {
                                                                case -1960064582:
                                                                    String str7 = "ۦۡۡۤۤۖۘۦ۟ۡۖ۫ۨۧۤۜۘۤۚ۫ۦۤۡۘۗۨۜ۠ۤۡۘۜ۟ۛ۠ۜۦۘۛۚۚ۫ۡۦ۟ۗۘۘۚۗۡۘۙ۫ۦۥۨۘۘۥ۬ۥۤۚ۫۫ۦۚ۠۫۬ۘۜۨۢ۟۫ۥۢۡۖۙ۟ۗ۟۟ۘۤۧۡۡ۟ۖۖ۫ۨ۬ۖ۠ۜۛۧۦ۬ۦ۟ۜۤۙ۟۠ۤۥۗ۟ۧۛ۟ۛۖۗۗۘۜۡۛۙ";
                                                                    while (true) {
                                                                        switch (str7.hashCode() ^ 275321493) {
                                                                            case -1659236838:
                                                                                str6 = "ۚۙۨۧۚۧۛ۟ۡۘۨۨ۟ۜۥۨۖۧۧۛ۠ۘۨۡ۫ۘۢۜۘۤۜ۫۠ۧۖۤۗۗۗ۠ۨۨۦۘۤ۬ۖ۟ۥۚۦۤ۠ۨۘۗۦ۠ۜۘۜۘۧۛۜۚۥۘۘ۟۬ۤۢ۟ۦۗۧۤۙ۠ۥۘ۟۠ۖۘۚۛۘۘۦۡ۠ۦۘۡۘۨۙۡۘۦۤۘۨۡۧۘۘۨ۠۬ۤۜۘۘۨۢۢ۠ۚۨۖۘۧۦۢۢۜۗ";
                                                                                break;
                                                                            case -909202417:
                                                                                str7 = z ? "ۡۢۘۙۧۦۡۛ۬ۙۧۧۜ۬ۖۧۨۥۨ۟۫ۛ۫۫ۜۦۛۜۛۜۥۘ۬۟ۥۥۘۜۘ۫ۙۘۡۢۙۜ۟ۤۦۜۡۖۗۘۘۤۜۥۖۡ۫ۧۙۦۘۗۛۖۘۧۧۨۘۤۘۨۢۦ۬ۛۤۢۧ۟ۜۗۥۘ۠ۜ۟ۨۤۢ۫ۛۜۡۜۘ۠ۜۗۜۨۘۘۤۥۨۘ" : "ۤۙۡۤۧۙۦۥ۠ۢۗۥۨۚۘ۫ۛۗۙۜ۬۠ۛۖۜۚۖۘۘۘۧۗ۫۠ۤ۟ۨۚۜۚۨۨ۫ۡۘۡۦۛۗۛۡۘۗۚۘۢ۠ۥۘۙۘ۫ۥۙۨۚۜۡۘۘۥۡۘۨ۬ۤ۫۬ۨۘ۬ۡ۬ۥۨۘۡۤۚ۠ۡۦۚ۫ۙۤ۠۠ۛۥ۠ۘۧۙ۬ۜۖۥۨۥۘ";
                                                                            case 1811618894:
                                                                                str6 = "ۥۜۙۜۨۚۥۢۛۙۛ۬ۧۜۖۚ۫ۥۘۙۘۘۙ۠ۛ۟ۙۖۘ۬ۤۚۥۚۥ۠ۦۖۦۗۛۚۘۘ۫۬ۨۘۥ۟ۘۖ۟ۨۘ۬ۥۙۙۖۖ۬ۦۛۧۡۘۦۙۜۗۢۢۖۚۚۜۗۢ۟ۥۢ۠ۢۗۥۜۜۘۧ۟ۡۘ۫ۜۧۘۜۤ۬ۡۨ۠ۢۚۖۚۖۗۜۦۥ";
                                                                                break;
                                                                            case 1983227521:
                                                                                str7 = "ۥۘۦۡۗۢ۟۬ۖۘۤۜۖۘۨۖۖۖ۟ۡۜۛۘۜۙۙۛۨۖۘۥۤۥۜۡۘ۫ۢۘۘۖ۠ۡۥۘۦۥۤۨۘۥۚۡۘ۠ۜۨۘۘۨۥۘۖۦۦۘۤۨۨۨۖ۠۫ۗۗۦۛۗۛۤۢۨۡۘ";
                                                                        }
                                                                    }
                                                                    break;
                                                                case -493569241:
                                                                    str5 = "ۨۚۥۘۙۡۤۘۘۧۖۘ۫ۙۦ۠ۦۦۥ۟ۙۨۗ۬ۙ۠ۦ۫ۡۗۦۘۡۨۙۢۢۡۥۗۤۨۨۦۘۥۙۢۨۤۜۘۚۘۖۘۧ۟۠ۤۦ۠ۜۦ۠ۡۢۡۘ۫ۡۜۧۥۜۘ۟ۦۛۥ۠ۙ";
                                                                    break;
                                                                case -339363354:
                                                                    str5 = "۠ۨ۠ۜۦۥۙۧۡۥ۠ۚۜۦۨۘۙۨۘۥۜ۫۫ۧۦۘۜۖۖۘۚۙۘۖ۟ۨۢ۟ۖۘ۬ۚ۠ۚۗ۬ۛۦۧ۠ۨۛ۬ۡۤۖ۠ۛۚۦۢۛ۠۟ۙ۫۠ۜۦۘ۟۠ۙۜۚۖۘۙ۬ۖۚۤۥۢۚۥۘۜۙۨۚۦۤۘۢۨۜ۫ۖۘۙ۫ۙ۬ۨۨۘۛ۫ۢۜۙ۫ۡۙۥۘ۬۬ۜۘۥۗۘۛۜۗۛۙۖ";
                                                                    break;
                                                                case 1198305093:
                                                                    str6 = "۬ۚۘۘۖ۫ۤۖۢۥۡ۟ۦۚۦۢۗ۬ۥۥ۠۟ۖۜ۫ۡۜۛۡۨۘۥ۫ۜ۫ۙۤۥ۬ۚۨۥ۫۫ۚۖۚ۬ۖ۟ۚۦ۫ۥۥۘ۫ۥۤ۟ۡۖ۠ۗۢۨۢۜ۬ۢۗۙۥۥۢۚۘۘ۬ۘۨۨۢۢۖ۫ۡۖ۠۠۬ۘۘۘۖ۬ۧۛۦ۬ۥ۠ۗ۫ۖۥۛۥۗۖۚۨۦ۫۬۬۬ۦۘ۟ۤۦۙ۠ۦۘ";
                                                            }
                                                        }
                                                        break;
                                                }
                                            }
                                            break;
                                        case 350300483:
                                            str3 = "ۢۜۨۘۛۦ۫۫ۖۦ۫۫ۦۘۦ۬ۗۚ۬ۜۘۧۖۙ۠ۙۜۘ۟ۧۙۨۨۤۡۥۨۘۛ۬ۢۚ۠ۨۘۨ۫ۖۘۗ۠ۘۘ۫۠ۨۧۚۦۤۛۥۘۙۧۜۦۙۥۘۜ۟ۖۘۙۚۗۡۛۘۖۥۙۗۙ۟ۚ۟ۨۛۙۘ۫ۖۚۧۥۗۗۤ۬ۡۡۘۤۙۦۧۛۦۘۨۧۥۖۦۖ";
                                            break;
                                        case 391039315:
                                            str3 = "ۖۨۧۘۜۥۚ۬۠ۗۧۥ۫ۖۦۦۘۙۖۧۘۖ۬ۖۢۦۥۡۥۗۘۡۜۥۦۜۧۧۗۧۙۢۖۜۛ۠ۚۧۚۖۘۥۨۖۘ۟ۛۡۘۜۛ۟ۜ۫ۙۤۥ۬ۚۦۚۧ۠ۦ۠ۜۡ۟ۖۙۥۚۥۘۥۜۡۖۦۤۡۤۧ۬۬ۨۚۢۢۜۘۚۙ۬ۥۦۜۘ۬ۛۦ";
                                            break;
                                        case 2112464440:
                                            str4 = "ۡ۠۟ۘۧ۠ۥۡۘۨۖۧۤۨۧۘۚۤۡۘۤۢۧۛ۠ۨۘ۫ۤۨۘۖۚۢ۬ۙ۬ۢۢۥۚۚۛ۬ۧۘۘ۟ۨۜۦۨۥۘۘ۫ۘ۟ۤۗۢۥۥۘۨۛۤۜۥۨۘۛۢۘۘۤۥۨ۫۫۫۬ۜۤ";
                                    }
                                }
                                break;
                            case 1852569866:
                                str3 = "ۦۜۚۤۙۢ۟ۨۚۗۖۖۘۖ۟ۢ۬ۘۘۘ۫ۙۥ۟ۗۥۘۡۛۨۘۖ۬ۖۚ۬ۥۨۦۚۘۜۜ۬ۦۖۘۥۗۥ۫ۧۤ۠ۗۙۨ۫ۗۤ۠ۨۘۤۡۡ۠ۨۢۘ۟ۤۧ۠ۨۘ۬۠ۤۜۥۨۡۛۜۛۦۨۘۜۗۦۘۡۤۦۘ۫ۤۧۙۢۗۡ۬ۢۨۡۖۘۦۛ۬";
                        }
                    }
                    break;
                case -241347256:
                    str2 = "ۧۡۙ۫ۛۢۡۘۘۘۗۘۙۦۘۦۗۡۘۨۤ۫ۚۢۚ۫ۖ۟ۘ۬ۨۢۙۦۘۢۖۜۘۗۨۨۘۚ۬ۨۘۛۙۨۘ۠ۘۛۜۜ۟۟۟ۢۗ۠ۨۛۧۨ۬۠۫۫ۚۥۚۧۨ۫ۢۡۧۜۙ";
                    break;
            }
        }
    }

    public static FPrefs with(Context context, boolean z) {
        String str = "ۛۙۥۘ۬ۡۦۙۛ۟ۤۢۢۚۡۢۢۖۘۖ۟ۘۤ۬ۨۗۘۥۘۡۜۢۢ۬ۘۨۙۦۙۗ۠۬۠ۚۦۨۛ۟۟ۨۗ۬ۛۤۤۜۘۡۘۛۖ۠ۚۚ۟ۧۘۥۥۦۤ۫ۗۢۙۗۚۜ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 664) ^ 553) ^ 117) ^ 296) ^ 559) ^ 463) ^ 593) ^ 237) ^ 469) ^ 344) ^ 758) ^ 209) ^ 509) ^ 258) ^ 462) ^ 24) ^ 173) ^ 369) ^ 692) ^ 58) ^ 569) ^ 193) ^ 425) ^ 199) ^ 928) ^ 684) ^ 641) ^ 918) ^ 863) ^ 344) ^ 296) ^ (-951043672)) {
                case -852635135:
                    String str2 = "ۛۡۤۜۖۜۡ۟ۨ۠ۚۨۛۖۧۙۜۘۤۜۤۘۘ۠ۦ۠۟ۡۤۨۘ۟ۡۛۥ۬ۥۘ۬ۗۥۙۥۖۛۗۦۘۡۨۦۘۧ۫ۖ۠۟ۦۘۙۥۜۘۥۤۗۛۨۚۨ۟ۜۘۛۢۜۜۦۘۘ۟ۨ۫۫ۨ۫ۥۥۜۨۖۗ۠ۦۖۘۡۡ۟ۥۗۥۘۢۜۥۘ۫ۜ۬ۘۦۘ۠۟ۥ۬ۖۥۘ۬ۚۜۘۨ۠ۖۘ۟ۥۚۦۜۧۘ۟ۤۡ۬۟ۡۘۥۘۗۤۛ۫ۗۙۨ";
                    while (true) {
                        switch (str2.hashCode() ^ (-1101477936)) {
                            case -1608367181:
                                str = "ۜۗۗۚۘۘۧۤۜۘۨۖ۠ۦۖۖۘۦۗۦۘۛۡۙۛۢۘۘۦۥۥۘۢۡ۟ۙۘۘۡ۟۫ۡۨۘۨۖ۬ۨۡۨۘۤ۬ۜۘۢ۬ۨۘۥۛۥۗۤۨۘۖ۠۬ۡۨۖۗۖۜۥ۠ۜۘ۠ۖۥۥ۟۟ۨۥۦۦۡ۫ۢۖ۬ۖۢۨۘۡۢۖۖۚۥۘۜۖۘۘۡۢۨۡۚۤۦۚۜۘۡ۟ۡۡۖۥۧۤۖۜ۫۠ۖۦۨۘۙۖۤۖۗۜۘۗۢۗ۟ۥۜۨۖ۬";
                                continue;
                            case -666968528:
                                String str3 = "ۖ۬ۥۘۘۡۗۤۤۚۘ۫ۦۘ۫۠ۜۖۥۜۨۖۘۢ۬ۨۢۘۢۡۛۛۗۗۧۧ۬ۖۘۗۡۚۚ۠۟ۡۦۧ۠ۘۢۗۜۚۦۖۖۘۙ۠ۥۘۗۛۤۖ۟ۘۘۛ۬ۥۘۜۨۙ۟ۢۖۙ۫ۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ 917942064) {
                                        case -1051578727:
                                            str3 = "ۨ۠ۜۘۤ۟۬ۦۙۦۘ۬ۛ۟ۤۜۦۢ۫ۡۤۡۘۨۦ۠ۙۛۥ۬ۧۦۤۜ۟۠ۢۛ۫۬ۛۛۙۖۨ۫ۧۖ۫ۗۖۖۘۘۖۖۦۨۜۘۧ۫ۦۘۥۚۦۘۛۜۡۙۨۚۘۥۘ۠ۗ۟۬ۜۦۘۤۘۡۚۚۙۨۛۛۦۡۦ۬۫ۚۡۘۘۚۥۙۧۨۖۘ۫۫ۗۜۜۙۙۧۖۘ۠ۨ۟۟ۤۜۧۢ";
                                        case 1727184942:
                                            String str4 = "ۜۜ۠ۦۤۛۧۦۥۧۤۨۘۘۘۥۘۙۡۜ۬ۖۨۛۤۧ۟ۡۦۘ۠ۧۥۘۧۛۖ۫۫ۜۥۗۗۡۜۖۘۗۢۧۤۥۖ۫ۘ۫ۥۘۥۗۜ۬۟ۥۧۘۘۖ۟ۧۨۗۛۚۜ۫ۨۘۚۚ۠ۧ۟ۦۙ۬ۙۖۜ۬ۥۤ۟ۜ۬ۜۘۗۢۥۘۦۧ۬ۨۖۗ۟ۢۙۙۦۥۘ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-1117866801)) {
                                                    case -2017876828:
                                                        str3 = "۬ۤ۟ۢۤۘ۬ۛۡ۠ۡۨۘۡۘۥۨۧ۠ۧۘۢۘۖۘۘۛۖ۠۠ۨۘۙۚ۠ۢۢۨۘۧ۠۬ۗۚۜۛۤۦۚۚۥۘ۫ۥۘۖۤۦۘۥۛ۠۟ۦ۠ۤ۫ۙۙۗ۫ۥ۫۠ۧۨۚۚۡ۟ۙۘۘۧۙۡۘۡ۬ۡ۫ۤۡۨۜۘۘ";
                                                        break;
                                                    case -1093079310:
                                                        str3 = "ۨۗۥ۬۫ۦۘ۫ۖۙۛۜۘۘۛۨۦۥۨۙۖۘۙۦۨۚۙۦ۫ۜۧۦۘ۠ۚۥۘۡ۟ۡۡۧ۟ۛۨۘۘۘۗۘۘۤۤ۠۫ۧۦۛۤ۟ۤۖۜۛۘ۟ۡۚۦۘۨۥۡۘۡۘۧ۟ۙۡ۬ۨۢ۠ۖ۫ۗۜۘۧۜۡۢۧۥۧۤۥۚۧۖۡۖۨۦ۬ۦۘۙۦۛ۟۠ۨۘ";
                                                        break;
                                                    case -953819394:
                                                        String str5 = "ۚۦۘۘۖۙۡۖۧ۬ۘ۬۟ۥۗۢۥۛۛۘ۠ۘۤ۫ۨۘۨ۬ۥۘۥۛۨۘۢۘۘۘۤۤۨۘۜۛۤ۬ۛۡۘۛۜ۠۠ۗۡۤۘۘۢۚۨۘۛۨۦۘ۫ۜ۠ۢ۫ۦ۫ۥ۫ۖۘ۫ۖۦۤۦۡۘۡۢۜۜ۫۬۟ۤۙۛۡۢ۬ۜۥۘۦۘۖۧۜۖۘۢۧۘۘۙۜۧۘۜۛۤ۟ۙۨۘۢ۫۫ۥۖۖۘۨۘۜۘ۫ۨۘ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ (-1298757422)) {
                                                                case 676092666:
                                                                    str4 = "۬۠ۖۘۘۡۨۘ۠۫ۗۖۚۖۘۘۥۜۤۛۙ۫ۘۢۛۘۛۘۨۘۘۙۡۜۚۡۤۛۧۗۘۙۤۙۥۙۙۢ۟۟ۖۖۖۙۦۘۥۦۜۨۛۡۛ۟ۗۢۘۘ۫ۢۥۘۡۜۦۡۥۧۚۜۖۘ";
                                                                    break;
                                                                case 1051703069:
                                                                    str5 = "ۘۖۚۦۖۨ۠ۖۗ۫ۚۧۤۢۜۘۢۗ۬ۧۖۘۢۨۘ۬۟ۚۨ۟ۜۘۨ۬۠ۖ۠ۥۘۦۖۖۘۥ۟ۛۛۛۡۘۦۚۘۗۥۛ۟ۤۛۘۥۧۘۧ۠ۨۖۗۚۖۚۗۢۜۧۥۛۖۘۜۚۜۘۤۜۗۡ۟ۛۙ۠ۘۡۢۖۘۥۛۗۨۦۘۖ۟ۚۘۜۤۧۨۦۘۡ۫ۙۜ۠۠ۛۙۦۘۗۥۛ۬ۧۥۚۙۜۘ۬ۘ۬ۖۦ۫ۙۡۨۢ۫ۘۘۖۘۧۘ";
                                                                case 1112804139:
                                                                    String str6 = "ۤ۬ۤۗۖۧۘۚۨ۬ۢۡۦۘۦۤ۬ۜۨ۟ۘۖۤۨۥۘۚۚۜۘۦۖۛۥۖۘۘۙۗۗۖۜۤۗۡ۫ۦۧۤۢۛۖۘۚ۬ۛۢۥۢ۬ۨ۫ۙ۬ۤۤۧۧۙ۟ۙۧ۫ۘۜۗۥۖۨ۠";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ (-1609337952)) {
                                                                            case -1897040349:
                                                                                str6 = "ۦۜۥۥ۬ۤۚۜۚۦۗۨۚ۬ۨۘۘ۠ۗ۬ۜۥۘ۠ۖۦۘ۬ۗۖۘۢ۬۠۫۠ۙ۫ۨۨ۬ۡۜۘۙۜۥۡۡۘۦۧۥ۟ۙۜۘۗۥۖۗ۠ۨۘۗۛ۠ۚۛۤۙۡۡۦۜۧ۟ۚ۬ۡۢۦۘ۟ۚۦۘ۬ۘ۬۬ۜۘۘۖ۟ۧۖ۟ۥۘۡ۠۠ۗۡ۠ۖۦۘۜ۬ۡۢۧۡ۟۟ۥۘۨۗۜۦۤۨۡ۫ۧۖۘ۠ۚ۫ۡۘ۬ۦ۫ۛۙۨۥ۠ۦۦۢۙ";
                                                                            case 1001453770:
                                                                                str5 = "ۖۚۢۨۛ۟ۖۘۘ۟۟ۘۘۜ۫ۧ۠ۜۧۘۗۖۜ۟ۦۢ۬ۖۜۗۧۛۨۘۤۨۛ۫ۛۙۖ۫ۖۥۜۘ۠۫ۤۡ۠ۢۤۖۧۡ۠ۨۘۥۤ۟ۘ۬ۦۘۙۦ۟ۢ۟ۡۘ۬ۙۤۦۛۧۢ۟ۦۚ۫ۚۤۤ۟ۘۖۤۧۧۚۥۨ۟ۨۜۤ۬ۡۡۜۘۢ۠ۢ";
                                                                                break;
                                                                            case 1216826585:
                                                                                str5 = "ۖۦ۬ۙ۫ۨۤۗۖۘۙۚۖۘۖ۬۬ۨۥۚۖ۫ۢ۬ۗۙ۟ۛ۟ۢۦۥۤۙ۟ۙ۠ۛۧۖۙ۫ۙۛۗۛۦۚۥۨ۫ۧۦۢ۬۠ۗۡۘ۫ۧۘۜ۫۟ۡۘۧ۟ۚۥ۫ۡۘۙ۠ۢۘۜۨۧۛۨۘۡ۬ۧ۟ۤ۫ۡۘۖۘ۬ۡۨۤۢۤ۫ۦ۫ۖۥۛ۫ۗۡۘۛ۫ۥ۫ۗۨۤۙۦۗۗۦۚۧ۬";
                                                                                break;
                                                                            case 1986447180:
                                                                                str6 = z ? "ۗۢۦۤۡۨۘۥۙۖۘ۫۠ۡۘۥۢۤۡۗ۬ۜۘۜۨۡۘۨۨۖۘۦۗۨۤۛۤۨۖۘۘۜ۠ۘۖۡۜۚ۠ۘۘۛۘۜ۫۠ۙ۠ۖۖۘۛۚۥۘۥۨۘۙۧۨۘ۠ۖۦۘ۠ۢۜۢۜۡۦۧۧ۬۬۠ۤ۠ۖۘۡۢۜۙۖۧ۬ۗ۟ۢۦۦۨۘۛۖۛۨۙ۠ۡۘ" : "ۦۡ۠۫ۥۗ۫ۨۘۛۨ۠ۛۧۡۘ۠ۥۙۢۖۗۤۜ۫۬ۜۖۘ۠ۧۥۘۗۢۧۘۗۢۥ۬ۘۛۗۡۘۥۥۜۘۖۤۜۨ۬ۖۘۘۨۦ۫ۧ۠۬۟ۦۘۧ۟۟ۨۖۛۦۛۖۘۘۦ۫۬ۦۖۘ۬ۡۥۘۤ۠ۚ۬ۢۧ۟ۚۜۘۦۤۙۤ۬ۧ۠ۙۧ۫ۢۦۘۗۜ۬ۤ۠ۥۙۦۦۘ۫ۜۨۘ۬ۖۚۦۘۨۤ۟ۡۘ";
                                                                        }
                                                                    }
                                                                    break;
                                                                case 2015096374:
                                                                    str4 = "ۛۛۚۜۤۛۨۢۤۡۜۨۘ۬۟ۤۜۥ۬ۦۖۧ۟ۦۘۘۨۨۢۙۚۦۨۜ۟۠ۤۥۚۧۢۜۧۧ۫ۡۤۙۛۚۜۤۛۙۖۘ۟ۥ۬ۚ۬ۘۤۢۡۘۥۜ۫ۖۨۘۢۢۨ۫ۢۚۨۡۛۛۡۜۚۦۘ۠ۨۘۘۡۘۢۚۗ۫۬۟ۡ۫ۡۥۘ۠ۡۡۚۢۡ۠ۖ۬ۚۘۘۗۙۡۘۦۜۨۢ۟ۜۘ";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case -826374388:
                                                        str4 = "۫ۧۘ۟ۤۥۘ۟ۧۢ۠ۗ۟ۦۡۤ۫ۡۖۘۘۢۡۖۚۖۖۘۙۤۤ۠۠۟۫ۛۦۦۢۢۘۥۥۘۘۖۡۧۧۛۤۘ۟ۡۚۙۚۛۨۜ۠ۙ۠ۢۗۘۘۥۨۡۘۘۜ۠ۨۛ۫ۨۧۡ۟ۢۧۗ۫ۜ۠ۜۛۚۡۘۗۗۥ";
                                                }
                                            }
                                            break;
                                        case 1828598919:
                                            str2 = "۫ۖۗۛۜۗۘۙۗۨۥۥۘۤ۟۬ۢۤ۬ۙۚ۫ۥۤۢۤۧۛ۠۫ۢۙۗ۠ۤ۠ۦۗۨۧۥۘۢۛۜۥۘۥۘۥۥۜۘۦ۬ۙۡۗۢۡۘۘۧۦۘۖۗۗۜۨۖ۠ۖ۠ۚ۟ۡۘ۬ۤۥ۠ۘۡۘۗ۠ۘۡۤ۠ۥۤ۫ۢ۫ۙۥۧۖۢۦۧۗۘ۬ۡ";
                                            break;
                                        case 1852380927:
                                            str2 = "۫ۜۖۘۧۘ۬ۙۜۧ۬ۜ۟ۗۖۚ۠ۛ۫ۥۙ۠ۥۚ۠ۧۛۜۛۜۘۤۦۙۘۚۚۢۚۦۘۘ۠ۦۘۢ۫ۤۜۤۦۘ۠ۡۖۘۘۘۧۡۘۘۥۙۚۗ۫ۖۘۛۜۨۙۜۧۘ۫ۘ۬۬ۦۦۘ۟ۚۢۗۛۦۘۚۤۚۘۧۨۖۘ۬";
                                            break;
                                    }
                                }
                                break;
                            case -498177431:
                                str2 = "۬ۘۙۗۡۙۘۤۚۛۥۘۜۛ۠ۤۦۥۘۡ۠ۦۘ۫ۨۥۘۧۡۗ۠ۘۤۗ۫ۜۚ۠ۡۙۚۙ۠ۤۨۛۧۥۛۖۧۘۤ۬ۦۘۘ۠ۧۜۜۘ۠۠ۘۘ۬ۖۥۘ۠ۚۡ۟ۗۡۢ۠۠۬ۙۢ";
                            case -185561481:
                                str = "۬۬ۡۘۗۤ۠۠ۥۗ۬ۧ۟ۛ۬ۧ۠ۚۦۚۦۥۧۙۙ۟ۙۨۘۜ۟ۖۜۜ۟ۦۤۚۢۨۖۙۦۨۜ۫ۗۜۘۢ۟ۡ۟ۥۥۡۘ۫ۜۡۥۘۘۜۨ۠ۥۧۘۗۨۡۘۗ۟ۢۘۨۛۛۨۜۧۘۚۥ۫ۢۤۙۤۖۧۖۖۡۘۜۜۤۤۨۜۦ۬۠ۥۤۥۘ۟ۤۡۘۚۛۦۘ۬ۗۗۜ۫۠۫ۚۢ";
                                continue;
                        }
                    }
                    break;
                case 286408080:
                    str = "۟۬ۗۗ۠ۘۧۧۖۘ۫ۘۥۢۖۛ۫ۡۙ۫۟ۛ۫ۧۘۘۡۗۘۘۦ۠ۡ۫ۨۦ۟ۢۨۘۦۡ۟ۗ۬ۥۙۘۤۜۙۙۗ۫ۨ۬ۧۚ۫ۗۗ۫ۧۗۨۢۦۘ۟۠۫ۢۛۚۗۢۗۥ۫ۨ۫ۡ۫ۚۡۘۘ۠ۧۜۥۡۚ۫۫ۤۘ۟ۜۗۥۡ۫ۚۢۨۨۡۘۥ۫ۥ";
                    break;
                case 988869928:
                    prefsInstance = new FPrefs(context);
                    str = "ۜۗۗۚۘۘۧۤۜۘۨۖ۠ۦۖۖۘۦۗۦۘۛۡۙۛۢۘۘۦۥۥۘۢۡ۟ۙۘۘۡ۟۫ۡۨۘۨۖ۬ۨۡۨۘۤ۬ۜۘۢ۬ۨۘۥۛۥۗۤۨۘۖ۠۬ۡۨۖۗۖۜۥ۠ۜۘ۠ۖۥۥ۟۟ۨۥۦۦۡ۫ۢۖ۬ۖۢۨۘۡۢۖۖۚۥۘۜۖۘۘۡۢۨۡۚۤۦۚۜۘۡ۟ۡۡۖۥۧۤۖۜ۫۠ۖۦۨۘۙۖۤۖۗۜۘۗۢۗ۟ۥۜۨۖ۬";
                    break;
                case 2027176811:
                    str = "۬ۨۤۜ۫ۢۥۗۦۘۗۖۛۜۙۚۛ۟ۥۘ۟ۘۙۤۙۜ۫ۙۗۜۨۙۡ۠۟ۛۙۧۦۙۘۘۤۦۥۘ۠ۥۧۘۖۜۘۦۖۜۘۧ۠ۤۢۗۘۘۤۙۜ۠ۢۚۦۖۡۘۨۛۥ۟۬ۦ۫۫ۨ۫ۖۡۘۧ۟ۧۛۗۥۘۨۘۥۘ۟۟۬";
                    break;
                case 2126582900:
                    return prefsInstance;
            }
        }
    }

    public void clear() {
        String str = "ۛۘۖۘۨ۟ۜۘۢۤۥۘۧ۟ۛ۠ۡۙۤۜ۫ۚۢۡۧۤۡۘۛۧ۟۫ۚۜۘۥۙۦۘ۟ۡۘۙۖۖۘ۬۠۬ۖۚۨۚۘۖۨۚ۟ۤۡۨۘۙۖۚۡۛۗۡۦۗۖۢ۫ۡ۠ۖۙۨۛۨ۠ۖۘۜۥۦۦۖۚۨۚ۠ۤۗۡۘ۠۠ۗۜۚۛ۬ۘۘ۠ۖۖۘ۫۫ۥۗ۟۟";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 254) ^ 836) ^ 763) ^ 995) ^ 234) ^ 34) ^ 980) ^ PointerIconCompat.TYPE_ZOOM_IN) ^ 151) ^ 529) ^ 572) ^ 711) ^ 401) ^ 283) ^ 944) ^ 915) ^ 196) ^ 449) ^ 700) ^ 88) ^ 751) ^ 305) ^ 390) ^ 476) ^ 524) ^ 216) ^ 37) ^ 908) ^ 856) ^ 395) ^ 98) ^ (-1530886213)) {
                case -2027080288:
                    this.sharedPreferences.edit().clear().apply();
                    str = "۫۫ۘۘۚۖۨۥۚۢۤ۠ۥ۫ۚ۟۬ۙۜۗۥۙۙۘۛۤ۠ۤ۫ۦ۫ۘۘۙ۠ۢۢ۟۫۬ۚۡۤۚ۬ۤۤ۬ۙ۟ۡۤۙۤ۟ۜۛۢۘۘۧۥۘۘ۬ۤۦۘۤ۬ۚ۬ۡۦۘ۬ۡۥۘۨۛۤۜۖ۟ۜۖۨۜۥ۬ۘۛۥۘۢۨۧۥ۠ۖۤۤ۠ۛۨۚۨ۬ۨۜۨۧۢۘ۬۟ۘۙۖۦۘۜۨۢ۬ۡۧۜ۠ۦۘۛۤۘۦۡ۟۟ۢۧ";
                    break;
                case 1191595749:
                    return;
                case 1399505908:
                    str = "ۦ۟ۦۜۡۡۘۗۡۦۘ۠ۘۤۡۜۚۥ۟ۛ۟ۗ۟۟ۛۚ۬ۚۥۧۦۛۛۙ۟ۤۜ۠ۤۛۜۤۙۡۦۡ۠ۨۘ۠۟ۙۢۗۥۘۙۦۢ۫۫ۖۥۘ۟ۘۜۘۤۦۜ۫ۨۢ۠ۤۚ";
                    break;
            }
        }
    }

    public boolean contains(String str) {
        String str2 = "ۡ۟۬۟ۙۛۖۥۘۘۦۡۛۖۥۥۘۢۘۤۚۧۡۙۦۥۘ۠۫۟۠ۨۖۘۦۜۡۚ۬۫ۧۗۨ۟ۙۨۘۢۜۥ۠۬ۥۙۘۧۘۢ۬ۦ۟ۦۥۜۛ۫ۘۖۥۤۜ۠ۨۙۤ۟ۗۗۡۢۜۤ۟ۘۜۧۙۦۘۘۛۛۖ۟ۥۥۘ۠۠ۗۚۤۜۘۦۘۥ۠ۚۜۘ۠ۦۧۘۖۙۖۘ۫ۜۜ۬ۚ۟ۨۛۨۥ۫ۦۘ۫ۙۥۢۨۘۙۤۡۧۛ۬ۖۧۥ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 834) ^ 79) ^ 529) ^ 326) ^ 988) ^ 302) ^ 555) ^ 458) ^ 54) ^ 86) ^ 718) ^ 779) ^ 519) ^ 481) ^ 722) ^ 285) ^ 223) ^ 738) ^ 663) ^ 674) ^ InputDeviceCompat.SOURCE_KEYBOARD) ^ 736) ^ 918) ^ 7) ^ 936) ^ 763) ^ 887) ^ 546) ^ 194) ^ 855) ^ 178) ^ 957298390) {
                case -1288432518:
                    str2 = "۠ۨۥۥۥۧۘ۟ۦۖۘۨ۬ۘۜۧۛۦۥۨۘۨۗ۠۫ۤۧۛۛۦۘۨۗۘۘۦۤۖۨۧۘ۫ۢۚ۟ۧۦۗۨۗۚۘۚ۟۠۠ۧۚ۟ۨۖۘۨۗۧۦۡۜۘۤۖۢۚۦۡۗۨۤۙۖۦ";
                    break;
                case -1025446354:
                    return this.sharedPreferences.contains(str);
                case 313639957:
                    str2 = "ۢ۬ۙ۬ۖۧۘ۬ۡۖۘۧۡ۫۫۫ۖۘۡۚۧۙ۬ۛۜۗ۬ۧۦۘۛۙۙۖۜۧۘۙ۠ۥۘۘۚۧۛۢۨۘ۟ۥۘۘۢۧۖۜۡۦۘۗۨ۟ۙۨۧۛۨۦۘ۫ۛۜ۠ۜۢ۫ۡۡۘ۟۬۬ۗۚۨۘۖۡۘۤ۬ۧۘۜۨۘ۬ۨۨۜۛ۠ۦۚۥۘۢۡۢۡۨۨۢۡۧۙۛۢۖۧۢۛۨۘۢ۫ۙۤ۫۬ۢۥۨۡۥۧۘۛ۬ۡۦ۠ۖۘۛۦۜۘ";
                    break;
            }
        }
    }

    public Set<String> getStringSet(String str, Set<String> set) {
        String str2 = "ۢۨۖۘۗۘ۫ۧۙۨۤۚۡۛۡۙ۬ۙۧۥۘۦۨۘۙۥۨۧۘ۟۬ۥۥ۫ۜۘ۟ۛۜۘۧۥۥۥۨۖۘ۫ۥۘۢۚ۬ۨۥۙۢۗۤۦۛۧ۟ۗۤۙۧۡۘ۬ۜۡ۫۬ۛۚۘۘ۟۠ۗۢ۟۟۠ۧۙ۬ۙ۬۬ۡۖۘۜ۬ۦۘۚۥۙۗۚۚ۠ۖۚۗۙۗۢۖۢ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 344) ^ 924) ^ 423) ^ 696) ^ 8) ^ 75) ^ 234) ^ 412) ^ 321) ^ 950) ^ 95) ^ 126) ^ 860) ^ 706) ^ 426) ^ 728) ^ 524) ^ 101) ^ 531) ^ 130) ^ 694) ^ 912) ^ 625) ^ 296) ^ 7) ^ 65) ^ 157) ^ 362) ^ 297) ^ 563) ^ 771) ^ (-1795000221)) {
                case -1351432541:
                    str2 = "ۥۗۦۡۡۨۘۘۛۛۗ۫۬ۗ۟ۤ۬ۥ۟ۡۙۦۘۛۜۧۘ۫ۖۨۘۥۥۙ۟ۚ۟ۖۨ۟ۡۧۘۗ۠ۥۘۡۜۘۘۖ۬ۘۡۜۘۘۤۘۜۛۘ۬ۧ۠ۗۤۡۥۘۦۖۦۘ۠ۨۖۨۗ۬ۡۥۚۥ۠ۥۘۗۘۤۜۥۦۛۗۤ";
                    break;
                case -1011623983:
                    str2 = "ۥۤۘۨۥۢۙۚۦۜۢۙۦۨۨۧ۫ۨۡۢ۫ۖ۬ۘۢۢۜۘۥۜۡۘۛ۫ۘ۫ۥۥۘۧۨۗۙۡۨۘۢۖۜۡۘۖۥۗۨۘۗۥ۫ۚۙۘۘۖۛۤۛ۫۫ۥۘۘ۬۟ۦۡۨۨ۟ۦۘۥ۠۫ۤ۟ۤۖ۟ۙۜ۟ۡۦۖۗۛۜ۫ۧۜۜۘۤۤۢۧۢۚ۫ۦۡۜۤۖۛۙۨۨ۬ۘۘۨ۫ۡۘۨۗۖۗۚۜۢۦۘۛۛۖۘۡۤۦۤ۫۟";
                    break;
                case -71645271:
                    str2 = "ۤۖۛۗ۟ۡۘ۬۫ۛۧۚ۠ۘۦۘۖۗۨۘۜ۟ۥۘۢۜۨۘۧ۫ۘۘۜۚۙ۟ۧۢۘۚۨۘۤۗ۠۬ۢۧ۠ۡۤۨ۠ۤ۟۬ۚۛۗ۬ۡۥۥۨۗۡۦۘۚۙۘۦۘۚۡۦۗۨۨۡۡۖۛۖۡۘۖۧۢ۠۟ۡۘ۫ۖۡۚۘۥ";
                    break;
                case 1509153539:
                    return this.sharedPreferences.getStringSet(str, set);
            }
        }
    }

    public void putStringSet(String str, Set<String> set) {
        String str2 = "ۙۦۨۘۜۨ۠۫ۧۢ۟ۗۥۥ۬ۢۙۢۜۤۨۦ۫ۡۘۧۙۛۦۡۘۘ۠۠ۘۜۨۨۧۢۦ۬ۛۖۘۘۘ۠ۜ۟ۥۙۨۢۙۨۛ۠ۜۤۤۤۦۚۡۘۨ۫ۢۡۥۘۘۨۦۦۤۤۖۘ۫ۘۖۘۜ۠ۥ۠ۨۦۢۙ۬ۜۧ۠۬ۢۜۦۛۛۧ۬ۢۗۡۥۨۙۖۙ۠۫۠ۚۤۥۢۜۚۗۦۧۚۥۘۦ۟۟ۜۖۘۘۖۨۧۙۜۘ۫۫ۡۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 707) ^ 145) ^ 559) ^ 251) ^ 596) ^ 68) ^ 198) ^ 703) ^ 118) ^ 749) ^ 264) ^ 211) ^ 415) ^ 900) ^ 655) ^ 221) ^ 856) ^ 620) ^ 21) ^ 72) ^ 392) ^ 734) ^ 976) ^ 741) ^ 151) ^ 408) ^ 894) ^ 834) ^ 281) ^ 800) ^ 612) ^ (-1970866359)) {
                case -1356359178:
                    this.sharedPreferences.edit().putStringSet(str, set).apply();
                    str2 = "ۤۖ۠ۛۧۥۜۙۘۥۜۘۦۧۗ۠ۨۖۘ۟ۡۘۤۖۖۖ۟ۘۘۙۦۥۘ۫ۜۘۤۤۡۛ۟ۥۡۥۘۗ۟ۥۘ۠ۡۖۡۛۤۥۨۙ۬ۦۢۨ۟ۜۘۡۛۡۖۡۧۘ۫ۥۢۢۦۧۨۡۘۘ";
                    break;
                case -177383142:
                    str2 = "ۜۨ۬ۗ۠ۗۨۘۖۘۖۚ۬ۡۧ۠ۧۧۡۘ۟ۤۨۘ۠۫ۚ۟۟۠۫ۧۥۧ۬ۥ۬ۨۛۙ۬ۜۘۜۗۗۨۨۧۘۦۛۚۥۘۗۖۡۦۘۜۗ۫۬۠ۨ۟۬ۦۘۖۛۢۦۡۘۥۧۤۚ۫ۖۘ۬ۨۙۖۡۘۚۡۘۨ۟ۙۧ۫ۛۛۗ۠ۚۛۜۦۘۛ۠ۦۘ۬ۤۥ۠ۤۜۘ۟ۧۨۦۨ۟ۢ۫۫";
                    break;
                case 927351812:
                    return;
                case 1998057104:
                    str2 = "ۘۨۧۘۙۡۘۢ۬ۦۚۦۙ۫ۜ۬ۢۧۦۘۘۖۘۛۡ۫ۙۘۘۘۜۦۡۡۙ۬ۙۥۘۘۦۤۧۛۙۨۢۨ۟ۡۙۘۘۗۢۚۘ۬ۙۚ۠ۢ۟۟ۖ۫ۖۘۜ۠ۜۡۡۢۧۧۡۡۜۡۘ";
                    break;
                case 2041856252:
                    str2 = "ۦۖۥۢۥۙۘۖۘ۫ۨۖۤۗ۫ۘۢۧۛۥ۬ۡ۬ۙۙۡۙۡۢۥۢۧۡۨۨۤۦ۬ۢۖ۬ۨۦۘ۬ۗۡۘۚۘۖۘ۠ۥۨۜۢۖۘۗۙۤ۬ۘۦ۟ۜۛ۬ۤۡۘ۟ۨ۠ۢ۬ۨۚۖۧۖۖۧۚۘۤۘۧۤۡۛۤۗۖۦۘ۟ۙۦۡۘۗۧۗۛۡۤ";
                    break;
            }
        }
    }

    public String read(String str) {
        String str2 = "ۜۧۨۖ۫ۨۢ۠ۖ۬ۡۗۗۛۖۘ۫ۥ۟۫ۗۡۘ۠ۗ۠ۖۘۧۡۤۜ۬ۚۙۦۖۥۧۘۤۗۢۜۗۜۤۚۜۤۧۧۘ۫۫ۢۦۤۦ۬ۗۜۢۘۥۜۗۨۧ۠ۨۖۢ۫ۤۥۨۘۦۚۤۛۗۖۨۡۨۘۚۡۘۦۤۜ۬ۡۥ۫۠ۖۥۜۘۢۤۦۥۛۗۡۘۢۚ۬۟ۦ۟ۥۡ۠۟۠ۡۚۖۧۧۙۘۖ۫ۖۚۧۚۗۥ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 52) ^ 215) ^ 762) ^ 609) ^ 137) ^ 125) ^ 582) ^ 506) ^ 45) ^ 814) ^ 700) ^ 29) ^ 463) ^ 863) ^ 361) ^ 297) ^ 531) ^ 808) ^ 901) ^ 350) ^ 796) ^ 890) ^ 243) ^ 120) ^ 795) ^ 21) ^ 601) ^ 55) ^ 34) ^ 604) ^ 960) ^ 1702979123) {
                case -1249102689:
                    str2 = "۫ۧۘۘۖۖ۫ۤ۟ۥۘۢۜ۠ۧۥۘ۟ۡۘۧۢۗۥۚۡۘ۟ۙۛۖۥۨۜۤ۫ۨۧۢۧۙ۠ۛۤۗۛۙ۠ۙۜۘۥ۫ۡۘ۟ۡۚۜۢۘ۟۬۠۫ۜۜۘ۬ۛۜۨۙۡۘۖۤۚۤ۟ۨۧۙۦۥۢ۬ۙ۫ۦ۫ۛۜۘۙ۟ۨۚ۬ۤ۬۠ۨۘۡ۬ۥۘۘۡۙۥ۬۟ۚۙۨ۬ۙۦۘۥ۫ۛ۫۫ۚۛۧۜۛۥۤۥۛۙۚۘۤۨۘۘۙۡۨ";
                    break;
                case -1189908148:
                    return this.sharedPreferences.getString(str, Deobfuscator$$app.getString(-3440722825637093193L));
                case -424835581:
                    str2 = "ۘۨۥۧۤ۠ۧۗۛ۟ۨۜۘۜۛۚۨۛۙۢ۫ۨۘ۬ۖۡۛ۟ۜۗۗ۫۬ۧۜۚۨۖ۬ۤۖ۟ۦۤۡۗۨۘۥۥۨۘۜۘۜۘۖۤۖۖۧ۠ۛۨۦۢۧۨۘ۠ۛۦۘ۫ۨۢۢۙۡۙۘۖ۟ۗۨۜۜۜۘۦۦ۟ۗۦۦۘۨۘۨۧۢۘۘۥۡۡۘۥۧۛۘۡۖۘ۬ۡ";
                    break;
            }
        }
    }

    public String read(String str, String str2) {
        String str3 = "۫ۥۢۦۛۜۥ۟ۗۘۗۚۥۦۧۛۖۨۚۛۜۘ۬ۧۡۘۤ۟ۘۘۗۦۗ۬ۢۘۘ۟ۚۘۘۥۡۥۗ۫ۛۗۥۘ۟ۛۜۘۡۛۦۘۛۧ۠ۧۘۘ۫۬ۗۡۧ۟ۤۚۘۘۛۢۥ۫ۡۧۘۧۚۗۗۛۦۧۗۢۧۥۨۘۤۧۚۗ۠ۘۖۜۚۤۘۤۛۤۦۘۛۤۤۦۖ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str3.hashCode() ^ 544) ^ 413) ^ 771) ^ InputDeviceCompat.SOURCE_KEYBOARD) ^ 602) ^ 744) ^ 951) ^ 801) ^ 430) ^ 752) ^ 898) ^ 828) ^ 325) ^ 634) ^ 149) ^ 212) ^ ItemTouchHelper.Callback.DEFAULT_SWIPE_ANIMATION_DURATION) ^ 13) ^ 492) ^ PointerIconCompat.TYPE_VERTICAL_TEXT) ^ 859) ^ PointerIconCompat.TYPE_TOP_RIGHT_DIAGONAL_DOUBLE_ARROW) ^ 636) ^ 657) ^ 324) ^ 545) ^ 869) ^ 271) ^ 152) ^ 842) ^ 111) ^ (-918345537)) {
                case -1636754206:
                    str3 = "ۜ۬ۛۤۨۛ۬ۗۡۡۖۘۧۚۢۜۛۜۘۗ۠ۡۖۚۥۙ۫ۢۙۘۤۢۙ۫ۨ۫ۗۛۙۗ۟ۢۜۘۚۖۜۘۘۥۜۘۛ۠ۗ۟۬ۛۨۨۘۧۨ۬ۦۙۘۘۙۧۙ۟ۥۢۙۥۜ۠۟ۡۗۡۧۥۨۘۦ۬۫ۚۜۨۥ۬ۦ";
                    break;
                case -535403109:
                    str3 = "ۚۦ۟ۖۚۡۘۡۜ۫ۙۤۘۚۥۚۙۨۘۖۤۢ۠ۤۛۚۧۘۚۗۧۤۢۦۘۦۦۜۘۙۚ۠ۗۥۖۥ۠۟ۘ۠ۖ۬ۜۘۖۚۤۗۦۡ۬ۙۖۘۗ۠ۚ۬ۥۦۘۦۧۡۘ۫ۚۗ۫ۙۡۘۘۡۧۘۥۖ۬۠ۧۖۚۙۦۨۨۘ";
                    break;
                case 1471763289:
                    return this.sharedPreferences.getString(str, str2);
                case 1745292215:
                    str3 = "ۨ۬۟ۚ۫ۘ۟ۧ۟۟ۜۘۘ۠ۚۦۘۥۤۘۖۖۥۘ۫ۜۧۗ۬ۧۜۙۨۘۧۜۥۘ۠ۦ۬۫ۢۥۗۖۦ۟ۜۘۘۦۖۖۤۤۥۘۢۘۦۢۚۢۡ۫۬ۧۖۖۘۥۛۜۘۛۡۘۢۖ۟ۥۨۖ";
                    break;
            }
        }
    }

    public boolean readBoolean(String str) {
        String str2 = "ۗ۟ۥۚۖ۟ۖۗۧۖۡۦۨۧۖۘۖۖۛۧۖۤ۟ۚۦۙۧ۫ۗۥۨۖۜۗ۠۟۬ۥۧۚۜۡۘۘۚۤۛۦۜۘۛۤۘۘۡۜۦۛۢۡۘۥۡۖۦۥۖۘۖۜۖۦۤۧ۠۠ۖۘ۬ۙۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 797) ^ 952) ^ 501) ^ 466) ^ 766) ^ 620) ^ 842) ^ 798) ^ 303) ^ PointerIconCompat.TYPE_HELP) ^ 745) ^ 937) ^ 177) ^ 539) ^ 439) ^ 172) ^ 175) ^ 927) ^ 246) ^ 147) ^ 642) ^ 554) ^ 495) ^ 550) ^ 106) ^ 439) ^ 761) ^ 512) ^ 185) ^ 594) ^ 602) ^ 862327389) {
                case -2145508947:
                    return readBoolean(str, false);
                case -1441866736:
                    str2 = "۫۟ۡۨۘ۬ۨۢۚۚۜۦۛۖۘ۟ۖۖۘۘۨۜ۬ۚ۫ۛۧۘۘ۬ۚۥۘۥۘۨۘۢۜۛۥ۠ۡۘۗۨۡۙۧۚۗۥۙۜ۠ۤۨ۫۫ۤۡۘ۬ۚۦۢۘۘۤۡۤۧ۬ۦۘ۠ۘ۠۫ۢۨۥ۫ۨ۬ۜ۠۫۫ۡۘۖۥۥ۫۠ۜ";
                    break;
                case -1265412072:
                    str2 = "ۘ۟ۜۘ۬ۜۦۚ۬ۡۘۚ۫۠ۚۢۨۘۥۗۢ۬۬۫ۗۗۤ۬ۡۜۜۦ۫۫ۧۨۧۧۚ۬ۧۧۘۦ۟۠۟۟ۥ۠ۙۢۢۚ۠ۢۙۚۨۥۘۡۨۨۨۤ۬۫۠ۙۜ۟۟۬ۖۥۘۙۤۡۘۗۨۡۙۡۘ۬ۧۘۘ۟ۗۧۤۗۜۘۗۖۢۛۧۗۡ۟ۖۨۘ۫۠۫ۤۖ۬ۜۨۜۘۡ۬۟ۨ۫ۜۘۖۥۜۧ۠ۨۥۛ۠ۥۡۥۘ۬ۛۦ";
                    break;
            }
        }
    }

    public boolean readBoolean(String str, boolean z) {
        String str2 = "۠ۦۜۜۢۦۛۨ۫۠ۜۤۘ۫۫۬ۚ۫ۛۚ۠ۚۤۦۨۖۘۨۖۥۖۙۗۢۥۘۥۛ۫۫ۖ۟ۙ۬ۨۛۚ۬ۦ۟ۗۡۨۚۧ۫۬ۨۡۘۤۡ۬ۘۚۘۘۜۡۙۢۗ۬ۚ۠ۜۘۡۦۦۨۦۥۘ۫ۦۖۘۘۜۘۜۜۦ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 483) ^ 81) ^ 415) ^ 521) ^ 757) ^ 902) ^ 246) ^ 853) ^ 995) ^ 70) ^ 673) ^ 219) ^ 822) ^ 828) ^ 391) ^ 793) ^ 717) ^ 715) ^ 67) ^ 647) ^ 540) ^ 354) ^ 816) ^ 642) ^ 775) ^ 29) ^ 177) ^ 340) ^ 837) ^ 112) ^ 364) ^ 286889611) {
                case 476897661:
                    str2 = "۟ۜۧۚۢۛۘۗۨۘ۫ۖۙۦۦۧۘۦۛۙۖۚ۫۫ۧۜ۠۠ۚۖۙۥۥۗ۬ۘۦۜۤۦۘۡ۠ۛۢۛ۬۠۠ۢۜ۟ۚ۫ۢۧۗۧۨۘۖۖۢ۠ۘۥۗۚۡۘۜۥۖۘۨۨۨۘۥ۬ۛ۬ۢۛۛۨۤۙۜۦۘۤۜۘۘۨۥ۠";
                    break;
                case 574150062:
                    return this.sharedPreferences.getBoolean(str, z);
                case 1327916652:
                    str2 = "۠ۛۖ۟ۡۡۘۜۗ۟ۡۗ۠ۤ۟۬ۢۘۘۦۜۜۘ۠ۘۘۗۧۦۤ۬ۖۦ۟۬ۥۦۖۜۗۤۥۖ۠۬ۘۜۢۛ۠ۢ۠ۚۛ۬ۨۙ۫ۖۨۘۧۨۖۜۨۘۘۨۖۥۘ۬ۥۘۘۖ۫۬۫ۧۥۧۘۛۘۨۥۗۦۜ۠ۘۘۙۥۤۡۘۢۙۘۗۗۡۘۚۧۢۗ۟ۡۘ۟ۧۘۘۖۛۨۘ۬ۤۖۘ۬۟ۛ";
                    break;
                case 1953142444:
                    str2 = "ۘ۟ۦۘۚۧۜۢ۬ۘۘۢۗۜۛۘۤۡ۟ۥۜۙۦۘۡ۟ۜۡ۠ۛۥۥۘ۟ۗۢۡۘۥۘ۫۬ۦۖ۟ۡۚ۬ۢۗ۠۬ۨۘۧۢۧ۟۬ۡۘۛۛۨ۟۠ۧۨۥۦۘۜۢۦۘ۟۠ۦۘۘۥۦۘ";
                    break;
            }
        }
    }

    public double readDouble(String str) {
        String str2 = "ۛۨۧۘۚۚۥۙۛۚ۠ۡۨۘۡ۠۟ۡ۫ۘ۟ۦۚۚ۫ۢ۟ۥ۫۟ۥۡۘۘۘۨۘۥۖۛ۟ۧۡۢۖۘۡۛۧ۠ۤۗۛۖۛۧ۬ۜۘ۫ۚۢۗۚۡ۬ۚۡۘ۬۟ۜ۫ۘ۠ۢۦۖ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 213) ^ 5) ^ 330) ^ 507) ^ 959) ^ 344) ^ 868) ^ 266) ^ 201) ^ 102) ^ 167) ^ 113) ^ 573) ^ 131) ^ 859) ^ 631) ^ 63) ^ 569) ^ 524) ^ 530) ^ 666) ^ 871) ^ InputDeviceCompat.SOURCE_DPAD) ^ 69) ^ 856) ^ 228) ^ 286) ^ 192) ^ 25) ^ 795) ^ 420) ^ 1750242928) {
                case -1086569312:
                    str2 = "ۙۢۡۘۙۘۖ۬ۧۙۙۡۗۢ۫ۧۚۨۧۘۘۤ۫ۤۨۨۨ۠۠۟۟ۚۥۨ۬ۙۢۦۘۧۙ۬ۡۨۡۘ۟۫ۖۘ۟ۢۗۤۜۦۘۢ۬ۚۧۗۛۨۦۥۧۤۤۥۙۦۢۘ۟۠۫ۡۘۦۥۘۥۘۖ۬ۘۙۛ۫ۖ۬۬۬ۖ۬ۘ";
                    break;
                case -633931273:
                    return Double.longBitsToDouble(readLong(str));
                case -221342677:
                    String str3 = "ۧۦ۫ۜۡۦۘۜۙۙۡ۟۟ۘۚۥۘۗۥۜۦۨۘ۫ۢۥ۫ۛۘۘۧۗۦۘۛ۟ۘۗۛۧۢ۠ۜۘۛۗۜۘۥۜۘۘۛۗۢۚۘۖۖۖۘۖۖۢۡۦۦۘۡ۬۠ۦۦۤۘۚۘۡ۬۟۠ۦۙۛۤۛ۠ۦۘۘ۠ۙۜۘۢ۫ۡۘۢۡۚ۠ۢۡۙۤ۬۠ۦۖۢۗۖۢۢۛۜۘۧۘۨۘ۫ۤۢۖ۫ۡۘۥۢۘۘۜ۠ۜۘۚۥۜ۬ۦ۫ۙۨۘۧۘ";
                    while (true) {
                        switch (str3.hashCode() ^ 1527138748) {
                            case -626100880:
                                str3 = "ۚۜۢ۠ۥ۬ۦۚۦۘۡۤۜۘۚۢۡۚۨۥۗۛۙۥۥۧ۠ۢۖۜۘۡۨۦۖۘ۠ۖ۟ۘۥۨۚۥۢۘۖۡۢۚۧۘۚۜۘ۫ۚۗۙۦ۫ۜۙ۬ۗۚۧۢۨۘۘۦۢۦۡۖۗۦۤۛۡۛ۠ۜۙ۟ۧۡ۠۬۫ۡۥۘۚۜۖ۬ۡۜۘۦ۟ۛۡۨۢۘۢ۬ۘ۫ۘۛۖۨۘۖۨۜۗۧۗۙۗۢ";
                            case -505172862:
                                str2 = "۫ۚ۠ۜ۟ۧۘۡۛۤۥۨۦۨۥ۫ۢۡۘۡۜۖۡۧۘۦۘۤۙۛۢۛ۟۟ۤۨۦۢ۫ۥۘۗۛ۠ۘۨۛۜۦۘ۫ۘ۠ۙۘۨۘ۠۫ۜۜۙ۟ۛۜۖۥۜۘۛۜۡۘۚۥۖۦۢ۟";
                                continue;
                            case -174528029:
                                String str4 = "ۢۘۖۢۦۨ۬ۢۥۘ۠ۥۘۧۙ۬۠ۦ۠ۨۚۧۢۡۛۤۦۧۦۛ۠۫ۘۨۛۗۖۘۢۛۚۜ۟ۜۘ۬ۙۘ۬ۢۘۘ۫۫ۨۚۚۜۘۨۘ۫ۦۢۡۤۧۤۤۖۨۘۧۦۧۘۖۤۢۘ۫ۖۘۡۥۢۢ۬ۤۧۖ۠ۛۘۘۘ۬۟ۜۛۨۧۧۢۥۘۗۢ۟ۧۧ۬ۘۛۧۥۤۖۦ۫ۨۢۤۙۖ۬ۨۥۡۖۥ۠ۘۘ۟ۡۛۛ۫ۜۘۢۦۧۘۖۡ۫";
                                while (true) {
                                    switch (str4.hashCode() ^ (-1448694474)) {
                                        case 360519297:
                                            str4 = "ۚ۟ۥۘۜۤ۠۠۬۬ۖ۟ۘۘۚۜۗۛۥۚ۟ۜۘۘۤۦۘۚۦۜۘ۫۬ۛ۠ۤۖ۫ۤۧۚۖۦۨۘ۠ۚۚۜۤۘۘۚ۠۬ۧۗۛۨۥۧۘۦ۬ۨ۟ۛۤۡۧ۫ۙۨۤۖۚۨۘۘۡۢۜۘ۫ۜۨۘۘ۬ۛ۬ۧۡۦ۫ۥۛۧ۬ۚۢ۬ۤۘۜۨۥۘۨۤۙ";
                                        case 400346282:
                                            String str5 = "۬ۦۜۘۢ۫ۚۙ۬ۤ۟ۥۥۡۖۦۘۗ۟ۗ۫ۧۘ۠ۚۦۤۛۦۧۢۨ۠۟ۙ۟ۡۦۙۨۘ۟ۥ۠ۖۗۥۘۢۥۨۘۦۢۘۘۤ۠ۜۘۧۙۗۨ۟ۤۤۡۘۢ۟۫۠ۙۤۨۤۦۘۥۨۚ۟۠ۥۘۘۖ۟ۜۖ۫ۧۢۧۥ۠۬";
                                            while (true) {
                                                switch (str5.hashCode() ^ (-1851923766)) {
                                                    case -1404468847:
                                                        str5 = "ۢۨۜ۬ۚ۠ۙۥۧۥۤۨۘۘۥ۠ۚ۠ۜۘۛۥۜۚۜۧۘۧۛۘۘۡ۠۬ۡۗۘ۬ۗۛۥۙۙ۬۬ۡۨ۫۠ۧۗۤۜ۬ۗۙۢۧۘ۬۫۬ۢ۟ۙ۫ۙ۟۫ۜۘۧۖۦۙۦۛۦۜۢ۬ۨۚۤۧۛ۫ۨۚ۫ۙۜۘۜۤ۬";
                                                    case -842912145:
                                                        String str6 = "ۖ۟۠ۢۘۥۦۦۜۘۥۚ۠۬ۤۘۘۨۜۘۚۛۡۘۡۜۡۘۢۨ۟ۜۨۦۥ۟ۥ۟۫ۦۛۚۛۥۘۥۡۤۥۘۤۚۜۘۗۨۨۘۧ۬ۨۘ۫ۧۨ۟ۢۘۚۖۘۦۙ۫ۜۛ۬ۗۧۘۘۧۜۢ";
                                                        while (true) {
                                                            switch (str6.hashCode() ^ (-867383347)) {
                                                                case -1424812491:
                                                                    String str7 = "۠ۥۤۚۖۜۨۖۗۧۡۘۙۦۧ۬ۗ۠۬ۛۧۡۗۡۨۢۧۚ۬ۤۖ۟ۜۘۦۘۦۦۜۘۤۙۨۘۗۨۧۡۖۨۡۤ۬ۨۘۦۚۛ۠۠ۛ۬ۧۧۤۗۜۦ۟ۧ۬ۘۘۦۘۚۧۦۤۡۘۘ۠ۗۛۡ۬۠۟ۛۢۤۘ۬ۘۛ۟ۥۡ۬ۧۖۘۡۥۢ۫ۜۤۡۜۦۘۙۚ۠ۖۙۥ۠ۥۦ";
                                                                    while (true) {
                                                                        switch (str7.hashCode() ^ 519672246) {
                                                                            case -1750937705:
                                                                                str6 = "ۢۗۦۘ۠ۖۖ۬ۧۥۜۧۤ۟ۡۗۛۤ۬ۙۘ۠ۥ۠۟ۢۚۚۘۖۡۚ۫۟۟ۘۙۡۧۜ۟ۖۧۘۚۜۜۢۗۘۢۨۤ۫ۘۘۘۙ۠ۘۧۗۜۚۖۘ۟ۢۗ۠ۧ۟ۙۢۛ۫۫ۗ";
                                                                                break;
                                                                            case -759880056:
                                                                                str7 = "ۚ۟ۙۗۤۢۡۢۧ۟ۖۘۙۗۦۖۖۥۘ۫۠۠۠ۦ۫ۛۖۦۜۚۡۘۗۨۡۘ۫ۖ۬ۤۘۤۧۖۘ۠ۤۘۘۗۘۡۨۥۗۙۗۨۘۛۡۦۘۨۢۛۙۜۨۤ۟۫۟ۦۘ۠۫ۦۘۥۢۦۦۖۦۘ۠۬ۡۘ۟ۥۡۘۢۢۙۡۚۖۖۦۧۘۖۘ۫ۥۗۜۡۖۢۥۗۛۜۨ۟ۛۤۢۤۥۘۗۢ۠ۢ۠۟";
                                                                            case 167159444:
                                                                                str6 = "ۢۨۘۘۨۤۧۖۤۖ۟۫ۜۛۨۙۛ۠ۧۗۡ۬ۗۙۥ۫ۗۘۥۢۢ۟ۜۡۘۙۙۥۚۨۗۥۧۡۘۚۢ۬ۙۘ۫۟ۦ۫ۧۦۨۘۥۜۜۘۡ۠ۦۘۡۦۧۘ۟ۛۦۘۦۢ۟ۚ۬ۡۘ۬ۡۖۜۦۦۤۦۗۗۡۧ۠ۗۥۚۖ";
                                                                                break;
                                                                            case 1189896434:
                                                                                str7 = !contains(str) ? "ۢ۠ۗ۬۫ۡ۟ۛۘۡۤۢۤۚ۠ۜۗۡۦۘ۠ۨۛۘۤۡۘۧۢ۟ۥۥۚۢۥۥۡ۬ۢۦۦۗۛۛۗۖۥۖۘۡۧۖۘۦۜۗۦۢۡۘ۫ۧۡۧۤۛ۬ۛۛۗۥ۬ۥۧۚۨۧۛۗۦۚۛۘۥ۟ۖۘۡۘۧۜۗۥۧۦۢۘۛۦۘۘۖۜۘۙۙۢۧ۟ۖۢ۬ۘۥۙۖۘ۟ۦۜۘۙۥۡۜۨۥۖ۬ۗ۠ۘۗۖ۬ۜۦۢ۫ۗۖ" : "ۦۘ۠ۜۛۖۘۗ۫ۖۘۛ۟ۚ۬ۥۗ۠۠ۖۗ۬ۦۘۡ۫ۚ۠ۨۜۙۦۚۢۚۜۘۨۘۖۘ۫۬ۛۜ۟ۜۘۛۥۜۘۦۚۨۘ۫ۡۧۧۤۥۙ۫ۡۘۧۚۡۘۛ۠ۘۘۢۢۢۘۜۘۨۥۘ۫۟ۨۘۦ۬ۤۛ۫۟ۛۜۨۘۙ۬۫ۛۥ۬ۡۗۛ۟ۥۖۗۢۦۗۧۖ۬ۦۘ";
                                                                        }
                                                                    }
                                                                    break;
                                                                case -1134844149:
                                                                    str5 = "ۧۗۜ۫۠ۨۥۗۧۖۦۖۘۧۗۢۙۘ۟ۗۗ۠ۚۚۨۘۗۧۛۡۜۘۖۙۥۛۖۜۖۧۥۧۨۡۜۧۛ۠۫ۛ۠ۢ۠۠ۛۧۨ۫ۛۖ۟ۖۙۘ۫ۡۨۘ۠ۦۧۘۢ۫ۧۨۗۛ۟ۖ۠ۢۡۜۥ۟ۖۘۢۚۨۘۗۨ۟ۦۧۤۗۨۙۢۖۜ۠ۦۧ۠۠ۧۗۚ۬ۦۛۛۛۡۨۦۘۡۗۘۧۘ";
                                                                    break;
                                                                case 306460279:
                                                                    str6 = "۟ۦۚۦ۫ۜۘۡۚۥۢۡۛۡۢۧۙۦۘۤ۠ۚۖۥۜۘۢۜۘ۟ۘۚ۫ۛۗ۟۫ۥۚۚۡۘۛۨۦۛۙۙ۫ۦۙۚۦۤۚ۬ۥۘۖۛ۠ۘۧۘۧۥۨۚۦۨۜۗۦۘۙ۟ۙۤۦ۬ۥۥۘ۬ۧۛۢ۠ۚۙ۠ۡۘۘ۬ۖۥۘۘۖ۟ۖۘۛۦۢۜۢ۫ۚ۫۫ۗۡۨۙ۟ۧۥ۠ۥۡ۠ۢۧۢۦۘ";
                                                                case 936566573:
                                                                    str5 = "ۙۚۤۖۚۡ۟ۡۡۡۡۨۘۖ۬ۜ۬۫۟ۡۜۧۘۘ۬ۖۘ۫ۨۤۦۧۘۙۦ۠ۗ۟ۤۘۖۡ۟۟ۗۘۚۦۘۨۨۧۜۢ۠ۗۛۜۘۛۢ۟۫ۥۜۥۖۥۤ۫ۧۙۛۛۧۥ۠ۤۨۖ";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 1382691784:
                                                        str4 = "۟ۜۙۛۥ۟ۗۗۛۤ۟۟ۡۧۗۖۘ۠ۡۛۨۖۙۨۢ۠ۨۛۥۘۤۢۥۘۡ۟ۨۘۖ۫ۦۘۨ۠ۤۗۙۘۗۥۤ۟ۤۛۗۦۘۘۗۖ۬ۙۡ۠۟ۜۘ۬ۘۧۧۛۘۘۧۛۚۤۚ۫";
                                                        break;
                                                    case 1936751972:
                                                        str4 = "ۗۛۗۢۨۡۘۙۗۧۨۧۤۡۧ۬ۢۨۛ۟ۜ۫ۥۥۨۘ۟ۥۗۦ۠ۤۨۛ۠ۚۜۨۘ۫ۙۡۛ۫ۦۘ۬ۘۖۛۖۢۚ۬ۡۘۘۤۖۘۨ۫ۜۘۙۘۜۥۜ۠ۛۧۖۚۢۚۗۗۛ۫ۖۧۘۗۗۘۦۜۜۨۘ۟ۚۡۙ۫ۗۨ۫ۡۜۢۚۥ۫۟۠ۘۘ۫ۢۛ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 668483841:
                                            str3 = "ۢۢ۫ۤۧۙۧ۬۫ۚۨۡۨۨ۬۬ۗۖۙ۬ۡ۟ۛ۟ۜۤۖۥ۟ۘۙۗۥ۟ۦ۫ۦۖۘۚۙ۬ۗۥۡۖۗۘۗۗۨۛۨۤۜۦۙۡۦ۫ۘۨۜۘۜ۬ۤۤۙۚۗۨۥۜۡۗ۬ۛۖۘۧ۬ۢۤۚۜۘۨۘۗ۬ۖۢ";
                                            break;
                                        case 1227421114:
                                            str3 = "ۤۧۖۘۧۥۙ۟ۧۛ۠ۡۘۡۚۡۤۨۡۨۛۢۘۗۨۙۚ۟۠ۥ۠ۗۖۤۧۚۡۘۚۦۥۘ۠۟ۤۤۚۘۘۦۥ۟ۛۦۖۘۛۙۖۘۧۚۥۘۘۛۢۦۢۡۘۛۤۧۘۛۥۘ۫ۨۡۙ۠ۧ";
                                            break;
                                    }
                                }
                                break;
                            case 46555716:
                                str2 = "ۨ۬ۡۘ۫ۜۦۘۧۢۜۗ۠ۘ۠ۥ۠ۨ۠ۜۙۙۤ۠ۥ۟ۜ۠ۖۘ۬ۨۜۘ۟ۖۥۤۤۚۨ۬۬۫ۤۥۘ۫۫ۙۥۚۡۖۧۘۢۥۧۧۦۘۦۗۘۙۜۡۨۖ۟ۤۚۘۘۙۖۢ۟ۤۖۘۛ۠ۦۤۦۜۛۘۗۨ۠ۛۦۨۡۦۨۜۘۢۛۘۘ۠۫ۧ۠ۘۘۨۗۜۘ";
                                continue;
                        }
                    }
                    break;
                case -154034120:
                    str2 = "ۦۨۧۘ۟ۡۘۘۚ۬ۘۤ۠ۧۦۨ۟ۙ۟ۖ۠ۙۤۜۧۡۘۡ۠ۨۤۢۚۤۖۙۢۛۦۘۘ۬ۢۧۜۨۘۧۜۖۗۤۘۘۗ۬۬۫ۙۧۥۢۚۧۗۤ۟ۖۘۙ۠ۡۛۚۨ۫ۨۗۖۜۧ۫۠ۧۗۦ۠ۤۛۧۦۘۖۘۜۤ۠ۛۢۨۜۢۧۙ۫۫۠ۜۧۥۘ۫ۙۨۛ۠ۥۜۘ۬ۗۘۘۛۦۖ۟ۡۧۘۥۨۜۘۨۖۨۡۤۥۢ۠ۘۘۜۡۡۘ";
                    break;
                case 453831851:
                    return DEFAULT_DOUBLE_VALUE;
            }
        }
    }

    public double readDouble(String str, double d) {
        String str2 = "ۦ۠ۖۦۖۧۘۛۡۢۢۚۜۘ۠ۜۗۡ۫۟ۚۘۦۢۤۤۧۛۡۡ۬ۥۘۧۘۤۜۛۗۛۨۙۜۥۧۛۙۛ۟ۙ۠ۡ۫۫ۦۗۦۘۗۡۜۘۤۨۥۘۖۘۘۡ۠ۦۢ۠ۛ۬ۤۥ۠ۧۜ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 173) ^ 245) ^ 368) ^ 18) ^ 741) ^ 485) ^ 752) ^ 841) ^ 609) ^ 289) ^ 871) ^ 38) ^ 177) ^ 830) ^ 305) ^ 176) ^ 420) ^ 130) ^ 995) ^ 244) ^ 962) ^ 888) ^ 590) ^ 735) ^ 598) ^ 541) ^ 995) ^ 59) ^ 212) ^ 587) ^ 852) ^ 36359957) {
                case -1038201978:
                    str2 = "ۜۜۘۚۘۖۘۜۤۖۙۜۘۦۦۘۨۖۡ۠ۜۨۘۙۦۡۘۡۙ۫۫۠ۦ۫ۖۖۘ۠ۡ۟ۘۦۘۘ۫ۡۘۨ۠ۡۘۥۜۢۛ۠۠۫۠ۨۘۥ۬ۖۨۥۘۘ۫ۡ۬ۧ۬۫ۜۦۧۢ۬۬۫۠ۥ";
                    break;
                case -22323720:
                    str2 = "ۡۨۦۘۛۛۦۢۥۗ۠ۢۦۘ۫ۚۘۘۜۨۥۡۚۜۤ۬ۖ۫ۖۡۘۤۡۤ۟ۚۛۨ۟ۢۘ۠ۡۘۗۙۘ۟۠ۥۘۜۦۚۥۥۚۡۛۛۖۧۥۘ۫ۙۘۘۜۡۤ۬۬ۦۡۦ۫ۙۜ۠۠۬ۖ۠ۦۜ۬ۧ۠ۧۨۜۘ۫ۗۖۘۧ۟ۧ";
                    break;
                case 312320716:
                    str2 = "ۤۚۚۢۢۗۜۢۙۡۦ۟ۡۢ۠ۢۘۢ۬۠ۢۧ۫ۗۧ۬ۢۛۧۡۘۗۘۘ۬ۛۘۜۦۦۦ۠ۨ۟ۜۥۘۛۥ۠۫۬ۦۨ۫۠۟ۗۘۜۘ۟ۙۙۘۘۤ۬ۢۨۡۥۡۦۚۦ۬ۡۘۛۜۧۘۦۡۘۙۡۛ۠۟ۥۗ۟ۤۖ۫ۜۘۛۤۦۨ۫ۡۘۙۛ۫ۡۙۖۘۧۖ۟ۦۖۘۤۚۧۥ۫ۤۨۖۚۙ۬ۘۨۗۢ۟ۨۡۘۙۛۨۘۚۘۨۘ";
                    break;
                case 1293306153:
                    return d;
                case 1437159930:
                    return Double.longBitsToDouble(readLong(str));
                case 1503862789:
                    String str3 = "ۘۤۡۗۢۦ۬ۡۘۘۙۨۦۛۚ۫ۛۨۡ۟۫۟۠۟ۛۙۗۨۡۚۘۜۘۚۙۘۘۥۚۖۥۢۧۜۨۖۚۚۜۧۥۘۘۦۤۢ۫ۨۥۖۛۛۚۧۗۡۗۥۛۛۙۦۘۛۥ۬۠۟ۥۘ۫ۥۘۢ۠ۜۘۛۘۘ۠۬۠ۥۡۚۢۢۨۤۢ۫۬ۨۖۘۦۘ۠";
                    while (true) {
                        switch (str3.hashCode() ^ (-39066757)) {
                            case -928089169:
                                String str4 = "۠ۡۘۚۗۨۘۜۙۚۘۧۤۗۢۜۘۖۛۨ۬ۥ۠ۡۥۡۗۘۙۢۖۘۨۚۤ۟ۚ۬ۛۡۘ۠۬ۘۧۗۛ۠ۗۜۘۚۦۧۘ۫۫ۙۛۢۛۛۚۘۚۤۖۚۙۛۥ۬ۛۥۘۦۘۢۧۥۡۧۜۘۜۧۘۛۜۖۚ۠ۧۤۤۜۘۨ۟ۛۗۡۦۘۢ۬ۘۢ۬ۛۗۚۖۦۢۡۘ۫۬۬ۘۛۛۥ۠ۚۘۖۘ";
                                while (true) {
                                    switch (str4.hashCode() ^ 452742634) {
                                        case -1933848925:
                                            String str5 = "۬ۚ۬۟ۤۢ۠۫ۥۘۥ۠۠ۥۨۨۘۢ۬ۖۘ۟۬ۨۘۥ۟ۜۘۢۛۥۘۘۚ۬ۚۖۘۘۧۛۚۙۚ۠ۧۤۘۘۙ۬ۘۘۖ۫ۨۘۢۢ۠ۛ۬ۜۘۤۥۡۘۤۥۜ۫۟ۢۗ۫ۖۘۖ۟ۧۡۙۦۘۢ۟ۢۦۖ۬ۛۚۨۘۦۚۖۚ۬ۜ۬ۖۘۘ";
                                            while (true) {
                                                switch (str5.hashCode() ^ (-1958393554)) {
                                                    case -1694674369:
                                                        str4 = "ۦ۬۠ۧۧ۟ۙ۬ۜ۫ۜۨۘ۬ۢۘ۫ۚۨۘۤۖۤۥۧ۬ۚۜۚ۠ۚۡۘۡۜ۟ۖۧ۫ۖۢ۬۠۠ۨۘۢۨۧۥۤۦۘۙۚ۟ۖ۫ۤۡۗۙ۬ۙ۫ۛۧۧ۠ۡ۠ۗۡۜۜ۟ۖۢۙۛۦۜۤ۬ۜۖۘۦۨۢۚ۟ۖۗۗ۬";
                                                        break;
                                                    case -1159189599:
                                                        str4 = "۟۟ۗ۬ۚۥۘ۬ۘۜۘۤۚۙۢۧۦۙۢ۟۟۟ۖۧۡۧۦ۠ۗۜۤ۟۬ۦۘ۫ۙۛ۬ۥۙۧۢۦۚ۟ۙۨۡۗۛۖۡۨۢۚۜ۬ۙۛۖۗۙ۬ۧۚ۫ۡۦۨۗۡۛ۫ۚۜ";
                                                        break;
                                                    case 639376590:
                                                        String str6 = "۟۠۠۟ۡۥۧۗۖۡۘۘ۬۠ۘۘ۟۠۠ۙۢۜۙ۬ۘۙۡۦۗۚۥ۫ۘۢۗۗۥ۬ۧۗۜۜۨۙۖۚۗ۠ۥۗۗۗۙۛۡۘۡۚۖۥۖۘۤۛۥۘۤ۟ۘۘۚۦ۬ۗۛ۫";
                                                        while (true) {
                                                            switch (str6.hashCode() ^ (-818183580)) {
                                                                case -1294362188:
                                                                    str5 = "۟ۙۦۘۙ۠ۖۧۘۦۘۙۚۗ۬ۡۧۥۥۡۡ۟ۨۛۧۗۡۘۗۦ۬ۤۜۖۧۡ۟۫۬ۜۘ۫ۤۖۘ۟۟۬۟ۘ۟ۢۘۚۨۢۖۙۛۧۙۤ۫ۧۛۘۘۚۛ۬ۥ۟ۨۗۗۨۘ۟ۚۜۥۗۚۜ۫ۤۧۦۘۘۚۦۚۤۖ۫ۗ۬ۨۜۨۗۘۦۜۖۥۡۧۜۜۡۨ۠ۘۡۘۚۡۙۛ۠۠ۡۦ۟";
                                                                    break;
                                                                case -1142669262:
                                                                    str5 = "ۥۚۡ۫ۥۤ۟ۜۡۘۢۥۘۘۘ۬ۖۧۧۨۘۦۧۘۧۦۖ۟ۢۛ۫ۨۧۥۥ۬ۜۤۙۧ۠ۦۘۘۡۘۚۛۗۜۨۖۘۤۢۨۚ۠ۜۜۦۜۖۛۨۚۤۜۜ۟۬۟ۧۘۘۘۡۦۘۥۢۛۗۘ۟ۗۥۥۘۢۨۘۜۚۘۘۧ۠ۖۘ۟ۚ۬ۧ۠ۘۘ۬۫ۛ۠ۖۖۘۥۡۘ۫ۦۧۗۚۦۙ۟ۢۗۡۘۧۗۨۘ";
                                                                    break;
                                                                case -997074455:
                                                                    str6 = "ۖۚۘۘۛ۫۬ۢۖ۫ۦ۠۫۠ۥۡۘ۬۠ۦۘۥۢۜۨۧۡۧۡۦۙۗۥ۠ۗۧۦۚۨۤۘۗ۟۬ۦۦ۬ۢۨ۟ۧۤۚ۫ۘۜۙ۟۫ۧۤۜۘۤۖ۫ۛۤۖۘۨۧۨۡۧۧ۟ۥۦۘ۠ۛۖ۟ۖۢۛ۫ۦۨۡۦۡۧۥۘۥۙۖۘۨۡۙ۬ۜۨۚۚۛۙۖۦۥ۫ۜ۫ۗۘۛۛۘۘ۫۟ۤۥۖۖ";
                                                                case 607806253:
                                                                    String str7 = "۟ۗۧۙ۬ۙۡۤۡۘۨۜۤۜ۟ۙۖۤ۫ۥ۟ۡۖۨۘۖۧۛۗۙ۬ۤۜۛۗۜۦۘۘۚۜۚۢۚۢۗۗۦ۬ۨۜۥ۠ۧۙۜۗۦۢۤ۬۬ۖۖۘۢۜۜۜ۬ۜۘ۫ۜۚۧۡۡۘ";
                                                                    while (true) {
                                                                        switch (str7.hashCode() ^ 639603085) {
                                                                            case -1126619650:
                                                                                str7 = !contains(str) ? "ۖۜۦۘۖۧۡۘۤۜۡۜۨۖۚۗۦۛۗۡۥ۬ۜۦۘۖۨ۟ۨ۫ۡۦۘۡ۫ۢۨۘۥ۠ۗۜۘ۬۠ۦۨۥۜ۬۬ۜۘۘ۫ۚۙۢ۬ۧۤۥۗۖۥۚۧۗۘۡۘ۟ۙ۬ۚۡۗۘۦ۠ۖۢۙۢۜۜۘۛۥۖ۬۟ۦۘ۬ۗۥۡۜۨۘ۠۬ۛۥۚۜ۫ۖۚۤ۫ۖۘۨ۬ۢۡۨۦۘۨ۠ۖ۠ۦۥۘۡ۫ۨ۫ۤۘۘ۫ۜۦۘۖ۠ۗۧۜۜۘۜ۫ۢ" : "ۛۖ۬ۡۚ۬ۡۙۘۜۥۛۗ۬ۨۤۧۙۦۥۥ۟۟ۘۛۧۛۙۢۜ۠ۜۖۥۗۜ۫ۜۚۙۥۤۜۤۥۘۙ۠ۤۢۚۤ۫۠ۡۡۘۚۥۡۨۜۤ۠ۡۡۛۨۡۗۤۘ۟۬۠";
                                                                            case -360878962:
                                                                                str6 = "ۡۙۥۛۦ۫۟ۡۛۗۢۡۛ۟ۡۘۦۥۗۜۙۡۘ۫ۥ۟ۦۜۘ۟ۜۤۢ۠ۦۤۤۛ۠ۖۧۘۖ۫ۜۘۢۧۥۦۚۙۨۘۘۙۢۚۖۜۘۥۧۨۘۙۧ۬ۖۧ۟۠۠ۦ۟۟ۚۨۤۜۘۜۥۥۘ۬ۢۨۚۢۨۥۦۘۤۢۦۘۖۚۜۘۧۡۜۥۖۖ۫۫ۚۢۧۘ۫ۖۦۘۨۖۦۘ۟ۘۨۜۚۡۜۨۘۘۨۧۘۘۧۧۥۘۢ۬ۧۦۖۙۦ";
                                                                                break;
                                                                            case 5762074:
                                                                                str7 = "ۧ۠ۥۜۤۘۘۛ۬ۖۘۨۖۜ۟ۙۡ۟ۚۢۡۡۢۢۘۦۘۢۘۤ۫ۜۛۢ۟ۖۥۨۦۘۙۘۖۘۥۦۜۘ۠ۗۚۘ۟ۨۥۘۘۜۖ۫ۙۛۗۤ۠ۜ۟ۚۘۚ۬۟۠ۙۚۦۜۜۘۙۦۜۗۤۦۦ۟ۛۡ۫ۡۢۡۙۡۙ۬۫ۛۥۧۜۦۘۥۗۨۤۛ۬ۛۦۜۘۖۙۢۧۚۚۧۗۗ۟ۘۢۛ";
                                                                            case 1208510340:
                                                                                str6 = "ۗۤۧۤۙۙۦۧۦۢۚۗ۬ۚ۠ۗۡۖۖۡۛۘۖۤۚۜ۫۬ۗۧ۫ۗۡۙ۬۫ۤۖۚ۬ۧ۫ۖۥۘۦ۬۬۟ۖ۠ۚ۠ۡۘ۬ۥۨۧۨۥۥۥۧ۟۟ۘۘۚۨۡۘۘۙ۟۟ۖۗۢۤۖۗۡۨ۫ۚۚۢۚۥۘۤ۠ۤۙۨۤۙۨ۟ۢۤ۠ۘۜۡۘۘۜۖۗ۫۫۟ۜۚۨۜۘۘۖۨۢۥۜ۫۬ۛۤۚۜۦۨۘۦۦۦۘۘۨۜۘ";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 1926091058:
                                                        str5 = "۟ۘۥۘ۠ۖۚۧۤۚۚۖ۬۫ۧ۫۟ۡۧۘ۠ۗۤۨۢۜ۟ۦۖۘۡۗۗۡۘۧۛ۬ۜۘۖۖۘۨۘۦۘۢۦۗۡ۫ۜ۠ۘ۫ۧۤۤۨۤۢۡ۟ۤۦۨۜۗۥۨ۟۬ۗۤۚۜۘۗ۫ۢۚ۠ۖۥۢۥۗۤۤۘۡۙۤۨۡۤۘ۠۟ۥۘ۫ۧۜ۟ۡۜۘۖ۬ۡ";
                                                }
                                            }
                                            break;
                                        case -1523221026:
                                            str3 = "۫۠ۦۘۜۘۜۘ۬ۨۦۘۘۘۖ۫۬ۛۘۢۖ۠۠۠ۧۘۡۘ۟ۤۖۦ۫ۗۖۤۥۘۧۜۘۘۡ۠ۡۘۗۨۘۢۚۜۗ۠۬ۨۡۡۘۨۧۗۨۖۜۘ۫ۘۦۘ۫ۜۚۗۛۖۧۡۥۘۛۢۧۢۧ۫ۗۘۧۘ۟ۦۛۧ۠ۡۨۨۢۛۘ۫";
                                            break;
                                        case -1163153685:
                                            str4 = "ۙۥ۟ۦۘۖۘۜۧۛۤۧۙۤ۠ۦۘۚۖۥۖۢ۬ۚۦۘۜ۠ۘۡۨۖۘ۬ۢۨۤۦۡۚۦ۬۟ۖۧۘۘۚۨۘۚۧۥۘۧۙۢ۟ۛۖۘۥۥۜۘۤۖۥۖۛۧۜۢۤۜۗۤ۬۠۫۠۠ۜۧۧۦۘۘ۫ۧۛۙۗۦۛۜۘۛۢۖۘۢۘۥ۠ۚۧۖ۟ۥۡۚۘۤۢۢۧۤۡۗۧۧۧۥۦۘۥۥۜۨۡ۫۫ۤۤۛۥۘۘۙۥۖۘۚۦۜۘۘۢۧ";
                                        case -1095863692:
                                            str3 = "۬ۢۜۚ۠ۤۗۗۧ۫ۦۦۡ۟ۥۤۜۧۘۖۙۡۘۨ۟ۖۘ۠ۧۙۡۥۜۘ۬ۡۚۖۢۨۦۖۖۘۗۡۖۡۜۤۛۨۧۘۡۜۗۖۚ۟۟ۨۙۨۦۜ۠ۢۛۗۨۨۘۖۚۧۦۨۥۡ۫ۖۘۖ۫ۦۘۢۚۜۚۨۡۘ۠ۥ۠ۢ۬ۙۛۙۘۘۘۥۡۘۚ۫ۦۚۤۘۘۦۥۛ۟۫ۦۘ۬ۦۜۛۢۦۤ۠ۦۘۛۜۘ۟ۡ۬ۗۗ۠ۜۨۖۘۖۙۨۘۚ۬ۥۘ";
                                            break;
                                    }
                                }
                                break;
                            case 34720585:
                                str2 = "ۙۗ۬ۨۥۢۚۗۚۘۤۨۘ۬ۤ۫ۥ۠ۗ۫ۥۜۥۨۖۨۤۦۘۧۗۡۘ۬ۡۢۧ۟ۡۘ۬ۛۨۜۜۘ۟ۙۖۢ۫ۨۘۨۥۡۘۘۦۤ۟ۖۖۘ۠ۨۘۜۧۘۘۧۦۥۦ۠۫ۧۚۢۜۦۧۘۗۢۛۘ۬ۖۨۢۦۢ۟ۚۛۖ";
                                continue;
                            case 278777476:
                                str3 = "ۙۧۦۘۙۥۡۘۛۖ۟ۢۗۜۚۢۡۘۖۡۘۗۖۦۥۦۦۗۧۙۘ۟ۢۘ۬ۚ۬۠۬ۖۖۧۘۡۗۨۙۖۙۛۥۦۘۨۢۦۘۨ۫ۥۘۧۢۖۜۦۨۥ۠ۦۘۨ۟ۖۘ۠ۚ۫۟ۚ۟۟ۜۡۘۛ۠۟ۛۢ۠۫ۚۗۢۚۙۙۤۜۘ";
                            case 1012812808:
                                str2 = "ۗۚ۟ۤ۬ۘۘۘ۟۟ۤ۟۟ۥۖ۟ۛ۟ۥۘۚۜۤۡۚۥۨ۬۫ۗۖۘۖ۠۟ۖۦۗۛۨۡۥۛۨۘۨۗۥ۬ۨۖۛۨۥۘۢۘۘۘۧۦۘ۠۠ۘۙ۬۫۟ۛۥۘۙ۠ۥۗۢۨۖۗۖۗۡۜۢۤ۫۟ۜۨۘۛۧ۟ۤ۠۬۠ۡۘۡ۠ۗۘۘۚۘۛۡ۠ۦۦۡۨۘۥۧۜۦۚۢۢۡۚۨۖۖۘ";
                                continue;
                        }
                    }
                    break;
            }
        }
    }

    public float readFloat(String str) {
        String str2 = "ۨۜۦۘ۟ۨۨۦۦۦۡۧۜۢ۠ۜۘۢ۠ۥۘۗۛۡۘۥۥۦۤۛۧۜۦۡۨۢۤۘۙۡۘۨۢۨ۫ۥۧۘۧ۠ۨۘ۠ۗۘۚ۬ۛۘۖۖۥۜ۟ۖۘۧۘۧ۟۟۟ۥۨۘ۟ۦ۬ۜۜۨۘۜۧ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 715) ^ 641) ^ 933) ^ 39) ^ 666) ^ 635) ^ 810) ^ 39) ^ 159) ^ 455) ^ 70) ^ 686) ^ 208) ^ 538) ^ 683) ^ 755) ^ 336) ^ 488) ^ 132) ^ 712) ^ 954) ^ 22) ^ 227) ^ 737) ^ 268) ^ 215) ^ 170) ^ 399) ^ InputDeviceCompat.SOURCE_KEYBOARD) ^ 590) ^ 963) ^ 813451311) {
                case -2087843091:
                    str2 = "ۤۦۘۨۙ۟ۡۥۢۧ۟ۙ۫ۥۨۘۨۛۥۘۘ۬۠ۚۤۡۨۧۨۨۥۥۤۦۘۛۖۢۤۙۧۚ۫۟۫ۘۘۧۚۗ۟ۢۘۘۢ۠۬۠ۘۢ۠ۖۧۚۚۗۡۢۜۡۨۘ۟۬ۘۘۚ۬ۘۚۙ۬ۡۢۚۨۦۖۘۛۜ۫۬۫ۛ۬ۦۡۖۜۘۗۗۤ۬۟ۧۚۘۧۘ۠ۜۨۙۛۥۚ۠ۛۚ۫ۢۦۖۙ";
                    break;
                case -1194658356:
                    return this.sharedPreferences.getFloat(str, DEFAULT_FLOAT_VALUE);
                case 1118122154:
                    str2 = "ۙۢۜۜ۠ۖۙۢۖۘۖ۬۟ۙ۠ۜۦۘۘۢۤۤۜۛۢۡۢ۫ۦۦۙۨ۠ۚۜۘۨۗ۬ۦ۬ۧ۫ۗۥۘۜ۠ۘۘ۫ۘۜۡ۟ۡۜۚۧۘ۬۫۫ۨۨۢۗۥۖۨۚۜۜۛ۫ۡۢۖۡۙ۠۟ۛۧۙۖۘۘۥۦۘ۬ۨۨۡۖۚ۫ۧۥۚۘۙۚۢۨۘ۫ۥۖۘ";
                    break;
            }
        }
    }

    public float readFloat(String str, float f) {
        String str2 = "۟ۗۢۧۜۛۘ۠ۚۨۦۢۛ۬ۗۦۙۨۘ۠ۤۢۢۧۤۚۢۧۤۖۙۚۙۥۤۘۙۖ۠ۥ۠ۨۨ۠ۥۨۘۙۙۖۘۘۜۧ۬ۨۘ۟۟ۥ۟۫ۨۘۡۗۨۧۧۖۘۧۚۡۧۖ۠ۛۧ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 304) ^ 345) ^ 719) ^ 285) ^ 895) ^ 375) ^ 663) ^ 897) ^ 275) ^ 726) ^ 955) ^ PointerIconCompat.TYPE_CROSSHAIR) ^ 917) ^ 314) ^ 341) ^ 492) ^ 345) ^ 110) ^ 323) ^ 967) ^ 607) ^ 918) ^ 727) ^ 158) ^ 618) ^ 544) ^ 322) ^ 452) ^ 98) ^ 712) ^ 610) ^ 1193139778) {
                case -2079660911:
                    str2 = "ۙۜۨۘۨ۟ۡۘۜۙۢ۬ۘۘۡۘۥۖۨۜۡۛۜۘ۬ۜۖۙۧۨۘۤۢۤ۟۬ۦۘ۬۬ۥۘۦ۟ۦۗۨۧۘۨۨۖۘۘ۟ۡۘ۟ۚۥۜۤۗۨۧۦۗۦۙۗۦۘۙۖۦۘۧ۫ۧ۟۫۫ۘۚۨۧۡۚۚۙۧۖۤۡۖۗۨ۠ۘۥۘۚۗۖۘ۬ۤۦۘۤۘۥ۫ۚۥۘ۬ۢۨ۫۫ۦۖۤۗۚۘۗۚۥۢۚۙۗ";
                    break;
                case -613599310:
                    str2 = "ۨ۟ۧۢۙۖۘۖۜ۠ۖ۫۠ۖۜۡ۫۫ۜۘۗۡۡۘۘۘۨ۬۟ۢ۠ۖۜۘۢ۬ۜۘ۟ۢۜۦۙۖۘۡۚۤۥۙ۬ۧۖ۟ۤۚۨۡ۟ۤۤۙ۠ۘۨۡۨ۟ۢۖ۟ۜۘۤۜۡۧۧۦۘ۟ۧۥ";
                    break;
                case -541068006:
                    return this.sharedPreferences.getFloat(str, f);
                case 2070849165:
                    str2 = "ۙ۠ۦۘۜۧۗۗۢۦۨۦۡۘۧۖۦۖ۫ۛۦۚۘۨۗۤۡ۬ۙۨۛۥ۬۟ۜۤۘ۫ۛۡ۬ۛۧۦۥۢۤۙ۫ۥۘ۬۠ۥ۬ۘۖۘ۬ۚۧۚۘۘۖۥۧۛ۬ۜ۠ۙۘۚۜۜۨۨ";
                    break;
            }
        }
    }

    public int readInt(String str) {
        String str2 = "۬ۚۙۗۢۥۘۗۜۛۧۡ۟ۧ۬ۛۧۢۙ۬ۘۢۦ۟ۡۧۚۜۘۗۢۗۨۖ۬ۧۛۡۥۘۡۡۤۘۦۢۡۘۗۤۖۤ۬ۦۘۨۙ۬ۧۧۥۘۙ۬ۜۘ۟۫ۧ۟۫ۘۦۛۘۗ۟ۤ۬۟ۚۡ۫ۘۘ۠ۖۨۚۗۜۥۦۢۛ۟ۥۘ۫ۜۚ۫۫ۛۖۦۛۨ۫ۚۤ۠۫";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 983) ^ 521) ^ 627) ^ 653) ^ 842) ^ 934) ^ 179) ^ 162) ^ 678) ^ 996) ^ 339) ^ 330) ^ 128) ^ 296) ^ 378) ^ 769) ^ 422) ^ 718) ^ 562) ^ 914) ^ 129) ^ 737) ^ 269) ^ 909) ^ 87) ^ 919) ^ 604) ^ 854) ^ 829) ^ 528) ^ 622) ^ 304219990) {
                case -1666523387:
                    str2 = "۬ۢۖۘ۬ۥۥۘۚۛ۠ۖ۬ۦۘۢۡۘۘ۬۫ۤۢۨۧۘۗۛۘۗۖۧۗۖۖۘ۬ۛۤ۫ۚۤۖ۬ۙۙۧۚ۟۬ۚۦۗۘۡۥۗ۬۟ۨۙۨ۟ۥۤۤۢۚۦۨۡۘ۫۫ۨۦ۠ۤۢۚۨۗۚۢۨۙۦۘۡۦ۟ۨ۫۬ۤۜ۬ۤۖۜۜۦ۬ۚۨ۬ۗۢۢۗۘ۫ۤۙۨۗۚۧۙ۬ۙۢ۟ۚۙ۬۫";
                    break;
                case -1256730819:
                    str2 = "ۦ۟ۖۧ۟۟ۧۚۖۘۙۦ۬ۖ۠ۤ۟ۜۚۦۙ۬ۜۖۘۘۦۘۡ۫ۨ۫ۚۛ۫ۦۧۙۢۗۘۨۖۢ۟۬ۦ۠ۡۨۘۛۛۡ۟ۘۡۘۨۖۡۘۙۥۛۧۖۥۛۡۢۨ۬ۖ۠۟ۖۙۢۡۧۢۗۘۗۜ۫ۖ۠ۜۘ۫ۛ۬ۡۖۥۘ۫ۥ۫ۦ۟ۜۧۡۦۜ۠۫ۖ۟ۤۘۧۖۛۧۙۛۗۚۢۢ۫ۜۖۘۧۥۘۘۚۚۦۘۗۘۖۡۜۨۘ";
                    break;
                case 856100300:
                    return this.sharedPreferences.getInt(str, -1);
            }
        }
    }

    public int readInt(String str, int i) {
        String str2 = "ۙ۬ۜۘ۫ۗ۫ۢۗۨۡۛۜۘۚۦۦۖۚ۫ۥۦۨۤ۬ۛۦۦۛۨ۟۠ۘۦۘۡۤۥ۬ۧۤۧۛۥۘۘۗۛ۟ۘۚۗۡۙۛۛۜۤۢۙۤ۬ۥۘۡۜۙۛۗۨۙۧۚۡۡۡۤۛۦۧۤۙۗۥۖۡۧۦ۫۬ۧ۠ۤۡۨ۫۫۫۫ۡ۠۬ۥۘۗۘ۟ۥۜۙ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 327) ^ 571) ^ 85) ^ 158) ^ 785) ^ 921) ^ 751) ^ 869) ^ 145) ^ 557) ^ 202) ^ PointerIconCompat.TYPE_TOP_RIGHT_DIAGONAL_DOUBLE_ARROW) ^ 911) ^ 835) ^ 703) ^ 204) ^ 463) ^ 527) ^ 537) ^ 797) ^ 930) ^ 52) ^ 907) ^ 114) ^ 775) ^ 437) ^ 552) ^ 783) ^ 392) ^ 94) ^ 875) ^ 1192542013) {
                case -1303560256:
                    str2 = "ۖۨۜۘ۠ۖۡۙۘۥۚۘۡۘۛۗۡۘۧۙۨۨۜۨۦۢۖۜۥۢ۠ۜ۬ۨۛۦۘۜۘۗۖۡ۟ۙۧۡۚ۠ۡۘۢۚۢۛۨۙۤ۫ۘۦۜۦۜۙۘۥۧ۟ۨۖۡ۠ۢ۫ۢۨۧۖۢۦ۟ۜۘ۬ۨ۠ۢۜۦۘۤۡ۬ۗۛۗۧۚۖۘۦۜۨۨۚ۠ۖ۟ۤۛۨۙۗۦۥۘۡۗ۬ۡۜۚ۬ۦۥ";
                    break;
                case 619234360:
                    str2 = "۬ۛۢۥۘۜۜۧۨۥۨۘۢۤ۟ۖۖۜۘۙۢ۫ۧ۬۫ۚۤۥۘۧۛۨۘ۠ۧ۟ۙ۬ۨۨۥ۠ۖۛۙۨۛ۟ۗۜۨۘۙۥۥۗۤۦ۟ۙۨ۠ۙۢۖۧۜۤۡۡۘۧ۫ۥۛۥۖۡۖۦۥ۫ۡۘۗۡ۠ۦ۟ۦ۫ۦۛۦ۠ۗۤۤۡۜۗۜۨۘۘۗۨۘ۬ۗۨۥۚ۬ۤۤۘۘ۠۟ۡۘۜ۫ۜۘ۫ۤۘۦۦۤۤۗۨ۟ۥۖۘۦۛۦۙ۬ۖ";
                    break;
                case 1852908957:
                    str2 = "۠ۛۢۗۗۜۖۚۙ۬ۗۜۖۢۚۛ۬ۥۘۗۜۨ۟ۤۦۗۦ۬ۖۛۡۖۧ۬ۚ۟ۧۗۖ۠۟ۧۧۚ۬ۜۘۘ۟ۘ۬۠ۨۘۢۗۘۘۗۘۛۤۤ۟ۜۗ۠ۛۤ۬ۖۧۖۘ۫۬ۤۚۦۧۧۤۛۡ۫ۜ۫ۧۙۨ۠ۘۖۡ۬۫ۜۛۢۛ۫ۡ۬ۖۜۤۨۖ۬ۘ";
                    break;
                case 2022882425:
                    return this.sharedPreferences.getInt(str, i);
            }
        }
    }

    public long readLong(String str) {
        String str2 = "۟ۧۧۙ۟ۘۘۘۚۖۘۘۦ۬ۤۛۛۤۚۘۘۥۤۚۢۧ۠ۢۙۘ۟۬ۨۘ۟۟ۘۘۙۦۗۦۧۦۘۖۡۤۚۤ۬۟۫ۨ۫۫ۙۧۗۦۦۚ۬ۦ۠ۨۨۙ۬ۨۙۘۘ۟۬ۛۖۦۧۘۤۧۖۜ۠ۘۨ۟۠۠ۛۨۡۦۤۘ۠ۙ۫ۥۘ۫ۡ۟ۤۦۡۚۗۖۘۥۧ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 389) ^ 376) ^ 376) ^ 157) ^ 365) ^ 564) ^ 153) ^ 416) ^ 153) ^ 284) ^ 204) ^ 401) ^ 205) ^ 952) ^ 929) ^ 737) ^ 585) ^ 208) ^ 706) ^ 77) ^ 82) ^ 31) ^ 995) ^ 571) ^ 685) ^ 2) ^ 942) ^ 377) ^ 653) ^ 882) ^ 352) ^ (-825466663)) {
                case -1233273930:
                    str2 = "ۡ۫ۤۚۢۖۘۛۥۡۛۙۥۘۤۢۥۘۧۘۖۘۙ۟ۘۡۘۤۨۗۡۚ۟ۖۚ۟ۘ۬ۛۥۘۖۗۘۘ۠ۘۘۘۤۖۧۘۘۖۢۦۤۛۚ۬ۢۡۢ۟ۤۨۗۛۜۘۨۢۛۖۢۘۛۦ۟ۖۧۖۢۦۚ۟ۜۦۘ۬ۡۚۚۢۜۘۚۧۨۜۨۢ۠ۥۚۦۖۘ۬ۦۥۘۚۙۧ۬۬ۨۘ۬۠ۚۖۥۛۡۚ۬ۧۡۗ";
                    break;
                case 839450513:
                    str2 = "ۙۘ۫۠ۚۢۤۤۘ۫ۛۖۡۧ۬ۥۜۧۘۥۖۧۨۥ۠۟۟ۖۘ۫ۖۨۘ۫ۜۡۘۜ۟ۢ۠ۜ۬ۜۙۘۘۥۧ۬ۜۢۗۘۜۡۛۗۢۘ۫ۦۖۦۘۚۗۘۨۖ۫ۙۜۛۗۘۢ۟ۦۡ۬ۙۨ۠ۚۨ۠ۚۦۘ۫ۜۥۘۤۨۡۘۥۨۘۘۤۢۥۘۧ۠ۖۘ۟۬۫۟ۗۡ";
                    break;
                case 1267748475:
                    return this.sharedPreferences.getLong(str, -1L);
            }
        }
    }

    public long readLong(String str, long j) {
        String str2 = "۫۟ۤۗۖۦۙ۟ۦۘ۟ۦۛۤۖۘۥۨۨۘۘۤ۬ۡۢۖۧۦۡۛۨۨۘۜۗۨۜۖۥۘۙۧۢۥۚۧۖۖۜۖۘۥۦۡۘۨۖۦۘۧۥ۟ۥۧ۟ۜۥۖۗۘۜۜ۠ۦۘۤۘۢۧ۫۬ۦۤ۬ۤۧۙۢ۠۟ۗ۫ۘۦۡۦۘۛۧۖۘۨۥ۫ۦۘۦۘ۠ۧۜۘۙ۬ۨ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 823) ^ 555) ^ 25) ^ 60) ^ 376) ^ 940) ^ 944) ^ 655) ^ 430) ^ 614) ^ 803) ^ 957) ^ 36) ^ 890) ^ 676) ^ 510) ^ 858) ^ 234) ^ 702) ^ 646) ^ 183) ^ 525) ^ 643) ^ 499) ^ 405) ^ 349) ^ 744) ^ PointerIconCompat.TYPE_VERTICAL_DOUBLE_ARROW) ^ 879) ^ 57) ^ 800) ^ (-2130809786)) {
                case -406767882:
                    str2 = "ۢ۫ۨ۟۠ۦۤ۟۫ۘۛۜۧۜۘ۬۬۟ۤۖۗ۫۠ۜۘۦۘۡۘۙ۠ۡۘۧۡۗ۫ۘۧۛۢ۬ۥۧۘۢ۟۬ۙۥ۠۠ۚۘۢۛۨۦ۬ۜۡۙۙ۫ۢۤۗۦۛۘۨۛۦۜۤۡۥ";
                    break;
                case -68204598:
                    return this.sharedPreferences.getLong(str, j);
                case 1013060881:
                    str2 = "۟۟۫ۙ۬ۨۨ۫ۡ۫ۢ۬۠ۛ۟ۚۢۡۘ۟ۧۡۘ۠ۨۘۘۛۦۘۘ۟ۖ۬۠ۘۜۘۧۧۥ۫ۥۚ۫ۗ۟ۤۘۛ۠ۙۡۘۚۛۦۘۤۡۚۢۗۜۘۧۛۙۢۥۘۡۧۦۘۛ۬ۥۚۢۘ۠ۚۙ۟ۢۤ۟ۘۡۨۧۙ۟ۛ۫۬ۜۛۥۖۧۡۢۨۘۤ۠ۡۜۘۤ۠ۤ";
                    break;
                case 2031723650:
                    str2 = "ۦ۬ۛۖۢۧ۫ۨۨۥۧۨۘ۠ۗۘۘۧۛ۫۫۬ۨۜ۟ۤۧ۬ۦۘ۠ۡۦۘۨۜۨ۟ۛۨۦ۟ۡۚۛۗۨ۟ۡۜ۠۬۬۬ۖۗۖۘۗۦۡۤۢ۠ۥۦۦۘۛۥ۟ۛ۬ۦۘۘۙ۠ۖۘۙۧۤۜۦ۫ۨۚۗۡۦۢۜۡۧۤۧۡۘۜۧ۠ۨۨۡۘ۠۠ۨۘۡۚ۫";
                    break;
            }
        }
    }

    public void remove(String str) {
        String str2 = "ۖۨۘ۬۟۟ۗۡۖۘۗۤ۟ۛۥ۫ۘۜ۟ۖۧۥۘ۬۠ۧۖۖۙۧۗۙۥۛۖۘۨۗ۠۫ۧ۠ۨۡۚۙۜۚۨ۫ۖۘۨۢۡۘۗۚۨۡۨۡۘۡۗۡۘ۫ۗۥۘ۫ۥۛۖ۫ۡۦۙۡۘۖۗ۠";
        int i = 0;
        int i2 = 0;
        int i3 = 0;
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 986) ^ 681) ^ 191) ^ 255) ^ 767) ^ 576) ^ 128) ^ 87) ^ 85) ^ 661) ^ 843) ^ 363) ^ 472) ^ 431) ^ 304) ^ 970) ^ 784) ^ 541) ^ 472) ^ 460) ^ 46) ^ 925) ^ 370) ^ 668) ^ 261) ^ 54) ^ 997) ^ 848) ^ 150) ^ 647) ^ 772) ^ (-247006965)) {
                case -2090461890:
                    str2 = "ۨۨۨ۠ۛۥۘۢۛۤ۬ۜۦۘ۬ۧۜۘۢۜۧ۫ۤۨ۠ۦ۫۬ۤۚ۠۬ۗۘۜۙۤۡۨۘۜۖۜۨۤۜۘۗۗۨۘۙۤ۟ۖۙ۬ۗۨ۬ۙۖ۠۬۬ۢ۬ۚۘۡ۫ۦۘۙۙۥ۠ۚۦۜۖۢ۫۬ۘۘۖۛۖۘۖ۫ۢ۠ۘۦۘۛۙۜۧ۬ۗ۬ۙۨۘۤۧۘۘۤ۠ۘۚۧۛۤ۬ۤۨۘۢۖۥۨۜ۠ۥۘۡ۫۟";
                    continue;
                case -2088795872:
                    str2 = "ۙ۫ۚ۟ۙۜۘۜ۟ۜۤۘۡۘ۠ۖۜۘۥۤۗ۫ۨۘۘۖۡۥۘ۟ۤۜۘۖۢۖۚۚۡۘ۠ۦۘۦۗۘۡ۫ۥۧۚۖ۬ۘ۫ۧۧۗۤۨۖۘۡۦۥۤۦ۫ۙۨۜ۫ۦۥۘۙۡ۫۠ۖۡۡ۠ۥۘۙۦۜۘۥۢۥ۠ۛۘ۬ۗۡ۟ۗۨۘ";
                    i2 = i;
                    continue;
                case -2066165713:
                    this.sharedPreferences.edit().remove(str).apply();
                    str2 = "ۤۚۚۖۗۖۘ۟ۘۨۘۤ۫ۨۘۢ۬ۡۘۧۘۖۘۘۦۜ۠ۖۜۚۧ۫ۜ۫۟ۗۥۗۡۡۥۘ۫ۦۘۘۢۛۜۘۜ۠ۖۘۗۖۗۘ۫ۥ۠۫ۡۡۛۦۚۢۦۖۙ۟ۦ۟ۚ۫ۗ۠ۨۢ۟ۗۘۙۡ۟ۙۗۙۡۖ۬ۘ۠ۦۖۘۦۦۙۙۛۨ۫۬ۘ۫ۜۗۗۘۧۘۦۘۜۖۘۥۘۗۘۙ۟ۥ۬۬ۚۖۥ۟ۡ";
                    continue;
                case -852294052:
                    String str3 = "ۛ۬ۢۙۚۘۘۨ۬۫۫ۙۘۜۙۙۚۦۖ۫ۨۨۘۚۧۥ۟ۖۜۘۚۙۡۘ۬۬ۦۘۛۙ۬۫ۨۘ۠ۗۜ۫ۡۦۘۡۤۖ۟ۛۧۘۢ۟ۥۜۚۢ۟۟۫ۛ۠ۡۤۘۙۡۢ۬۫ۜۘۤ۬ۖۤۥۧۡۜۧۘ۬ۧۧۚ۬ۛ۠ۜۢۡ۠ۦۘۘۦ۠ۜۜۡۘۥۥۥۘۙۡۧ";
                    while (true) {
                        switch (str3.hashCode() ^ 786057879) {
                            case -1880958676:
                                str3 = "ۤۗ۠ۛۥۢ۟ۛۘ۟ۦۖۘۨۙ۠ۡۚۚۦۚ۠ۛۨۢ۠ۛ۠ۖۦۗ۠ۜۗۡۢۖۥۨ۟ۙ۬ۨۘۘ۬ۚۡۙۢۢۦۦۥۖۧ۟ۘ۠۫ۙۜۡۖۘ۬ۘۤ۠۬۬ۡ۠ۨ۬۬ۥۖ۟ۡۘۙۢۦۘ۠۠ۖۥ۟ۤۨۛۡ۫۬ۡۛ۬ۜۘۚ۬ۘۖ۫ۥۘ۠ۤۤۖ۟۫ۢۤۨۘ۠ۥۛۡۙۗۧۘۥ";
                            case -942579265:
                                String str4 = "ۢۧۘ۬ۘۜۚۚۘۘۧۢۡۤۖ۟ۚۚۥۘۢۢۜۘۚۧۘۘ۠ۡۥ۟۠۫ۢۚ۬ۨۖۛۥۨۘۧ۟ۢ۫ۧ۟ۢۡۜ۬۠ۧۛ۫ۚۦۤۢۗۦۘ۫ۨۧۘۗۤۘ۫ۢۚۚۚۛۧ۠ۡۨۨۦۚ۠ۜۘۗۦۙۦۜ۫ۦۖۗۗۤۦۗۗۘ۠ۙ۠ۛۨۛۖۢۨۘۥۘۘۖۨۥۗۤۦ۫ۢۘ۟ۨۜۘ";
                                while (true) {
                                    switch (str4.hashCode() ^ (-1201953816)) {
                                        case -1668682494:
                                            str3 = "ۛۘۜۘ۬ۘۘۘۡۤۡۘۦ۫ۥۘ۫۠ۚ۟ۖۦۘۚۜۘۦۧۨۧ۠ۤۘۥۖۜ۬۬۠ۢۗۚۧۨۚۤۗ۟ۧۦۘ۬ۛ۬ۖۚۛۧۢۜۦ۠ۧۤۦۘ۟ۜۘۘۛ۬ۢۥۚۡۘۘۦۙ۠ۜۜۖۛۨۡۥ۫ۨۙۥۘۗۘۙۥۧۘ۟ۢۢۖۛۖۡۘۚۡۥ۫ۘۤۙۡ۠ۥۗۨۤۧۜۨۚۙۨ۠ۗ";
                                            break;
                                        case -856259274:
                                            str3 = "۟۬ۘ۬ۢۖۘۘۦ۬ۘۘۗۧۘۘۖۦۨۘۗۖۧۘۦۦۥ۫ۥۧۜ۠ۛۘ۟ۢۢۥۥۢ۬ۘۘۜۚۖۧ۠ۢ۠ۢۨۘۥۢۗۜ۫ۨۢۛۖۘۙۖۡۘۥۡۧۘ۬ۧۚۢ۫ۤۦۤۤۛۖ۬ۚۡۙۙۛۢۛۨۡۘۙ۬ۧۤۧ۠";
                                            break;
                                        case -180186394:
                                            String str5 = "ۙۢۡۘۖۧۨۘ۬۫۟ۡۗۖۘۚۗۧۡۚۜۚۤۥ۫۫ۥۘۧۡۘۚۖۡۗۗۦۢۛۘۘۚۜۥۘۤ۫۠ۚۥۘۦۡ۟ۛۛۜۘ۬ۖۖۘۢۚ۫ۧۡۚۥۡۧۧۗۘۥۢ۟ۚۢ۠۬ۗۙۛۚ۟۟ۚۖۘۤۤۗۗۢۙ۬ۘۜۖۧۡۢۨۚۘ۬ۦۛۖۘ۟ۗۧۦۚۥ۟۫ۡۦۥۤۚۥۜۧۤۚۖ۠۬ۧۜۛۧۨۡۘ۟ۥۙۖ۟ۥۘ";
                                            while (true) {
                                                switch (str5.hashCode() ^ (-1304394304)) {
                                                    case -2113815607:
                                                        str5 = "۫ۙۘۘۘۜۛۤۘۥۜۜۢۛۙۚۧۗۜۥۡۘ۠ۜۘۗۚۜۘۖۚۖ۠۬ۡۘۗۜۢۥۜۗۗۚۘ۬ۤۘۘۖۢ۫ۧۜۢۗ۟ۜۘ۠۫ۡۦۜۚۜۛۖۘۘۚۡۘ۠۫ۜۗۛۡۘۙۦۜ";
                                                    case -1364831141:
                                                        str4 = "ۤۧۗۗۦۨۘ۟ۚۧۢ۟ۛۡۖۨۘۗۥۡۥۙۖۚۜۨۤۥ۠ۧۘۘۖۤۜۦۨۦ۠ۜۜۘۧۢۘۘۜ۫ۡۜۘۨۘۘۡۡۘۚۖۖۘۛۙ۠۬ۙ۫ۜۜۡۘۖۖۦۨۡۨۘۤ۠ۡۘۜۨۦۘۖ۫ۨۥۜۡۘۗۢۢۙ۬ۦ۫۟ۢ";
                                                        break;
                                                    case 483574757:
                                                        String str6 = "۫ۢ۫۟ۜ۫ۡۦۘۜۚۧ۠ۧۚۧۚۨ۟۬ۜۡۗۚۨۦۧۥۜۘۖۙۚۢۛۛۜۙۦۘ۬ۧ۠ۦۗ۬ۘۡۖۘۥۥۛۢ۠۠ۥ۬ۦۘۦۧۙۘۛۦۘۖۡۡ۫ۙۖ۟۟ۤ۟ۢۙ۬ۖ۟۬۟ۛۦۛۧۡۡۘ۟ۗۘ۬ۗۢO۫ۚۗۛ۟ۗۦ۟ۡ";
                                                        while (true) {
                                                            switch (str6.hashCode() ^ 2127443002) {
                                                                case -933859082:
                                                                    str5 = "ۤ۠ۥۘۨۙۧۖۚۢۥۘۛۧۦۧۘۨۥۖۢۘۚۙۛۜۘۚۥۥۘۙۗۘۖ۫ۖۜۧۚۜۤۨۢ۫ۘۘۛۖ۬ۙۗۢ۟ۚ۬۫۟ۥۦ۟ۦۦۚ۬ۙۛۖۘۦۖۖۖۥۢۘۘۜۘۦ۬ۡۦۢۜۡۚۨ۟۟ۖۗۦۘۜۘۜۖۗ۫ۡ۬ۦۛ۟۫ۧۜۗۨۡ۫ۡۛۨۚۤۡۚ۬۫ۥ۫ۦۛ۠۬۬ۚۡ۠۟ۦۨۧۧۗ";
                                                                    break;
                                                                case -43569649:
                                                                    String str7 = "ۧۖۥۚۧۗ۬ۧۨۘۢۥ۫ۢۜۡ۠ۧۜۘ۟ۖۜۖۙ۟ۚۙۗۦۦۧۘۛۚۦۚۧۦۨۚۡۘۨۖ۫ۚ۫ۨۘ۬ۥۜۦۘۧ۟ۘۖۘۗۦۥۡۡۤۨۢ۠۠ۛۜۘۜ۟ۘۘۙۙ۟ۤۥۚۧ۬ۖۘۜۧۘ۫ۚۘۘۨۡۘۖۨۗۥۡۖۘۚۙۜۘۛۦۡۚۧۙۛۨ۫";
                                                                    while (true) {
                                                                        switch (str7.hashCode() ^ 1210238494) {
                                                                            case 843890239:
                                                                                str7 = i2 < i3 ? "۠ۗ۫ۢۗۤۚۡۧۘۙۨۜۦ۫ۧۘۧۜۢ۫۟ۖۖۨۤۜۤ۬۫ۨۘۦ۬ۥۘۛۨۨۘۤ۠ۙۙ۟ۘۜۨۧۢ۟ۖۘ۫ۚۜۢۥۙۢۨۡۘ۫ۖۧۖۢۙۘۜۡۜ۟ۢۡۥۨۘۨۜۛ۟ۥۘۜۚۧۛۜۢۦۢۙۖۧۘۦۢۜۘۚۚۤۜۧۢ۫ۖۧۗۖۤۢۖۧۛ۟ۦۘۧ۬۫ۢۢۛ۠۟ۗ۟۟۠ۜۖۢۗۚۦۜۛۘۧۡۗ" : "ۗۢۢۥۦ۟ۘۡۥۦۡۘ۠ۛۧۨ۬ۘ۠ۜۘۘۧۗۡۘ۫ۤۛۙۘۘۛۛۦۘۧۚۡۢۢ۠ۗۥۘۘۜۗۦۘۙۡۡۘۗۥۜۘۥۤۙۤ۬ۛ۫ۖ۠ۚۡ۬ۨۘۙ۟ۦۘۜۗۚۙۗۢۘۙۨۘۨۤۜۘ۟۠ۡ۟۠۠ۤ۠ۥۘ";
                                                                            case 1265155424:
                                                                                str6 = "۬ۜ۫۟ۘۥۚۚۗۦۗۢ۬۠ۘ۫۬ۢ۟ۚ۟ۛۡۧ۠ۨۖۘۡۖۘۘ۟ۘۘۤۢ۠ۖۛۖۧۛۧ۟ۦۘۗۤۡۘۙۚۨۜۡۘۗۡۥۧ۬ۤ۠۠ۙۗۡۥۘۙ۠ۘۘۦ۟ۧۙۘۦۘ";
                                                                                break;
                                                                            case 1985327474:
                                                                                str7 = "ۗۛۖۘۨۙۖۘ۬۫ۨۨ۠ۖۢ۟ۤ۬ۚۨۘۖۤۘۘۢۗ۬۟ۖۘۜۥۤ۫ۛۜۘۗۥۚ۠ۤۜۘ۟۫ۙ۬ۢ۠ۢ۟۟ۗۚۛ۟ۖۗۚۗۘۘۜ۬ۡۧ۬ۦۚۢۙۘ۬ۘ۟۠ۡۛۖۨۘۘۥۧۧۥۛۜۦۛۛۜۦۥۘۦۤۦۘ۫ۧۢۤۖۚ۬ۢۙۜۥۥۘۙۧۛۦۖۙ۬۫ۚۡ۠ۤ۫۫ۛۛۢۧۨۙۤۖۙۘۙۤۧ۫۫";
                                                                            case 2049204737:
                                                                                str6 = "ۖ۟ۨۘۨۜ۬ۡۦ۟ۡۤۦۘ۠ۗۙۧۗۦۧۜۥۘ۠ۛۧۖۥۦۘۘۢۛ۫ۡۢۤۦۙۙ۠۬۫۟ۨ۬ۨۚۜۨۖۛۢۦۖۘۘۛۥۤۥۘۡ۠ۘۘ۫۬ۚۧۡۥۜۤۖۘۗ۬ۖۘۖ۠ۛۢۛۡۘ۟۠ۗ۟۟۟ۧۚۗ";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case 687702180:
                                                                    str5 = "ۘۘۥۘۜ۟ۜۦ۠ۧۖۙۤۤۧۛۗۦۙۗۥۜۘۖۘۦۘۗۢۖۨۢۥۡ۫ۖۘۧۚۨۗ۟ۙ۫ۜۙۤ۠ۨۛۜۚۚ۫ۗۚۢۜۥ۠ۢۜۙ۫ۙۥۤۤۨ۫ۖۤۜۦۘۥۘۚ۟ۚ";
                                                                    break;
                                                                case 1710674468:
                                                                    str6 = "ۧۦۨ۫ۚۦۘۡۗۛۛۧۨۘۚۘۡۘ۠ۨۨۘ۬ۚۦۘۗۘ۬۬ۥ۫۫ۜۦۘۜۡۨۘۡۡۧۥۚۖۘۛۜۜۘ۟ۖ۫ۖۘۗ۫ۥۘۙۡۚۤ۬ۜۘۛۢۖۦۖۙۤۨۜۧۨۘۢۘۦۡۘۦۘۜۜۖۘۖۡۘۘۗۧۨۘۧۚۥ۟ۡۖ";
                                                            }
                                                        }
                                                        break;
                                                    case 1489048235:
                                                        str4 = "ۢۦۙۖ۠ۦۘ۫ۘۧ۫ۘ۠۫ۡۘۨۜۧۤۡ۟ۥۗۥ۟۠ۘۖ۟ۚ۟ۛ۫ۨۗۤۙۖۘ۟ۢ۠ۜۨۧۘۥۗۜۘۚۡۥۢۤ۬ۧۖۢۙ۟ۧۜۙۘۘۙۥۗۖۗۖۘۨۤۗۚۥۧۤۤۜۘۖۚۨۛۙۚۙۖۨۘۧۚۦۘۡۘۘۘۢ۠ۧ۫ۛۡۚۤ۫ۙۢۖۜۧۤ۠ۖۗۧۘۥۘۙۡۢ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 2100563592:
                                            str4 = "۫ۜۧۘۨۧ۫ۛۚۡۘۙۚۚۘ۠۫ۢۜۨۘۜۜۨۘۜۜ۠ۚۢ۠ۢۛۥۡۛۗۦۡۜۘۧ۫ۧۗۥۥۢۤۖۖۥۘ۟ۨۡۗۚۗۘۡۚ۬۬ۡۘۛۨۧۘۥ۫ۨۧۜۧۚۖۧۘۗ۫ۤ۬ۤۗۥۚۗۡۙ۠ۥۥ۠ۛ";
                                    }
                                }
                                break;
                            case -872565838:
                                break;
                            case -681801402:
                                str2 = "ۢۤۗ۟ۤۧ۟ۥۜۘۧۦۨۢۛۨۨۘ۫۠۟ۨۘۜ۬ۜۘ۠۟۟ۖۧۙۤۛۛۢۗ۟۬۫ۨۘۦۤۥۧۨۧۘۜ۠ۡۘۥۖۧۘ۟ۧۚۙ۫ۜۡ۬ۡۙۨ۟ۙۗۜۘۡۗۥۘۖۜۤۢۘ";
                                continue;
                        }
                    }
                    break;
                case -243042349:
                    return;
                case -179862483:
                    this.sharedPreferences.edit().remove(str + Deobfuscator$$app.getString(-3440722443385003849L) + i2 + Deobfuscator$$app.getString(-3440722434795069257L)).apply();
                    str2 = "ۙۘۥۦۗۖۘ۫۠ۥۘۛۘۨۖۡۥ۠ۧۥۢۘۥ۫ۨۤۖۥۙۢۨۘۘۘۧۢ۫۬ۦۡۥ۟ۢۥۖۧ۬ۢ۠ۥۘۦۥۘۙۚ۫ۨۡۡۘۜۛۗۙۜۘۜ۠ۘۘۧۙۦۘۤۡ۟۠ۧۡۘ";
                    continue;
                case 101923388:
                    String str8 = "ۜۙۖۘۘ۟ۨ۟ۜۡۘۡۗۖۘ۫ۜۛۥۗۧ۠۠ۦۘۙ۫۟ۤۥۘۢۘ۬ۗۧۖۚ۟ۥۘۗۙۜۦۗۧۥ۬ۨ۬ۤ۫ۘ۫ۛۜ۬ۙۦۘ۠ۡۘۖۘۦۛۨۘ۟ۜۤ۟ۗ۠۠ۡۘ۠۬ۜۘۧۗۨۘ۬ۚۥۘۙۜۨۜ۫ۘۘۜۜۜۨۡ۬ۤۦ۟۠۫ۥۡ۬ۢۛۤۜۘ";
                    while (true) {
                        switch (str8.hashCode() ^ (-536530679)) {
                            case -736246405:
                                str8 = "ۙۚۦۘ۬ۘۡۧ۬ۜۜۧۘۚۢۧۧۦۦۘۙۥۢۧ۬ۙۘ۫ۚ۠ۥ۟ۛۙۖۛ۠ۛۤ۟ۥۘۨۧۜۘۖۘۘۘۙۗۧ۠ۛۜۨۚ۟ۨۜ۟ۘۖۘۦ۫ۖۘۤۢ۟۟ۢ۬ۘۢۨۘۦ۬ۨ۬ۙۨۘۢۢۙ۠ۤۘۦۢۖ۟ۥۛۧۨۥۜۢۧۚۧ۟ۙۨۘۧۡۥۨ۬ۥۙ۠ۥۨ۠ۦۘۨۙۙۨۨۤۨۛۚۖ۟۟۟ۙۦۘۗ۫ۡ";
                            case 506824378:
                                String str9 = "ۖۧۘۘۗۧۨۘۢۡۘۤۘۥۘ۠ۥۘۤۘۜۘۤۨۜۘ۠ۗ۫ۖۤۥۘ۠ۦۚۤ۟ۚۙ۬ۘۘۥۧ۠۬ۚۦۤ۫ۦۖۡۖۧۢۖۢۚۤۗۧۡۘۛۨۖۘۦۢۢۛ۬ۛۜۗۡ۫ۥ۬ۢۜۨۘۦ۟ۡۘۜۖۗ۠ۢۖ۫ۙۥۘۘ۟ۧۥۢۡۛۦۘ۟ۛ۠ۛۨۘۜۢۙ";
                                while (true) {
                                    switch (str9.hashCode() ^ 262862034) {
                                        case -1591972923:
                                            str9 = "ۖۘۜۢ۟ۘۘۖۥۛۤۢ۫ۢۙۡۙۡ۟ۡۡۧۘ۬ۦۘۤۘۡۘۤۦ۫ۤۦۜۘۤۙۢۤ۟ۖۙۜ۠ۗۨۡۘۜ۟ۡۘۦۨ۟ۘ۟ۖۘۜۘۜۜ۟ۨۘۧۛ۬۟ۡۡۜۢۥۜۛۡۗۧۡۨۧۤۛۛۚۖ۟ۜۢۛۜۛۨۘ۬ۜۖۘ۟ۦۘۘۨۧۘ۟۬ۘ۠ۢ۫ۚۛۥۘ۬ۨۚۨۤۥ۟ۘۛ۟۫۬۠ۖۧ۟ۦۙۚۗۦۘۥۗ۬ۜۤ۬";
                                        case 398259294:
                                            str8 = "ۡ۟۟ۛۢۦۘ۫ۛۢۙۧۦۘۢۘۙۢۛۡۧۛۙۤۨۜ۫ۖۘۡۧ۟ۛۨۦۛۘۜۘۦۜۡۧۡۡۗ۟ۖۘ۟ۦۦۙۜۦۘۥۤۖ۟۠ۥۨۘۘۖ۟۠ۤ۟ۖۘ۬۫ۥۘ۫۟ۥۨۦۢۨۜۖۖۛۦۘۛۡۦۧۚۖۘۡۜ۟";
                                            break;
                                        case 839279330:
                                            str8 = "ۦۗۢۤۡۘۘۥۘۧۘۢۖۧۘۦۤۢ۫۠ۖۦ۟ۜۖۘۡۚ۠ۖۛۜۤۚۧۦۗۗۨۘۤۦۨۘۖ۟ۡۘۖۗ۟ۜۛۗۡ۟ۥۘۚۛ۫ۢ۫ۡۘۦۥۡۘۖۥۘۙۦۢ۬۫ۖۘۖۙ۟ۦۛ۬ۖ۫ۢۤ۠ۘۧۙ۠ۖۘ۠ۚۗۜۙۨۛۥۙۚۤ۟ۖۛۦۘ۫ۜۗۥۨۛ۠۟۠ۨۘۥۢۨ۠ۖۨۘۗ۫ۨۖ۟ۖۘ۫۠ۨۘۢۨ۫ۜۜۨ";
                                            break;
                                        case 1421565219:
                                            String str10 = "ۙ۫ۗۖۚۥۘۧ۠ۗ۬ۘ۠ۥۙۗۖۨۚۘۜۘۖۛ۬۬ۛۥۘ۫ۦۡۘۦ۫ۤۙۡۗۗۗۜۦ۠ۖۘ۬ۚۦۘۡ۬۟ۢۤ۫ۦۚ۟ۥۖۘۘۛۗۢ۟ۨۛۥۗۘ۫ۚۜۘۨۙۘۘۘۧۡۖ۫۬ۤۢۨۘۦۦۙ۟ۚۛۗۧۨۘۤۛۙۚ۟ۨۗۢۧۖ۟ۨۘ";
                                            while (true) {
                                                switch (str10.hashCode() ^ 373228873) {
                                                    case -1673234078:
                                                        str9 = "ۥۧۖۘۙۗ۠ۛ۠ۘۢۥۛۚ۠ۗ۫ۥۖۘۘۥۤۚۘۦۘۥۧۘۦۧۦۘۦۙۥۘۢ۟۠ۦۦۛۘ۫۠ۢۢۖۙۘۘ۠ۢۥۤۤۥۗۗۧ۟۫۬ۧۗۗۧ۬۠ۢ۠ۧ۠۠ۛۡۡۗ";
                                                        break;
                                                    case -714328877:
                                                        str9 = "۫ۜۖۡۙ۫ۤ۠ۨۘۢۖ۫۟ۥۧ۫ۧۗۚۙۖ۫ۖۡۤۚ۬ۢ۫ۡۥ۫ۧۦۨۚۡ۠ۙۛۨ۫۟ۦۘۖۙۘۘۦۢۚۘۦ۟ۜ۠ۚ۫ۗۦۢۛ۫ۘ۟ۙۡۚۡۘۧۖۘۘ۠ۗ۟ۢۙۘ۟ۗ۟ۜ۠ۘۚۢۥۥۢۨۡۢ۫ۨۧۚ۬ۡۘ۟ۘ۬۠ۚ۫ۤ۬ۖۘۗۗۡۘۤ۫ۘۡۡۡۘۤۗ۬";
                                                        break;
                                                    case -93612864:
                                                        str10 = "ۘ۠ۙۘۜۘۧۙۥۘۚۚ۠ۢۦۖۘۘ۫ۦ۬ۘۜۜۘۦۨ۫ۢۛۨۘۛۥۧۘۡۘ۬ۖۡۙۖۗۦۘۤۨۧۤۨۚ۬۬ۜۤۙۡۨ۬ۜۘۤۚ۫۟ۚۨ۟۬ۨۦۗۙۗ۟ۧۛۧۛ۬ۦۗۨۢۥۘۚۘۖۘۖۗۦۘۢۜ۠ۚ۠ۖۘۘۥۚۛۙۡ۫ۜۘۦۡۛ";
                                                    case 1338195112:
                                                        String str11 = "ۤۥ۫۠ۙۢ۠۬ۨۘۘۗۡۗۗۜۗۤۜ۬ۤۢۦۜۢۦۘۡۘ۫ۥۥۘۗۦۥۘۛۗۖۜۙۚۚۛۜ۬۠ۘۗۤ۫ۢۜۨۡۜۧۨۡۤۗ۠ۛۛ۠ۧ۠ۥ۫۠ۖۘۜۡ۟ۤۛۜۧۤ۟ۧۧ۟ۚۖ۟۠ۢۚ۟ۡۚ";
                                                        while (true) {
                                                            switch (str11.hashCode() ^ 1048576699) {
                                                                case -1828872875:
                                                                    str10 = "ۤ۬۠ۛۘ۬ۤۦ۠ۦۤۜۘۙۙۜ۬ۛۨۘۢۙۖۘۜۚۤۛۚۗ۫ۖۢ۟ۛۖۤۖۦۘۙ۫ۜۜۤۨۗ۠ۨۘ۟۬ۛ۟ۨۜۘۥ۬ۥۘۦۚۗۡۛۥۘۖۡۙۥۤۤۥۤۚۡۗۦۨۦۤ۫ۙۦۘ۟ۢۧۤۜۡ۫ۙۦۘۥۚۗۤ۫ۘۘۘۥۥۧۡۤ۫ۦۤۘ۠ۖۢ۫۠ۤۤ۬ۨۛۡۛۙۘۡ۠ۜۢۡۙۥۢۙۚۙ۠ۢۛۨۜۜۘ";
                                                                    break;
                                                                case 305652571:
                                                                    String str12 = "۫۫ۨۘۙۖۢۘۦۜۘ۠ۥۘۘۢۖۥۘۥۗۘۘۖۨۦۜۖۦۘۛۨۙ۫ۘۧۘۡۥۜۚۖۛۖۜۡۙۡۨۘ۬ۗۥۚۤۖۘۥۘ۠ۧ۫ۡۖ۬ۖۚۚۘۘۦۗۚۚ۠۠ۛ۬ۦۘۙۧۨۨۛۖ۬ۦۖۚۤۜۘۜۗۚ۬۟ۜۘۛۚۡۚۡۘۛۥ۠ۙ۠ۜۛۢۥۖۥۘۖۙۜۘۘۜ۫ۦۥۥۘۙۢ۠ۧۥۡۘ";
                                                                    while (true) {
                                                                        switch (str12.hashCode() ^ 1190361261) {
                                                                            case -914844989:
                                                                                str11 = "ۡۖۖۡۥ۫ۧ۫ۨۘۖۥ۫۫ۨۛۥۨۥ۠ۨۥۘۛۥۥۘۥۛۘۖۚۥ۠ۖۡۘۨۗۥۦ۫ۨۘۛ۟ۡۘۙۜ۠ۡۨ۟ۥۘۦ۠۫۫ۗۢۗۦۚۥ۟ۛ۬ۚۨۥۨ۟۫۫ۨۘ۬ۨۦ۟۫ۜۘۛۦۥۨۙۛۡۗ۟ۗۜۚۗۢ۠۟ۖ۟ۖ۠ۙ۬ۤۢۙ۫ۡۘ";
                                                                                break;
                                                                            case -745795589:
                                                                                str11 = "۫۬۬۟ۤۨۢۢ۬ۨۘۨۖۛۖۘۛۚۖۦۘۨۢۘۥۘۛ۫ۦۛ۟ۘ۠ۢۦۘۦۖۙ۟ۘ۟۠ۖۘۜۜ۬ۧۖۨۘۥۤۢۢۚۙۜۨۖۡۚ۬ۙ۫۫ۚۛۜۘۧۙۖۚۧۢۚ۟ۧ";
                                                                                break;
                                                                            case -432226034:
                                                                                str12 = i3 >= 0 ? "ۜۗۜۛۧۥۜ۫ۗ۬۫ۧۖۥۦۖ۫۫۟ۗۧۛ۠ۖ۬ۗۥۚۡ۟ۚۡۖۘ۟ۚۚۚۛۖۙۙۗۧ۠ۤۘۘۙ۬ۧ۫۠ۛ۠ۤ۠ۥ۟ۥۦ۬ۤۙۛۡۘ۫ۧۙۦ۫۫ۦ۬۬ۜۖۦ۠ۧ۟ۖ۟ۦۘۡۘۧۡۚۥۙۖۘۜۘۧۤۥۧ۬ۡۖ۫ۨۘۥۦ۫۬ۜۙۗۨۡۘۖۢۗ۠ۜۧ" : "۟۠ۚۥ۬ۥ۫۬ۥۛۘۘۖۚۧۖۙۢ۠ۧۘۘۤۚۙ۟۫ۙۙ۬ۘۘ۬ۥۨۘۤۖ۠ۤۧۜۘۨۛ۫ۗۤۥ۬ۤۖ۠ۘۤۜۥۗۦ۬ۡۚۧۛۧۚۢۤ۠ۨۗۗ۬۟ۖ۬۬ۦ۬ۥۨ۫ۢ۬ۡۥۤ۟ۧۡۢۗۙۜ۠ۤ۟ۢۢۡ۟ۦۖۤۤۦ۬ۖۙۥۧ۠ۗ۬ۥۘۢ۬ۦ۬ۙ۬ۨۦۥ";
                                                                            case 891553390:
                                                                                str12 = "ۥ۫ۙۡ۟۟ۘۜۘۧۧۚۖۛۡۘۗۦۦۘۤۧۦ۠ۚۨۘۙۚۘۤۥۘ۬ۚۢۡۖۜۘۙۧۚۥۢۦۛۗۗۛۙۡۤۖۧۨ۫ۘۖۛۡ۫ۡۧۘۘۡۜۛۛۘۘ۬ۤۖۘۚۥ۫۫ۜۦۘ۠ۦ۠ۗۧ۫ۤۙۤۦۖۥۢ۟ۙۡۜۤۗۡۦۘۧۘۘۗ۟۠ۘۢ۬";
                                                                        }
                                                                    }
                                                                    break;
                                                                case 627750123:
                                                                    str10 = "ۥۢۗۗۜ۠ۧۧ۬ۙۚۧۖۛۙۖۚۜۡۢۛ۠ۤ۬۟ۗۛۢۙۤ۬ۜۛۚۤ۫ۖۦۖۤ۬ۚۙۗۡۘۧ۫ۤۗۚ۟۬ۗ۬ۧ۟ۢۡۘ۬ۤ۠ۛۧۛۙۥۧۘۛ۫ۥۜۛۢۜۨۘۡۖۥۘ۬۫ۖ۟۟ۘۘۥۦۧۧ۫۠ۛۥۡۘۨۡۤۨۦۨۦۨۧۧۡۨۘۧۚۖۘۢۜۥۘۧ۠۟ۙ۫ۥ";
                                                                    break;
                                                                case 1394363638:
                                                                    str11 = "ۦۥۘۜۨۨ۬ۚۨۧۛۖۘ۬ۚۚۖۚۤۥۢ۟ۡۨۜۘۘۘۦۘ۫ۗ۫ۢۙۜۘۙۙۖۘۦۖۦۨۡۦۢۖۙۘۗۦۚ۬۟ۖۚۘۘۦۚ۠ۥۥۘۘ۠ۧۘ۟ۢۦ۬ۘ۠ۦۗۧۤۦۜۘۢۥۚ۠۬ۛۚۚۥ۟۠ۡۨۥ۠ۙۜۙ۠ۢۡۘ۫ۥۗۚۗۨ۬۠ۘۘۜۙ۠ۘۤۢۥۥ۫ۘۖۨۖۥۛۛۡۜۦ۫ۨۘۗۡۚۖۗۙۜۧۙ";
                                                            }
                                                        }
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 1515724967:
                                break;
                            case 2006256347:
                                str2 = "ۥۨ۟ۖۧ۠ۚۤۛ۫ۖۡ۠۬۫ۤ۠۬ۧۜۗۙۖۛۥۧۧ۟ۘۥ۫۫ۖۦۜۡ۟۬۬ۙۚۦۗۧۡۥ۠ۖۡۦۦۧۙۨۢ۬ۗۘ۠ۖۦۗۡۨۘ۫ۗۛۚ۫۫ۚۨۘ۟ۢ۠ۢۦۗۚۤۙۡۨۗۙ۫ۨۘ";
                                continue;
                        }
                    }
                    break;
                case 120962074:
                    i = i2 + 1;
                    str2 = "ۚۢۡۗۙ۬ۤ۟ۖۜۡۘۡۤۘ۬ۖۜۤۡۗۤۧۦۨۖۘ۟۫ۖۘ۠ۙ۬ۘ۠۬ۚۛ۠۫ۗۘۘۤۧۦۘۖ۫ۦۘۡ۫ۙ۠ۗ۟ۧۤۤۚۚۛۥۛۜ۬ۤۢۧۡۤ۟ۚ۬ۛ۟ۜۘۗۙۡۘۙ۟ۨۡۧۖۘ۟ۚۘۘۢۚ۫۫ۜ۟ۧۢۚۛ۟ۧۙۛۚۡۛۗۧۥۘۥۖۛۡۡ۫ۧۧۘۘۥۗۥۥۘۥۘۖۙۖۢۨۛۡۘۖۥۛ";
                    continue;
                case 553033545:
                    i3 = readInt(str + Deobfuscator$$app.getString(-3440722786982387529L));
                    str2 = "ۚۡۦۦ۟ۙۙۖ۟ۖۨۘۤۜۥۘۨۡ۠ۥۘۧۘۧۚ۫ۘۤۡۘۚۗۦۘ۬ۦۗۘۧ۠ۥۚۖۘ۟ۗۤۘۢۨۢۥ۟ۢ۬ۦ۟ۨۘۖۥۤۗۙۗۜۤۦۛۚۦۘۚۜۙ۬ۨۘۧۙۙ";
                    continue;
                case 719953093:
                    String str13 = "ۖ۠ۦ۠ۤۙۙۥۡ۟۠ۖۢۥۘۚۛۖۢۨۨۢۥ۠ۙۥۜۘ۬ۛۜۘۖۨۦ۟ۜ۬ۡۡۚۡۘۚۥ۬ۥۢ۬ۛۗۙۗۧۦ۟ۢۖۘۜۜ۠ۤ۠۫ۤۦۗۜۡۨۘۨۛۥۧۧ۠ۖ۠ۨۘ۟ۥۦۘ۫ۡۢۜۤۦۙۚ";
                    while (true) {
                        switch (str13.hashCode() ^ (-532301472)) {
                            case -1986749677:
                                String str14 = "ۙۥۗۨۥۤۘۜۧۧۖۘۛۙ۟ۡ۟ۚۥۙۡۗۖۙۦ۠ۚ۫ۦۡۘۨۜۢۤۙۗۜۥۘۥۛۤ۫۫۠ۨۚۡۛۢۦۨۧۘۤ۠ۢۥۥۧۖ۠ۥۘ۠۠۬۠۠ۢۡۙ۟ۚۨ";
                                while (true) {
                                    switch (str14.hashCode() ^ (-1386651388)) {
                                        case -1966984821:
                                            str14 = "ۨۨۧۘۘۦۥۦۖۜۘۗۤۢۖۡۜ۫ۜۜۘۗۡۚۨۜ۠ۢۖۤۖ۬۟ۦۛۥۨۜۘۖۜۘۘۛۛۙۚۧۗۖۨۚۙۥ۬۫ۧۨۗۡۘۙۙۖۦۙۦۘۥ۫ۚۢۨۨۙ۫ۦۘۥ۠ۜ";
                                        case -1413763335:
                                            String str15 = "۠ۗ۟ۤۗۖۘ۫ۢۡۘۦ۫ۖۡۧۘۘ۫ۨۦ۠ۛۘۘۘ۟ۘۚ۫ۢۢۛۖۘ۬ۚۥۥۜۘۡۗۘۘۜۢۘۘ۠ۖۜۘ۫ۡۡ۬۫۠ۛۦۦۘۛۘۧۖۥۤۜۦۘۨۜۙۖۧۘۘۧ۬ۦۛۥۢ۠ۦۡۘۛۚ۫۟۫ۘۜۢۜۢۢۙۥۚۥۤۥۧۙ۬ۥۘۨ۬۠ۙۚۦۖۥۧۘ۫ۥۜۤ۟ۥ۫ۡۘۢۖۥۘ";
                                            while (true) {
                                                switch (str15.hashCode() ^ 539374823) {
                                                    case -2088355742:
                                                        str14 = "ۗۚۡۢۤ۫۫ۖۡۗ۫۫ۨۧۗۥۢۘۡۘۡۗ۫ۜۚۙۘۦۡ۟ۦۧۘۜۖۚۢۗۘۤۡۚۘۦۘۘۤۨۧۘۗۗۗۚۥۙ۫ۤۘۜ۫۟ۘ۟۬ۤۖ۠۬۫ۖۤۛۦۤۙۛۚۗۖۘۤ۠ۨۘۦۘۛۖۖۘۨۤۤ";
                                                        break;
                                                    case -1412805581:
                                                        String str16 = "۬ۘۡۘۜۧ۠۠ۚ۫ۨۨۥۧۤ۟ۢۛۧۗۗۡۘۚۛ۫ۢۚۙۛ۫ۥۙ۟ۧۦۘۨۤ۫۠ۖۜۧۘۥۧۡۘ۫ۨۚ۠ۛۜۘۙۖۡۡۚۗۦ۫ۥ۠ۖۘۢۗۤۨۡۨۘۘ۟ۨۚۥۦۘ۬ۨۚۛۛۘۘۦۨ۫ۙۙۧۨۥۖۦۚۦۘۚۜۘۘۦۦۥۘۡۤۦۘۨۡۘ";
                                                        while (true) {
                                                            switch (str16.hashCode() ^ 2071804750) {
                                                                case -614572641:
                                                                    str15 = "ۚۙۦۖ۠ۡۘۛ۬ۤ۫ۜۜۗ۠ۡۘۥۦ۬ۨۘۦۦ۫ۡۤۦۜۥۡۘۢ۠ۜۗۨۚ۬ۘ۟۫ۨۙۤۛ۠ۢۜۤۖۡۥۧۘ۬ۧ۫ۢۢۢ۬ۡۦ۟ۨۦۦۤۨۘۥۙۤۧۦۘۘ";
                                                                    break;
                                                                case -471263246:
                                                                    str15 = "۫ۢۘ۠ۖ۬۟ۛۧ۬ۙۦۘۘۧۡۘۤۤۨ۟۟ۥۘۧۘ۠ۤ۬ۜۗۘۗ۫ۢۖۘ۠ۤۨۘ۠۫۟ۥ۠ۨۘۛۙۙۤۧ۠ۢۡۘ۟ۢۨۙۥۚۦ۠۬۟ۙۥۘۦۘۘۜۛۜۡۤۥ۬ۙۛۥۥۥۢۛۛ۬ۚۡۘ۬ۛ۫ۘ۟ۨۘ";
                                                                    break;
                                                                case 619678581:
                                                                    String str17 = "ۡۛۚۜۢۛۧۢۦۜۘۗۜۨۙۛۜۘۘۜۥ۟۟ۤۥ۠ۤ۠ۘۙۗۙۚۢ۫ۛۥۖۨۗۙۜۙۥۨۘ۫ۤۦۤۤ۠ۥۖۜۗۙۜۘۥ۬ۜۨۤ۟ۥۘۘۧۡۘۘۙ۠ۙۤ۠ۙۛۦۖۤۤۖۘۦ۬ۗۥۧۛۦۜۤۧۥۡۘ۫ۛۢ۬ۦۧۘۤۧۡۘ۫۬ۗ۫۠۬ۦۛ۬ۚۢۥۘ۟ۛۢۚۧۘۘ";
                                                                    while (true) {
                                                                        switch (str17.hashCode() ^ 1650041791) {
                                                                            case -784538077:
                                                                                str16 = "۫ۨۖ۟ۤۖۘۚ۬۫۬ۘۦۘۘۤۥۚۗۨۖۘۗۨ۬ۥۥۙۘۗۖۡ۬ۦۗۧۖۗۦۖۖۚۢۗۤۛ۫ۡۗۨۢ۟ۛۙۖۧۘۥۢۤۥۦۘۘۡۙۘ۬ۦۨۘۥۥ۠ۗۖۢۡۦۨۙۦۘۛۛۜۙۤۗۜ۬ۥۘۨۛۦۘ۠ۤ۬۫ۛ۬۠۟ۜۘۨۛۥۘۚۨۡ۬ۨۙۧ۠ۨۘۜۘ۫ۨۙۤۙ۫ۢۢۜۥۚۘۦۘۤۥۧ۟ۡۚۥۙۚ";
                                                                                break;
                                                                            case -34023026:
                                                                                str16 = "ۜ۠ۥ۫ۧۧ۬ۖۢۙۖ۫۠ۗ۟ۙۜۧۛۗۖۖۡۥۘۖ۫ۨۡۛ۬ۜۤۡۖ۫ۥۡۨۚ۬۠ۗ۟۬ۦۙۨۜۘۗ۫ۖۘۗۖ۬۬ۙۙ۟ۡۡۧۢۚۜ۬ۦۘۧۤۤۨۗۢۥۡۘۘ";
                                                                                break;
                                                                            case 113996029:
                                                                                str17 = contains(new StringBuilder().append(str).append(Deobfuscator$$app.getString(-3440722821342125897L)).toString()) ? "ۙۚۡۘۖۗۘۘۚۖۜۘۥ۫ۢۘۚ۟ۛۧۧۜ۫۠۠۟ۘۘۥۘ۟ۗۥۙۚۥ۬۫ۤ۠ۧۜۨ۬ۛۛۙۤ۫ۡ۟ۡۘۡ۫ۖۖۡ۫ۙ۟ۘۤۙۨۛ۬ۢ۟ۖۖۘۢۤ۬ۢۡۥۡۚۦۚۖۡۘ۠ۜۧۘۗۢۖۧۛۧ۫ۤ۟۫ۗۗۤۖۘ۟ۛۚۤۥۥۨۨ۬" : "ۘ۟ۘۤۙۧۘۗۖۛۘۨۘۗۡۘۘ۟ۦۙ۠ۧۡۗۧۥۘ۠۟ۥۘۦۛۖۘۧۢۨۘۙ۫ۡۘۥۦ۟ۡۜۖۤۖ۟ۢۤۘۡۙۥۛ۟۬ۙۥۜۤ۬ۘ۫ۧۢۗۨۘۘۡۗۡۢۗۦۘۨ۫ۡۘۜۘۥۘۨۦۗۢۢ۠ۥ۟ۥۦۚۘۜۜ۫۠ۛۛۧۧۨۘۧۦۖۘۡۡۧۘۡۦۧۘۖۥۛ۠ۤۧۚ۬۟ۦ۟ۖۘ۫ۧ۠ۜۖۗۜۙۦۚ۬ۖۚۘۘ";
                                                                            case 691032998:
                                                                                str17 = "ۡۤۧۥ۠ۜۧۥۦۢۥۜۘۨۚۥۦۘۜۘۗۜۨۗ۟ۨۥۢۦۗۚۧۨۙۗۛۛ۫۫ۛۦۘۘ۠ۤۥۖۗۡۡۢۖ۬ۚۗۡ۬ۤۡ۟ۜۨ۫ۘۛۡۘۗۥۧۘۡ۟ۢۨۦۨۗ۬ۗۘۤۢۨۙۘۨۤۘۢ۫ۦۖۙۖۜۧۚۖۢۖۘ۟ۗۜۘۙ۫ۧ۫ۡۜۘ";
                                                                        }
                                                                    }
                                                                    break;
                                                                case 1875742799:
                                                                    str16 = "ۦۖۘۘۡ۬ۢۛۦۜۘۢۘۖ۠۫ۜ۬ۛۤۢۡۚۢ۫ۢۡۙ۫ۤ۟ۦۘۛۛ۫ۛۧۨۢۥۖۘۜ۬۬۬ۛۨۛۘۘۦۢۥۛۘۗۤ۠۬۠ۚۨۘۧ۬ۙۖۤۢۨۛۚۡ۟ۜۘۘۧ۟ۢ۬ۜۘۢۚۘۘۨۚۧ۫ۙۗ۫ۦ۟ۥۙۗۜۡۘۖۦۜۘۖۢۖۘۜۤۤ";
                                                            }
                                                        }
                                                        break;
                                                    case -685138807:
                                                        str15 = "ۤۤ۠۫ۢۘۤۤۚۙۦۙۚۖۖۤۚۙۙ۟ۢۙ۫۟۠ۥۡۘ۫ۤۖ۫ۗۖۘۙۦ۬۫ۗۚۧۨۡۘۥۨۧۘۤۛۡۗۖۦۙۘۡۖۨۥ۟۟ۘۗ۟ۙۤ۠۬۟ۖۘۘ۟ۚۖۙۨۙۗۤ۫ۙۗۤۧ۠ۨۙ۬ۦۥ۟ۛ۫ۦۘۨ۠ۦۘ۠ۧۜ۫ۛۖۘۧۚۜۘۨۤۖۨۤۖۡۘۡ۟ۖۜۖۜۘ";
                                                    case 1418621543:
                                                        str14 = "۫ۦۧۛۤۦۧۡۛۗۛۡۢۡۛۜ۬۟ۖۧۜۙ۬ۥۜۧۙۙۤۜۘۖ۫ۢۢ۬ۙۨۙۚۡۘۨۦۖۖۖۢۙۖۡۢۜۘۡۥۥۘۘ۬ۘۢۦۤۦۤۚۖۧۦۘۨۢۘۘۤ۠ۥۘۤۖۧۘۢ۬ۙ۟۫ۨۘۙۡۥۥۘ۠";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -491271341:
                                            str13 = "ۨۤۡ۠ۗۖۨۜۨۘ۠ۛ۬ۥۢۖۘۛۜۦۛۤ۫ۙ۬ۡ۟ۢۥۘۜۧ۬۫۟ۖۘۙ۠ۚ۠ۜۨ۫ۦ۟ۖۧۨ۬۠ۙ۠ۙۥۦۘ۫ۚۗۢۖۘ۠۬ۜۘۜۛۥۢۧۨۘۤ۫۬ۜۘۜۨ۬ۚ۬ۥۘۢۖۙۤۡۛۛۗۘۤۨۥۤۤۜ۟۟ۘۘۧۛۡۘۦۛۨۘ";
                                            break;
                                        case 1808820493:
                                            str13 = "۠ۘۜۘۤۙۙۦۦۘ۠۟ۨۡۙ۬ۗ۫ۖۘۤۧ۬ۚۨۨۘۗۘۦۘۚ۬ۜۘۤۜۢ۫۫ۦۘۧۘۖۧۥۖ۬ۘۢۙۛۘ۫۬ۙۥ۫ۢۧۚۗۧۛۙۢ۟ۚۨۨۡۘۧۘۨ۬۟ۦۘۢۥۘۧۖۖۚۢۦۦۘۧۘۜۨ۠ۨۛۛۤۡۘ۟۫ۨۦۥۦ۬ۦۜۖۦ۟ۢ۬ۥۘ۬ۨۥۢۚۙ۟ۘۡۚۨۜ";
                                            break;
                                    }
                                }
                                break;
                            case -1542651146:
                                str2 = "ۙ۠۟ۡۜۚ۠ۜۘ۠۬۠ۙۖ۠ۗۡۥۜ۠ۧۦۛۨۘۥۘۦۘۥۡۗۗۥۘۥۢ۫ۤۚۖۗۦۘۙۧۨۡۧۘ۟ۛۨۘۢۦۙ۠۬ۘۘ۬ۖۥۘۛۘۡۡۥ۬ۙۦۗۛۢۡۘ۬ۤۦۘۚۥۙۘۗۨ۫ۛۗۘۢۥۖ۠ۥۜۘۘۘۤۛ۠ۖۤۘۘۦ۠ۥۡۡۜۘ۫۠ۗۥۚۙۘ۫ۨ۟ۤۖۘۗۘۜ۠ۘۖۘ۟ۗۨۘ۠ۨۘۘۦۛۖۘ۫۠۬";
                                continue;
                            case -722763302:
                                break;
                            case -582651512:
                                str13 = "ۚ۫ۡۜۜۡۘ۠۬ۗ۠ۦۘۘۥۘۘۘۖۛۙۨۧۨۙۜۛۢۥۚۘۦۜۙۤۥۨۚۢۥۛ۬۬ۚ۫ۤۛۙۖۘۘۛۜۛۛۖۜۘۧۧۡۙۘ۬۟ۢۤ۫ۜۘۘ۬ۤ۬ۧ۬ۚ۫ۨۘۚۥۗۖ۫۠ۗۧۡۘۨۚۥۘۛۙۖۘۚۘ۠ۙۛۜۥۘۗۧۚۚۘ۠ۧۚۗۖۡ۬ۧۡ۟ۡۤۦۘ۠ۢۜۘ";
                        }
                    }
                    break;
                case 839033565:
                    str2 = "ۗۨ۬۟ۥۖۘۡ۟ۦۧ۫ۖۨۛۨۦ۟۬ۧۖۘۜۢ۟ۛ۠ۡ۟ۚۙۧۧ۟ۙ۠ۦۘۙۡۥۤۘ۠ۨۘۚۥۡۘ۫ۖۖ۬۫ۥ۟ۧۥۘۡۛۚۦ۫ۧۘۚۜۥۦۨۘۧۧۗۦ۠ۛ";
                    continue;
                case 1144579644:
                    str2 = "ۨۨۨ۠ۛۥۘۢۛۤ۬ۜۦۘ۬ۧۜۘۢۜۧ۫ۤۨ۠ۦ۫۬ۤۚ۠۬ۗۘۜۙۤۡۨۘۜۖۜۨۤۜۘۗۗۨۘۙۤ۟ۖۙ۬ۗۨ۬ۙۖ۠۬۬ۢ۬ۚۘۡ۫ۦۘۙۙۥ۠ۚۦۜۖۢ۫۬ۘۘۖۛۖۘۖ۫ۢ۠ۘۦۘۛۙۜۧ۬ۗ۬ۙۨۘۤۧۘۘۤ۠ۘۚۧۛۤ۬ۤۨۘۢۖۥۨۜ۠ۥۘۡ۫۟";
                    i2 = 0;
                    continue;
                case 1256384565:
                    this.sharedPreferences.edit().remove(str + Deobfuscator$$app.getString(-3440722477744742217L)).apply();
                    str2 = "ۜۦۖ۟ۧۘۗۗۧۦ۟ۘۨۗۨۘۡۚۚۚۥۘۦ۫ۗۧۜۨۤۘۦۙۜۤۘۚۥۙ۟ۦ۫ۘۨۘۥۘۨۘۜۚ۫ۨۨۘۚۛۡۡۚۢۚۧۡۘۦۥۘ۬۟ۘۘۗ۫ۨۘ۠۫ۡۥ۫ۨۘ۬ۚۤۗ۫۠۟ۤۡۘۘۜ۫ۢۦۘۘۤۤۗ۟۬ۜۜ۠۬ۘۥۚۡۙۦ۟ۖۥۘۖ۬ۢۖۥۚۖۗۜۦ۠ۡۘ۫ۨۖۘۢۖۘۦۙۤۡۥۚ۫ۨ۫";
                    continue;
                case 1747835213:
                    str2 = "ۗ۠ۥۖۚۡۙۤۨۘۛۨ۫ۥۜۧۘ۬ۧۨۘۗ۟ۖۚۚۡۛ۬ۢۡۗۘۘ۟ۛۚۛۖۜۘۧ۟ۨۘ۟ۛۨۘۛۧۦۘۜۤۡۘۜۡۘ۠ۛۦۘ۠ۜۜۘۜۗۦۤۤۡۘۚ۫ۜۡۡۧۗ۫ۘۘۡۨ۟ۧۧ۬ۙۡۡ۫۬ۜۘ۟۬ۖۘۜۙۨۘۨۡۛۖۥۘۙۖۡۘۨۗۦۘ۟۬ۨۦۗۢ۟ۜۘۦۛۥۘۙۡۜۗۢۡ";
                    continue;
                case 1868285035:
                    str2 = "۠ۜۤۦۨۦۘۛۢۡۘۚ۫ۜۘۛ۟ۚۘۘ۟۬ۡۡۢۦۦ۬ۛۧۛۙۜ۟ۥۖۘۚۘ۫ۗۚۙۧ۟ۛ۫ۙۙ۟ۗۘۨۘۥۘ۟ۦ۠۬۬۬ۥ۬ۥ۫ۛۙۗۗۖۘ۠۟ۛۥۗۘۚ۫ۨ";
                    continue;
            }
            str2 = "۠۬ۨۥ۠۟۬ۙ۟ۛۜۦۙۖۢۢۥۜۡۨ۟ۖۘۢۡۨۤۛ۠ۥۡۚۚۛۘۘۤۧۨۘۢۦۚۤۖۦۘۧ۠ۧۡ۠ۖۜۧۖۖۡۘۡ۬ۗۨۥۛۘۥ۫۠ۥۢۤۦۘۘۜۨۛۦۢۡۘۦۜۖۘۥۖۨۘ۠ۨۜۘ۟ۡۜۘۚۢۢۚ۟ۛۛۡۛۜۥۥۧۦۘۗۦۜۙۤۜۘۨۧۚۤۤۡۖۜۖۜۧۧ۫۟۠ۘۛ۬ۛۤۡۘۘۨۜۘ";
        }
    }

    public void write(String str, String str2) {
        String str3 = "۟ۛۗۛۙۦۘ۠ۧۦۦۛۨۘۘۛۚۨۖۜۗۜۢۦۘۜۘ۫۟ۜۘۨۤۗ۬ۦۧۖۡۢۖۙۦۦۥۦۦۨۨۦۘۙۖۥۡۜۜۘ۟ۦۦۛۤۚ۠ۧۘۚۦۧ۬ۙ۫۠۠ۢۚۢۗ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str3.hashCode() ^ 206) ^ 60) ^ 801) ^ 915) ^ 111) ^ 601) ^ 811) ^ 191) ^ 241) ^ PointerIconCompat.TYPE_TEXT) ^ 843) ^ 824) ^ 672) ^ 492) ^ 81) ^ 439) ^ 636) ^ 24) ^ 557) ^ 415) ^ 173) ^ 549) ^ 756) ^ 211) ^ 106) ^ 81) ^ 458) ^ 693) ^ 694) ^ 942) ^ 787) ^ (-1007495593)) {
                case -1204639225:
                    str3 = "ۛۦۖۚۙۨۘۗۢۧۤۘۦۥۛۙۥۥۡۡۗۡۘ۬ۜ۟ۨۘۜۗ۟ۥۡۖ۠ۢ۬ۢۚۜ۬ۖ۫ۢ۟ۘۧۢۥۧۖۖۡۥۥۘۨۧۦۛۡۦۦۥۧ۬ۥۥۘۗۦۜۘۢۙۚۤ۠ۨۘۢۛۚۛ۟۠ۚ۬ۦۨ۠ۖۘ۟ۚ۬";
                    break;
                case -1195280779:
                    this.sharedPreferences.edit().putString(str, str2).apply();
                    str3 = "ۚۢ۠ۧۗ۫۟ۨۦۙۘۥ۬ۥۜۨۛۧۡۦۙ۟ۥۛۦ۫۟۬ۦۨ۬ۤۤ۫ۥ۠۠ۚۥۖ۫ۤ۫ۗۧۙۨۧۘۗۧ۟ۚۥۨۘۨۤۘۘۦۛۥۡ۟۟ۥۖۥۘۦۢۡۧۙ۬ۡ۟۬ۗۖ۟۟ۙ۫ۛۤۖ۟ۨۦ۠ۢۡۦۤۖ۠ۦۘۦۦۚۥۜۨۘۡۘۡۘۦۛۙ۟ۤۙۜۘۦۛۘۥۛۗ۬ۦۚۛۙ۬۠ۛۨۡۜۘۥ";
                    break;
                case -331081114:
                    return;
                case 38170225:
                    str3 = "ۜۦۖۘۢۖۚ۟۠ۘۥۨۢۤۖۦ۫ۗۥ۠ۗۜۘۛ۠ۚۦۙۨۘۜۦۘۘۖ۟ۡۘۨ۫ۚ۬ۗۥۦۘۨۘۛۖۤۢۘۚۡۦۤۜۦۦ۟ۜۥۘۙۙۢ۫ۧ۟ۘۧۛۨۤۛۙۙ۠ۚ۟";
                    break;
                case 1744021842:
                    str3 = "۠ۦۖۚۦۗ۟ۘۦۘۡۙۦۘۥۙۨۘۚۚۤۘۚ۬ۗ۟ۜۚۖۦۨۙۨۘۨۢۖۘۙۛۙۙ۫ۘ۬ۖۨۘۢۙۗۜۗۖۖۚۦۘۙۙۨۢۢۦۘۤ۠۟ۛۧۢۗ۟۟۬۬ۘۘ۬ۡۧۘ۬ۚۦۘ۠ۢۜۘ۫۬ۖۘۗۛ۟۟ۡۘۘۡۘۧۢۚۜۘۡ۟۟ۢۙ۠ۧ۠ۡۘۘ۟۬";
                    break;
            }
        }
    }

    public void writeBoolean(String str, boolean z) {
        String str2 = "۫۫ۡۘۛۦۧۢۡۘۦۦۧۘ۟ۧۖۘۗۨۡۘۗۢۚۡۤۧۜۧ۫ۦۜۘۖۢۡۧ۠ۡۘ۠ۛۦۤۧۨۡۘ۬ۜ۟ۜۥۥۘۦۥۨۘۢ۬ۧۛۨۨۘۙۖۘۛۥۨۚۦۜۘۛۚۨۘۢۥۡۘۜۚۤۙۛۖۘۧۧۡۘ۟ۡ۟ۢۥۦۘۥ۟ۡۘ۠ۛۙۧۡۘۥۡۥۘۨ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 958) ^ StatusLine.HTTP_TEMP_REDIRECT) ^ 945) ^ 693) ^ 447) ^ 683) ^ 645) ^ 1023) ^ 268) ^ 35) ^ 44) ^ 980) ^ 568) ^ 401) ^ 242) ^ 988) ^ 880) ^ PointerIconCompat.TYPE_GRAB) ^ 690) ^ 525) ^ 545) ^ 323) ^ 297) ^ 157) ^ 526) ^ 922) ^ 141) ^ 191) ^ 900) ^ 587) ^ 489) ^ 116405490) {
                case -2104515189:
                    str2 = "ۙ۬۬ۥۧۖۜۗ۠ۤۨۘ۠ۛۛۢۢۘ۫ۚۡۘۜۢۖ۬ۦ۠ۦۘۖ۠ۡ۠ۡ۟۠ۙۛۖۨۗۛۢ۟ۡۧ۟ۨۘۘۥۛۖۡۚ۠ۥۧۘ۫۠ۙۛۗۗۘۢۥۥۤ۫۟ۥۧۡۖۦۦ۫ۨۧ۠ۦ۟۬ۧۘۜۥۘۨ۟ۙۙۖۛۗۦۢۚۜۜۧۛۗۢۙۚ۬ۗۦ۫ۦۢ۬ۜ۫ۚۛۜۘ۬ۦۙ";
                    break;
                case -1342273605:
                    str2 = "۫ۗۗۤۙۤۘۙۜۘۗۗ۬ۤۜۜۥۦۗۘۚۨۨۨۥۘۜۙۖۘ۬ۢۚۚۖۜۦ۬ۦۢۢۖۘ۬ۖۨۡۨۤۢۘ۠۬ۥۘۘۨۨۘۚۦۥۘۛ۟ۛۥۡۘۥۛۦۘۢۥۥۙۡۦ۬ۡۦۙ۫ۖۘۘۖۡۘۘ۟ۙۖۡۚۛۚۜۘ";
                    break;
                case -1340360189:
                    str2 = "ۘۜۦۘۧ۠۟ۜۙۥۘ۟۬ۗۤۚۜۖۘۨ۟ۚۗۡۧۘۢۨۤۤۥ۬۠ۧۛ۟ۛۨۘ۬ۛۢۨۜۚۨ۠ۥۘۜ۫۫ۨۨۚۚۚۘۘۚ۟ۦۘۜۙۥ۬ۚۚۥۘۘۨ۠ۨۗۤۖۘۥۨۛۡۥۖۘۤۘۜۘۖۦۡ۠ۚ۠ۛۖۤۙ۫ۦۘۚۨۢۨۚۖۨۜۘۦۦۗ";
                    break;
                case -1219752495:
                    this.sharedPreferences.edit().putBoolean(str, z).apply();
                    str2 = "۠۫ۛۦۤۗۤۜۤۖ۟ۛۜۧۡۙۡۨ۬ۥۖۦۨۨۨۦۥۘۨۖۦۘۥۘۜۘ۫ۦۦۘۢۦۖۘۚۖۧۘۢۤۚ۠ۧ۟۬ۜۡۘۥۛۘۘۘۥۘۘۙۧۛ۟ۧۘۦ۠ۖۡۛ۬ۡۘۖ۟ۜۗۥۘۘۥۜۨ۬ۥۡۘۙۛۤۖۙۤۖۢۚۛ۬ۖۤۦۚۧۨۨۘۥۨ۟";
                    break;
                case -860079035:
                    return;
            }
        }
    }

    public void writeDouble(String str, double d) {
        String str2 = "ۨۙۖۥ۬ۧ۬۫ۢۢۦۚۤۗۢ۟۟ۤۥۗۥۘۥۘۥۛۧۡۘۘۛۘۘ۠ۖۛۦۤ۟ۗۗۡۘۜۨۡۘۘۥۨۘۖۨۧۘۛۦ۫۫۟ۨۦۨۛۚۚۤۦۛ۬۫ۛۜ۟ۨۧۨۘۨۧۦۦۛۦ۬۟ۨۘۥ۟ۦۢۘ۟ۖۙۨۛۙۛۧۧۦۘ۫ۢۨۙۛۚ۬ۗۖۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 974) ^ 113) ^ 968) ^ PointerIconCompat.TYPE_ZOOM_IN) ^ 672) ^ 735) ^ 707) ^ 660) ^ 237) ^ 383) ^ 640) ^ 500) ^ 780) ^ 778) ^ 616) ^ 893) ^ 737) ^ 862) ^ 102) ^ 886) ^ 912) ^ 878) ^ 738) ^ 929) ^ 113) ^ 32) ^ 659) ^ 177) ^ 435) ^ 33) ^ 463) ^ 582443711) {
                case -1887572373:
                    str2 = "۟ۜۥۘ۟۟ۚ۫ۨۘۖۚ۫ۘ۟ۥ۫۬ۘ۫۬۟ۦۜۙۛۦۡۖۜ۟ۦۧۚ۟ۡ۟ۧۗۢ۟ۦۗۤۚۧۡۢۨۥ۟۟ۗۛۛ۟۠۟ۗۖ۬ۧۦۥۘۖۚۡۘۖۘۧ۠ۥۧ";
                    break;
                case -592778353:
                    str2 = "ۡ۫۠ۡۚ۠ۨ۟ۜۘ۟ۘ۫ۧ۫ۧۤۙۡ۟ۖۘۧۢ۬۫ۦۖ۬۬ۜۘۗۚۢ۟ۡۨۘۛۧۨۤۦ۬۬ۢۢۗ۟ۦ۬ۨۛ۬ۙ۠ۗۡۙۦۛ۠ۢۛۖۘ۟ۖۢۙۚۚۚۖۘۚۤۦۚۦۜۘۖ۫۟ۧۦۜۚۤۨۧ۬ۜۖۨۘۚۧۛۤۛۢۘۘۨۢۜۤ۟ۖۦۧۤۤۖ۫ۖۧۢۥۘ۟ۡۙ";
                    break;
                case -367349079:
                    writeLong(str, Double.doubleToRawLongBits(d));
                    str2 = "ۚۘ۠ۘۤۛ۠ۧۛۡۡۨۘ۬ۤۖۖ۟ۤ۠ۗۦۘۚۘۨۘۤۘۥۢۗ۬ۨۘۤۜۨۙۜ۬ۖۛۦۨۨۘۘ۠ۥۘ۟ۡۦۙۛۡۦۡۜۤ۬ۖۘۗۢۡۨۘ۫۫ۡۚۤ۟ۜۘۡۛۘۘ";
                    break;
                case -55712673:
                    return;
                case 84528580:
                    str2 = "ۥۜ۠ۖۧۤ۠ۨۘۨ۬ۖ۟۠ۘۘۗۥۘۜۗ۠ۜ۬ۡۢۢۙۡۨۨۘۜۨۙۦ۫ۢۦۚۘ۟ۗ۠ۛۚ۟ۘ۬ۗۙۖۧۘ۟ۡۜۘۦۘۚۦۚۦۘۙۘۜۥۥۘۖۙۜۥۗ۠ۙۘۖ۠ۡۖۘ۟ۡۧۘ۠۠ۚۥۘ۟۬ۡۘ";
                    break;
            }
        }
    }

    public void writeFloat(String str, float f) {
        String str2 = "۬ۨۜۘ۬ۘۡ۟ۧۥۘۨۧۖ۠۟ۘۘ۠ۘ۬ۚ۟ۢ۬ۜ۫ۗ۬ۙۜۨۘۢۙۜۤ۟ۧ۠ۤۘۚۘۘۢۗۢۘۗ۟۟۟ۘ۫ۛۦۘۧ۠ۘۙۙۢ۫ۗۦ۟۬ۘۘ۬۫ۨ۬ۤۥۢۘ۟";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 829) ^ 220) ^ 428) ^ 713) ^ 158) ^ 954) ^ 998) ^ 999) ^ 996) ^ 796) ^ 477) ^ 969) ^ 190) ^ 874) ^ 626) ^ 831) ^ 423) ^ 824) ^ 769) ^ 116) ^ 862) ^ 852) ^ FrameMetricsAggregator.EVERY_DURATION) ^ 106) ^ 533) ^ 347) ^ 967) ^ 166) ^ 813) ^ 177) ^ 982) ^ 596068272) {
                case -1375851859:
                    return;
                case -956610339:
                    str2 = "ۥ۬ۡۘۖ۫ۧۧۗۦۘ۫ۥ۬۫ۨ۫ۖ۟ۧۦۨۙۥۦۘۥۢۖۙ۬ۖۤۢۢۘۥۛ۟ۡۛۥۡۧۘۢۥۜۘۡۧۨۜۗۡۨۚۢۖۤۙۢۥۚۤۚۡۥۘۥۡۢۙۚۧۚۙۥ۠ۖۘۙۜۤۡۗ۟ۢۡۨۘۗۗ۠ۥۢ۬ۢۘۙ۠ۘۖۘۨۢۤۚ۬";
                    break;
                case 57638189:
                    this.sharedPreferences.edit().putFloat(str, f).apply();
                    str2 = "ۦۨۖۘۤ۠ۘۘۥۧۨ۫ۛۘۛۚ۟۠۠۫ۛۨۥۗۙۘۡۜۘۦۦۡۘۦۦۡ۟ۢۚۥۨۦۘۚۖۡۙۙۖۢۜۧ۠ۘۥۘ۬۟ۜۘ۟ۦۨۜۖۨۘ۠ۗۡۘۥۧۤۛۗۙ۟ۖۘۛۤۡۘۙۛۤۘۨۙۤۖۙ۠ۢۜۘۧۢۛۘ۬ۜۘۢۦۘ۬ۢ۫ۡۜۘۙۧۢ";
                    break;
                case 177780715:
                    str2 = "ۤۘ۬ۗۥ۫۬ۢۗ۫ۙۧۢۧۡۘۦ۠۠۬ۨۜ۟ۨۦ۫ۨۥۘ۫ۧۖۜ۫ۜۤۦۖۘ۟ۧۘۘۗۥۤۥۥۙۙ۠ۘۘۡ۫ۘ۟ۦۨۘ۟۫ۡۚۤۡۘۜۧۢۥۦۦۥۧۥۤۤۤۤ۫ۜۗ۫ۜ۠ۖۖۛۜۤۦۜ۟ۛۡۦۦۥۜۤۖۡۘۛ۟ۘۘۤۜۥۘۗ۫ۢ";
                    break;
                case 458495768:
                    str2 = "ۘۚۢۢۘۜۘۖۗۡ۬ۗ۠ۢۘۧۘۧ۟ۤۚۦۥۘۦۧۜۚۦۜۘۙۗۦۘۛۦۗۨۧۘۦۤۙۙ۟ۦۤۦۧۘ۫۟ۘۙۥۨۘۨۜۤۤۤۡۘۨۡۘ۟۬۟۫ۜۧۘۚۙۜۙۦۖۚ۫ۤۖۥۙۘۡ۫ۖۧۜۛۥۛۧۛۛ";
                    break;
            }
        }
    }

    public void writeInt(String str, int i) {
        String str2 = "۫۟ۜۡ۠ۢۖ۫ۚ۟ۖۛۡۤۥۢۜۤ۠۠ۦۡۘۜۘۤۦۜۨۜۘۢۛۖۘۗۙۧۛ۠۟ۥ۫ۧۗۘۚۤۡۖۨۡۙ۟ۥۜۢۤۛۗۨۢۨۢۖۘ۬ۖۘۨۘۙۤۖ۬ۢ۠ۢ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 236) ^ 276) ^ 23) ^ 189) ^ 457) ^ 964) ^ 855) ^ 235) ^ 200) ^ 715) ^ 482) ^ StatusLine.HTTP_PERM_REDIRECT) ^ 874) ^ 841) ^ 813) ^ 765) ^ 578) ^ 423) ^ 546) ^ 6) ^ 703) ^ 470) ^ 488) ^ 217) ^ 341) ^ 423) ^ 740) ^ 113) ^ 402) ^ 529) ^ 927) ^ (-1713598091)) {
                case -2076747179:
                    return;
                case -1082261683:
                    str2 = "ۗۧۙۘۜۘ۫ۧۘۘۨ۠ۛ۫ۡ۠ۗۢۗ۫ۨۢۡۚۡۧۜۖۧ۬ۖۘ۠۫ۖۜۜۢ۠ۚۥۥۙۡۛۢۗۜۖۡۢۙۢۛۢۖۙۧۥۘۗۧۨۥ۫ۗۗۜۨۘۥ۬ۙۗۧۜۘۤ۬ۖۤۙۥۖۚۨۘۥۛۚ۫ۗۨۡ۟ۤۙ۟ۤ۬ۜۥۘۨ۬ۤۧۚۖۜ۟ۡ";
                    break;
                case 101161211:
                    this.sharedPreferences.edit().putInt(str, i).apply();
                    str2 = "ۦۤۤۧ۠۠ۘۖۥۗۦۨۡۦۖۘۢۙۨ۠ۖۨۘۢ۟ۛۚۢ۠۫ۛۨۙ۬ۖۜ۠ۡۘۢ۬ۛ۠۟۟ۙۤۤۛۡۦۖۘ۫ۜۡۘ۠ۢۤۗۗۥۖۦۜۦۦۖۢۧۜۘۥۥ۟ۛ۬ۛۙۙۨ۬ۡ۟۫ۧۚۙ۬ۘۘۛۘۢ۟ۘۘۧ۠ۤۡۢۤۧۚۧۡۙ۠۬ۥۢۦۚۜۤ۫ۜۜۘۘ۠۠۬";
                    break;
                case 1551334221:
                    str2 = "۠ۛۦۘۛ۬ۘۘ۠۫ۨۘۜ۬ۛۢۢۛۗ۫ۤۥۘۘۥۘۡۙۜۘ۫۠ۦۤۦۛۢۙۧۤۚ۬ۗۦۜۨ۫ۧ۠ۨۘۦۙۢ۫ۗ۟ۚۛ۬ۛۖۜۚۙۦۘ۟ۜۙۥۜۜۧۢۥۘۚۧۖۘۖۨۦۡۨۡۖ۟۬۠۬ۜۘۨۢۚۥۨۘۥۥ۟ۘۙۤ۠۟۫ۨۖۜ";
                    break;
                case 1933696812:
                    str2 = "ۘ۬ۥۜۙ۫ۜ۫ۢۥۢۡۥ۬ۛۙۢۧۘۘ۠ۛۦۘۗۨۨۘۛۨۨۘۖۢۜۜۦۨۘۧۨۜۘ۫۠ۖۜۧۖۘۧۥۨۘۗۜ۠ۖۘۢۖۛۘۘۢۜۚ۠ۤۜۦۦۛۧۘ۠ۨۖ۟ۚۗۡۘۙۢ۟ۜۗ۠ۛ۟۟ۗۧۥۘۦۨۦۘۘۘۧۘۢ۫ۢۗۖۘۘ۫۫ۡۘۛۤۚ";
                    break;
            }
        }
    }

    public void writeLong(String str, long j) {
        String str2 = "ۤۥۜۘۚۚۥۡ۠ۧۛۜ۟۬ۛۖۘۤۥۡۘۛۘ۠ۚۛۚۗۡۨۦ۬ۘۘۗ۠ۙ۟ۖۥۘۦۙ۫ۦۗۢۗ۟ۙۤۘۦ۫ۜۖ۫ۚۜۜ۫ۘۘۚۜۡ۫ۘۡۘۛ۠ۜۥۛۨۘ۟ۨۧۨ۫ۦ۠۫ۖۙ۬ۜۘۢۦۡۢۖۜۘۧۙۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 97) ^ 803) ^ 908) ^ 132) ^ InputDeviceCompat.SOURCE_KEYBOARD) ^ 506) ^ 715) ^ 111) ^ 18) ^ 198) ^ 546) ^ 339) ^ 936) ^ 778) ^ 711) ^ 831) ^ 346) ^ 25) ^ 691) ^ 130) ^ 354) ^ 425) ^ 344) ^ 977) ^ 570) ^ 968) ^ 551) ^ 650) ^ 779) ^ PointerIconCompat.TYPE_WAIT) ^ 698) ^ 1058719845) {
                case -1395442649:
                    str2 = "ۚۧۥۘ۟ۡۧۧۗۥۘ۬۠۟ۘۡۖۘۥۚ۬ۨۦۦۘۛۘۨۥۥۦۜۤۨۘۡ۟ۢۢ۠ۚ۫ۨۛۜۜۡۛۧۡۘۚ۬ۨۘ۬ۤۤۘۜ۟ۖۡۖ۫ۖۘ۬ۡۘۚۗۤ۬ۖۖۜۢۥۘۙۥۡۘۡۙۖۦۗۚۘۘۜۘۡۡۗ۬ۡۖۡ۬ۚۖ۫ۜۘۙۗۦۤۤ۬ۡۧۦۘ";
                    break;
                case -935429646:
                    return;
                case 139527481:
                    this.sharedPreferences.edit().putLong(str, j).apply();
                    str2 = "۟ۢۦ۟ۗۦۢۛۨۘۛۨۖۨۖۥۘۙۡۥۚۙ۬ۜ۬ۡۢ۟ۖۘۤۨۖۘ۠ۦۦۚۛۖۘۜۦۤ۠ۗۦۘ۠ۘۦۘ۟۫۫ۛۨۥۤۘ۫۫ۤۘۘ۠ۜۤۜۥۡۘۨۗۥۘ۟ۡۖۜۦۡۖۦۡۨۧۚۧۜۘۙۜ۬۫ۦۖۘۡۖۦۨۦۧۧۨۢ۫۫ۘۗۥ۬ۧۢۥ۫ۤۥۘۥۗۖۗۛۢۖۨ۟۟ۡ۠";
                    break;
                case 348423821:
                    str2 = "ۢ۫۫ۢۗۥۘ۫ۘۨۘ۟ۦۜۘۦ۟۟ۗۤۢۨۗۖۤۥۦ۫ۢۖۜۥۡۘ۬۬ۛۙۧۚۢۘ۫ۡۦۘۜۙۤۖۛۧ۠ۢۖۘۗ۟ۖۘۥ۬ۗۙۨۖۦۨ۬ۛۚۙ۠۬ۨۥۚۚۥۛۛۢۜۧۘۘ۫ۥۢۥۨۘۜ۟ۜ۬ۙۦ";
                    break;
                case 616760696:
                    str2 = "ۜۨۧۤۗ۟ۙ۫ۡۨۗۜۘۤۜۖۘۥۨۥۘ۬۫ۙۖۦۨۗۨۛۨۡۘۘۙۡۢۥۘۧ۟ۙ۟ۜۘۧۥۡۘۜۤۦۙۛۜۘۦۥۖۘۢۗۛ۟ۦۘۧۧ۬۠ۨۡۙۙ۬ۦۜۨۚۤۗۧۤۨۜۨ۬ۘۦۦۙۛۡۙۚۙ";
                    break;
            }
        }
    }
}
