package kentos.loader.floating;

import android.app.Service;
import android.content.Context;
import android.content.Intent;
import android.content.SharedPreferences;
import android.os.IBinder;
import androidx.core.app.FrameMetricsAggregator;
import androidx.core.view.InputDeviceCompat;
import androidx.core.view.PointerIconCompat;
import org.lsposed.lsparanoid.Deobfuscator$$app;
/* loaded from: classes2.dex */
public class FloatService extends Service {
    Context ctx;

    static {
        String str = "۠ۧۛۜۜ۠ۥۦ۫ۨ۫ۡۨۢۨۢۥۙۙ۫ۢۗۛۥۘۢۘۘۢۧۨۡۦۗۧۘۦۘۗۤۙۙۨۡۘۨۡۜۡ۫۫ۛۚۜ۟۟۬۬ۥۡۙۙۡ۫۫ۙۘ۠ۥۘ۬ۡۨۘ۟ۖۦۧ۬ۦۘۚۢ۠ۥۙۡۘۦۢۡۘۡ۬ۡۘ۠ۨۡۘ۫ۜۜۗۦۨۘۚۦ۠ۙ۟ۙۖۖۥۘۙۛ۫ۤۖ۬ۗ۫ۤ۫۠ۜۡۗۦۘ۠۠ۢۗۡۜ۟۟۟ۢ۫ۜۘۢۧۧ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 72) ^ 672) ^ 577) ^ 609) ^ 709) ^ 339) ^ 407) ^ 162) ^ 692) ^ 823) ^ 195) ^ 638) ^ 231) ^ PointerIconCompat.TYPE_HAND) ^ 555) ^ 615) ^ 851) ^ 817) ^ 752) ^ 754) ^ 154) ^ 662) ^ 10) ^ 992) ^ 272) ^ 360) ^ 336) ^ 295) ^ 901) ^ 371) ^ 79) ^ (-907214717)) {
                case -1066035291:
                    return;
                case 1788288788:
                    System.loadLibrary(Deobfuscator$$app.getString(-3440747706382638921L));
                    str = "۬ۚۢۖۥۘۖۦۘۥ۟ۥۙ۟ۦۛۘ۠۟ۘۥۛۦۗۡۖ۟۟ۘۜ۬ۘ۠ۤۗ۠ۥ۬ۛۥۗۥ۠۫۬ۘۢۥۜۦۥۨۡۖۚۦۙۖۘۘ۫ۥۛۚۦۖۡۗۡۘ۟۫ۥۨۖۘ۬۟ۥۗ۬ۜۖ۠ۚۗۚۡۘۛۧ۫";
                    break;
            }
        }
    }

    private void StartAimBulletFloat() {
        String str = "ۧۧۗۗۗۖۘۡۖۥۘۥ۠ۥ۫ۘۨۡۤۖۘۙۛۚ۬ۖۜۘۛۨۘۧۥ۬ۖۤ۬۬۟ۨ۬ۡۦۤ۟ۘۘ۠ۥۖۦ۬ۥۘ۟ۜۨۘۢۤۥۘۨۦۘ۟ۦۡۘۛۖۗۜ۬ۚۜۜۡۘ۫ۦۛۡۜ۟ۘۨۖۘۦۡۨۗۡۡۦ۟۟ۘۘۧ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 534) ^ 574) ^ 281) ^ PointerIconCompat.TYPE_TOP_LEFT_DIAGONAL_DOUBLE_ARROW) ^ 32) ^ PointerIconCompat.TYPE_VERTICAL_DOUBLE_ARROW) ^ 179) ^ PointerIconCompat.TYPE_GRABBING) ^ 447) ^ 626) ^ 241) ^ 499) ^ 563) ^ 952) ^ 864) ^ 677) ^ 832) ^ 273) ^ 138) ^ 566) ^ 725) ^ 892) ^ 651) ^ 879) ^ 389) ^ 10) ^ 235) ^ 713) ^ 615) ^ 243) ^ 439) ^ (-952529408)) {
                case -1708459258:
                    return;
                case -1337336765:
                    str = "ۤۗۥۡ۬ۖۛۖۖۛۚۗۦۢۦۘۢۧۜۘۢۜۙ۬ۨ۬ۚۛۥۘ۫۟ۤۚ۬ۤۚ۫۬ۖۢۛۗۤ۬ۛۙۥۢۧۜۘۦ۬ۨۜۢۢۡۧۦۘ۬۬۬ۢۘۙۢ۟ۘۘۘۜۜۛۜۜۥۦۘۗ۫ۧۛۚ۫ۥۖۘۡۘۙۤۗۖۘۡۘۨ۫۬ۜۗۡۗۜۘۖۜ۫";
                    break;
                case 1547593002:
                    startService(new Intent(getApplicationContext(), ToggleBullet.class));
                    str = "ۦۖۦۘۜۘ۠ۖۙۖۙ۬ۢۤ۬۟۬ۜۖۧۥۧۘۛۦۛۘۙۚۖۥ۟ۘ۫ۥۘۗۜ۬ۙۙۦۘۙۖۖۘ۬ۜۨۘۡۖۢ۫۬ۢۛ۠ۦ۬ۚۦۛۨۜ۬ۥۛۤۨۘۘۦۤۡۗۚۧ۟ۜۧۗ۟ۦۤۦۤۚۚۘۜۥۘۜۙۚۛۧ۟ۙ۫ۘۚۥۛۨۢ۬ۥ۠ۦۘۘۘ۫ۡۚۛ۟ۗۦ۫۬ۜۘۘ۠ۘۘ";
                    break;
            }
        }
    }

    private void StartAimFloat() {
        String str = "ۢۧۡۘ۟ۢۨۗ۟ۨ۟ۦۤ۬ۢۘۥ۠ۜ۟ۡۜۙ۠ۥۛۘۡ۫ۖۡۜۢۚۨۦۥۦۡۨۘ۠۟ۤۡۤۢۘۘ۫ۜۚۥ۫ۨ۫ۖ۠ۨۨۖۨۛ۟ۖۚ۟۟ۖۘۘ۠ۡۡۡۦۘۖ۬ۖۘۜۘۛ۟ۜۙۨۜۛۘۘۨۘۖۤۡۘ۬ۧۦۘۤۗۛۛۜۘۘ۠ۛۗۗۥۘۥۘۡۘ۬ۦۚ۠ۗۖۘ۫ۨۘۚۨۡۚۥۦۘۢۚۦ۟۠ۘۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 709) ^ 355) ^ 203) ^ 355) ^ 690) ^ 792) ^ 233) ^ 449) ^ 482) ^ 855) ^ 34) ^ 182) ^ 958) ^ 530) ^ 914) ^ 920) ^ 348) ^ 491) ^ 69) ^ 499) ^ 946) ^ 369) ^ 196) ^ 143) ^ 583) ^ 389) ^ 57) ^ 924) ^ 750) ^ 385) ^ 918) ^ 1587004341) {
                case -542991474:
                    return;
                case -158513244:
                    startService(new Intent(getApplicationContext(), ToggleAim.class));
                    str = "۬ۥۧۛۥۥۢۖۜۘۦۘۨۘۤ۫ۥۜۙۜۢ۫ۗ۠ۡۢۚۦۦۘۘۛۛۦۨۛۛ۫ۘۚ۠ۙۛ۫ۗ۟ۧۦۘۖۘۡۘ۟۟ۢ۫۬ۨۨۧۘۗ۠ۥۘۢۨۥ۬ۗ۫ۥ۟ۜۚۘۧ۠ۦۥۘۗ۫ۥۛۧۘۥۜۜۘۗۚۗۤۥۚ";
                    break;
                case 1928602173:
                    str = "ۡۢۜۨۜ۟ۢۖۤ۟ۤ۫ۡۜۚۛۘۘۥۤۡۘۙ۟ۛۧ۫ۚۧۢۨۥ۫۬ۨ۫ۜ۟۫ۦۜۖۥۜۤۨۤ۠ۢۜۚ۠ۨۢۛۛۡۘۛ۟۫ۘ۬ۡۘۗۨ۟ۗۦۥۧ۬ۜۘ۫ۨ۟ۥۥۜۘۤۢۛ۟ۡۤ۫ۨۡۥۨۛ۟ۖ۬ۙۡ۫۬ۢۙ۟ۢ۟ۢۚۦ۬ۖۘۘۢۨۢۛۨۛۤۚ۬ۨۥۢ۠ۙۘۛۨۖ۫ۧۨۥۡۖۘۛۗۦۘ";
                    break;
            }
        }
    }

    private void StopAimBulletFloat() {
        String str = "ۥۙۦۗ۠ۤۙۤۦۚۖۨۖۥۗۗۡۨۛۖۧ۠ۗۚ۠۬ۤۦۢ۫ۛۧۥ۠۫ۦۘۨۥ۠ۘۡۙۢۗۢ۫ۦۨۘ۫ۨ۫ۛۤ۟ۨۛۜۘ۟۬ۛۡۧۗۘۨۡۤۡۦۦۚۡ۟ۖۗۤۗۦۘۡۛۡۘ۟ۨۨۘۘۦۧۤ۠۠۟۠ۥ۠ۡۛۧۗۛ۬ۘۜۦۤ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 7) ^ 619) ^ 63) ^ 26) ^ 152) ^ 858) ^ 584) ^ 144) ^ 227) ^ 222) ^ 599) ^ 158) ^ 472) ^ 402) ^ 789) ^ PointerIconCompat.TYPE_ALL_SCROLL) ^ 328) ^ 253) ^ 438) ^ 643) ^ 310) ^ 197) ^ 630) ^ 495) ^ 943) ^ 136) ^ FrameMetricsAggregator.EVERY_DURATION) ^ 836) ^ 370) ^ 351) ^ 44) ^ (-72345787)) {
                case -319946663:
                    return;
                case -156332692:
                    stopService(new Intent(getApplicationContext(), ToggleBullet.class));
                    str = "ۘۚ۟۟ۧۦۘۨ۫ۡ۠ۤۥۜ۠ۘۘۘۛۨۤۨۦ۫ۥۥۘ۟ۥۡ۟ۨۜۘۗۜۨۘۢۧ۟ۤۗۨۘۥ۬ۡ۫ۖۜۡۧۨۨۥۨۘۖۡۖ۟ۦۙۥۘۛ۫ۧۦۘ۠۠۟ۡ۫ۛۢۘۜۘۜۛ۟۫۟ۥ۬ۨۘۘ۠ۜۘۤۡۛۥۚۡۘ";
                    break;
                case 26496692:
                    str = "ۗ۟ۨۘۗۨۘۘۡۜۥۘۡۜۥۘ۬ۗ۟۠ۜۦ۠ۧۧ۟ۡ۫ۚۘۘۖۙۘۧ۠ۦۚ۬۫۬۬ۤ۠۬ۘ۫ۚۨۧۦۨۘ۬ۨۢۧۦ۟ۨۡۚۡۘۗۜۗ۫ۡۤ۬ۗۦۢۢ۬۠۫ۦۘ";
                    break;
            }
        }
    }

    private void StopAimFloat() {
        String str = "ۘۥۡۤۡۧۘ۠ۨۛۦۢۨۘ۬ۗۤ۬ۤۨ۟ۧۤ۬۬۬ۙۨۨۘۜۚۦۡۧۦ۫۟ۦۘۗۜۜۘ۬ۜۡۘۨۗۘۙ۠ۨۦۙۢۤۤۚ۠ۖ۟ۢۤۢۗۘۛۚۖۘ۟۟ۥ۬ۦ۠۫ۗۥۘۤ۬ۗۨۨۧۘۘۖۙۦۗۖۤۗۥۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 810) ^ 130) ^ 769) ^ 600) ^ 538) ^ 610) ^ 255) ^ 765) ^ 930) ^ 783) ^ 786) ^ 793) ^ 68) ^ 593) ^ 214) ^ 62) ^ 578) ^ 319) ^ 819) ^ 105) ^ 733) ^ 143) ^ 13) ^ 596) ^ 142) ^ 819) ^ 154) ^ 152) ^ 358) ^ 828) ^ 879) ^ (-1579875287)) {
                case 156070068:
                    str = "ۘ۫ۢۡ۠ۦۤۚۤۜۚ۬ۛۢۘ۫ۥۜۘ۠۬ۘ۫ۡۡۗۦۧۚ۫۟ۗۗۚ۬ۢۚ۠ۙۜۦۤۡۚۖۙۧۖۘۙۖۡۘۧۛۦۙ۬ۙ۟ۜ۬ۦۘۤۗۥۧۛۛۡۡۛۡۛۖۡۘۛ۫ۡۘ۠ۙۥۜۧ۫ۛ۬۬ۢۘ۫ۘۖۚۗ۟ۦۦۧۗۜۖۚ۟ۨۗۛۡۖۦۛۙۚۥۤۜۜۤۚۨۥۘ";
                    break;
                case 726888668:
                    return;
                case 1040204702:
                    stopService(new Intent(getApplicationContext(), ToggleAim.class));
                    str = "ۚ۠ۜۛ۬ۘۘۥۖۧ۬ۛۛ۬ۘۘۘۗۢۦۘۦ۫ۘۚ۫ۤ۫ۘۘۢ۠۫ۛۦۙۘ۫ۥۤ۠ۜۘۡۗۗۙۘ۫۟ۙۗۘ۬ۢۜۜ۟ۛۗۛ۬ۜ۠ۥۧۘ۠۫ۥۛۥۖ۟ۛۤۘۡۗۖۚۚۦۧ۟۬ۦۦۛۦۙۗۙۜۘۗۘۨۧۤۖۘۨۙۘۘۡۨۦۘۜۥۖۘ۠ۥۦۘۖۖۖ۟۟ۦۘۧۖۜۡۘۗۡۘۡۧۦۦۘ۟ۡۤۚ۠۟";
                    break;
            }
        }
    }

    private void configureAimbotLogic() {
        String str = "ۘ۬ۨۚۚۨۘۛۢۘۧۚۧۡۛۦۛۨۧۢۡۜۚۘۤۚۜۢ۟۬ۨۛۘ۫ۢۙۧۧ۟ۚۥۨۥۙۚ۟ۙۤ۠ۛۗۗۛۥۚۥۡۧۡۨۘۖۘ۬ۤۢۜۘۦۛۜۘۖۘۙۤۜۢۜۜۘۘ۬۫ۤ۬ۧۜۘۙۗۨۘۙ۫ۥۨۜ۠۠ۢۙ۬۠۫ۗۡۖ۬ۨۜۘۡۜۜۘۙۧۘۡۖۜۘۤۛۨۘۜۥۧۘ";
        boolean z = false;
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 720) ^ 92) ^ 291) ^ 748) ^ 579) ^ 115) ^ 915) ^ 394) ^ 55) ^ 994) ^ 315) ^ 734) ^ 174) ^ 59) ^ 463) ^ 267) ^ 920) ^ PointerIconCompat.TYPE_CROSSHAIR) ^ 794) ^ 750) ^ 489) ^ 834) ^ 918) ^ 830) ^ 342) ^ 71) ^ 713) ^ 918) ^ 200) ^ 592) ^ 869) ^ 5617359) {
                case -1426656067:
                    str = "ۙۤۦ۬ۢ۫ۥۨۥۘۖ۫ۥ۠ۜۤۙۗۡۘۧۥۥۤۙۛۥۢۜۥ۬ۡۜ۟ۘۘ۟۫۫ۧۛۡۘۥۙۦۘۚۖۨۨۖۤۢۧۛ۬ۨۛۥ۫ۡ۫ۦ۬ۙ۠ۡۚۙۥۘۥۖ۠ۙۥ۬ۧۙۜۥۙۖۘۖۙۖۖۛۥۛۨۨۛۙۤۧۦۖۗۖۜۙ۟۠ۦ۫ۖۘۥۡۥۙۤۤۦۥۘۥۧۡۜۤۢ";
                    break;
                case -1119634471:
                    AimWhen(3);
                    str = "ۙۤۢۘ۬ۘۜ۠ۜۘ۠۫ۥۚۖۧۘۗۗۙ۟ۗۡۘۤۥۖ۠ۤۦۘ۫ۦۖۘۡۜ۟ۧۢۢۤۚۦۡۖۢۢ۫ۘۢۙۡۘ۠ۤۜۤۛۜ۠ۚۛۙ۟۠ۖۛۛ۫۟۟۟ۘۢ۬ۖۨۘۛ۬ۜۘۛۛۜۘۢ۫۠ۦ۫ۨۘۥۛۘۘۧ۬ۡ";
                    break;
                case -1007914611:
                    AimWhen(3);
                    str = "ۛۧۦۘۥۧۢۖ۠ۛۦۢۨۤۜۨۘۛۥۦۘۡۘ۠ۡۡۖۧۧۗۨۧۥۘۤۦۡۦۨۘۦۥۙۧۥۖۘۙۖۨۦۥ۟ۗۖۦۨۚۦۧۨۗۥۛۥۘ۬ۥۖۚۚ۟ۛۦۘۘ۬ۜ۟۬ۡ۠۠۫ۦۥۦ۫ۚۚۢۢ۟۠ۙۚ";
                    break;
                case -947727972:
                    WideView(220);
                    str = "ۧۨۖۘۨ۫ۘۜۖۘۦۜۙ۠ۗۘۘۥ۫ۦۘۥۥۡۗۢ۫ۧۙۦ۟ۚۖۘۙۘۘۘۜۖۧ۬ۤۥ۟۬ۡۘۤۦۨۚۥۜۡۛۥ۫۫۠ۥۘۥ۬۟ۙۤ۠ۥۜۥۧۧۖۦۘۢۥۗۡۖۜۘۜۙۚۘۤ۫ۧۛۘۘۡۘ۫ۖۖۨۢ۟ۜۥۨۧ۬۠ۖۘ۠۠۠ۡۦۖۘ";
                    break;
                case -546115134:
                    StopAimFloat();
                    str = "ۦۙۥۢۙ۬۟۟ۖ۠۬ۙ۟ۙۤ۠ۗ۟ۗۖۥۘۛ۬ۦۘۢ۟۟۫ۨۧۨۜۖۘ۬ۜۢۧۦۨۚۗۡۨۖۡۘۗ۬۠ۦۚۨۘۖۦۚۜۤۡۘۧۢۤۗۛ۟ۛۧۦۘۨۛۛۦ۫۬ۛۤۙۡۡۘۘۧۧۘۘۡۜۥۘۜۦۘۙ۠۬";
                    break;
                case 141648218:
                    z = getSharedPreferences(Deobfuscator$$app.getString(-3440721640226119497L), 0).getBoolean(Deobfuscator$$app.getString(-3440721592981479241L), false);
                    str = "ۤ۟ۛۥۦۚۦۜۘۘۧ۫ۡۘۜ۟۠۬ۛۘۘۤۥۤۤۚۗۚۚ۬ۙۡۧۨۙۦۘۘۖۢۘ۟ۤۨۜۥۘۛۥۥۘۘۙۘۘۚۘۛۖۡۚۡۡۖۗۥۧۛ۠ۜۜ۠ۙۤۢۢۗۤۥ۠ۥۦۢ۬۟ۖۢۜۘۢۨۡۘۗۗۥۘۥۦ۫ۛۙۗۛۡ۫ۗۤۦ۫ۛۧۖ۟ۖۤۢۥۡۚۨۘۗ۬ۡۘۙۥۡۘ۟۫";
                    break;
                case 399241089:
                    StopAimBulletFloat();
                    str = "ۙۜۡ۟ۦۨۨ۬ۨۘۨۦۧۘۛ۬ۘۥۡ۠ۚۥۜۘۦ۟ۡۘ۟ۨۘۘۙۤۤۙۨۘۖۦۨۜۘۦۘۧۢ۫ۢۛۛۨ۠ۥۢۤۖۡ۟ۨۥۗۢۨۘۡ۬ۙۛۥۘۥ۬ۖۡۚۧۡۘۛ۬ۤۥۖۜۘ۬ۙۨۜ۠ۚ۠ۜۥۗۨۡۘۢۧۜۦۤۥۘ۟ۡۢۗ۠۬ۦۧۡۘ";
                    break;
                case 678496504:
                    StartAimBulletFloat();
                    str = "ۖ۫ۜۘۜۘۚۜۢۗ۟ۜۧ۠۟ۡۘۤۛۚۢۖۨۘ۟ۖۥۛۦۛۦۨ۬ۘۙۖۜ۬ۚ۬ۨۛۦۢۦۡ۠۠ۛۙۡۜ۠ۜ۠ۡۖۨۙ۬۟ۦۡۧۜۛ۟ۗۜۥ۫ۚۡۘۘۧ۫";
                    break;
                case 771902452:
                    return;
                case 952087442:
                    String str2 = "ۤۦ۬۠ۤ۫ۡۙۘ۠ۙ۠ۖ۬ۜۘۦۙۖۧۜۦۘۗۥ۬ۘۡۡۡ۬ۨۘۤ۬ۡۗۢۚۡ۫ۛۛ۠ۧۙۜۦ۫ۜۧۘۖ۟۬ۡۘۦۘ۟۫ۜۘۥ۠ۦۘۤۖۥۘۧ۫ۦۘۙۚۗۙۙۧۛۧۡۘ۠۫۬۫ۦۘۢۤۨۘ۟ۜ۠۬ۙۜۨۨ۠ۖ۬ۦ۬ۚۜۘۥۖۙۚۜۘۚۨ۠۠ۢۖۘۖۨ۠ۜۡۗۤ۟ۡۘۦۜۢۜۢۨۘۡۘۤۗۚۨۘ۟ۢ۠";
                    while (true) {
                        switch (str2.hashCode() ^ 174211071) {
                            case -1546808988:
                                str = "۠ۗ۟ۧۡ۟ۚۨ۬ۖۦۥۗۚۛ۠ۗ۠ۜۗۨۢۗۡۘ۬ۥۥۘۦ۫ۘۛ۫ۚۘ۟ۗۜۧۦۘۚۦۥۡۡۘۘۚۘۡۘ۬ۜۧۘۨ۬ۡۘۚۥۦۘۡۡۘۨۖۛ۫ۖۦۘ۠ۤۤۡۨۥۘ۟ۦۥۖ۫ۥۧۦۘۘۧۦۜۨۚۘۙۡۘ۟ۙ۟ۦۧۘۢ۟ۧ۟ۥۛۖۤۨۘ";
                                continue;
                            case -1050371819:
                                str = "ۤۡۦۥۗۙ۟ۨ۟ۖ۬ۛۜۨۥۦۛۙۡۡۘۦ۬ۥۚۥۥۘۨۡۖۘۜۡۘۘۜۜۨۘۙۗۨۙ۬ۢ۬ۡۚۘۚۖۘۥۖۦۘۡۘۡۘ۠ۗۖ۟ۗۙۦ۫ۨۘۤ۬ۤۗۥۨۗۚ۬ۗ۟ۖۡۙۚۦۤۛۢۥۨۘۧۛۥۘ۬ۥۘۙۛۜۥۙۢۙۗۜۚۛ۫ۥۖۧ";
                                continue;
                            case -935712926:
                                str2 = "ۚۡۦۦۢۖ۫۟۟۠ۢۥۘۛ۫ۘۘۛۛۢۧۦۜۨۜۚۚۧۡۘ۬۫۬۫ۜۤ۫ۖۘۘۤۘۙ۟۬ۡۜۜۡ۟ۦ۬۫ۦۘۘ۬ۢۗۦۧۖۘۛ۫۫ۦ۠۬ۜۚۤۢۗ۟ۙۜۜۘۨ۫ۨۘۛ۬ۚ۬ۧۛۦۚۖۨۢۘۘۡۛۜۘۦۜۘۖ۫۟ۖ۟ۜ۟ۢۜۘۙ۟ۡۦۢۘۘ۫۠ۤ۬ۘۘۥۖۨۘۡۨ۠ۜ۠ۨۘۜ۫۠ۥۨۨۘۦ۬ۡۘۜۤۥ";
                            case 303494895:
                                String str3 = "۫ۖ۟ۢ۠ۧۢۖۨۢۥۗ۬ۤۚۢۜۨۘ۠۟ۦۘۚۘۤۖۚۚۛۚۜۘۦ۫ۚ۫ۥۘ۠ۚۘۘۦۥۘۘۤۥۖۘۗۘۧ۟۫ۛ۬ۡۗۙ۟۠ۛ۟ۛ۠ۢۜۘۛ۫ۛ۠ۤۡۘۢ۫ۙۧۧۥۥ۬ۜ۟ۚ۠ۨۜۘۛۘۗۥ۬ۡۛۦۙ۬۬ۘۘۘۦۘۥۢۥۥۦ۫ۦۦۧۘۥ۠۬ۢۘۛۚۥۡۨۤۢۗۛۜۡۧۡۘۖۡۜۡۙۤۨۜ۟";
                                while (true) {
                                    switch (str3.hashCode() ^ 529420475) {
                                        case -46980146:
                                            str3 = "۬ۥۦۚۘۢۜ۟ۧۡۘۘۧ۫ۘۘ۟ۢۥ۬ۛۨۘۚ۟ۚۥۨۢ۠ۙۦ۬ۙۨۖ۠ۡۘۦ۫۟۠ۥۡۘۧۤۢۡ۟ۗۖ۠ۡۛۖۜۘۘۧۖۧۢ۫ۜۡۢۥۨۚۙۧ۠ۙۙۛۛ۟۬ۨۢۚۦۧۗ۬ۙۗ۠۫ۗ۠ۤۗۢۜۢۦۖۙ۬ۙۥۙۗۥۘ";
                                        case 872785592:
                                            str2 = "ۘۛۨ۬۠ۚۘۖۢۖۥۘۤۗۦۚۥ۬۟ۖۘۘۘۡۡۖۡۡۘۨۢۨۨۨۗۧۖۨۙۨۘۙۢۖۨۛۖۘۗۤۘۘ۫ۢۥۥۗۛۛۤۦۘۗۚۘ۬ۧ۬ۧ۠ۜۥۙۨۚۛۚ۟ۡ۟۫ۨۘۨۖۜۘۘ۫۬ۚۜۧۗ۠۟ۚۘۛۙۛۨۙۚۡۘ۫۟ۜۘۡۙۘۛ۠ۡۘ۠ۖۥۡۚۥۛۛ۠ۜۜۦۘۜۧۨۘۢ۠ۜۘۜ۬ۘۘۜ۠ۨۗ۟ۥۘ";
                                            break;
                                        case 1265438787:
                                            str2 = "۫ۢۥۘۥۤۡۚ۠۟۟ۢۡۦ۬۠ۢ۫۠۠ۖۧۘۛۖۧۘۘۢۦۥ۠ۘۘۢۜۛۘ۬ۙ۬ۚ۫ۘۦۛۢۖۡۤۜۖۡۨۢۥۤۘۘۥ۫ۖۧ۫ۖۖۧۢ۬۬ۜ۬۫ۖۘۤۨۗۚۖۘۘۤۡۦۦ۟ۗۧۜۨۘۗۜۗۙ۟ۡۡۥۘۘۢۦۜۘۢ۟ۘۚ۬ۘۘ۫ۜ۫";
                                            break;
                                        case 2098548024:
                                            String str4 = "ۘۥۢۨۛۦۨۡۥۨۦۨۘۡۙۖۥۗۚۛۦۧۗۜۜۛۛۗۤۡۜ۠ۡۘۢ۠ۖۘۙ۠۫ۜۘۥۗۦۜۘۨ۠ۢۛۡ۟ۗ۬ۨۘۢۛ۟ۡ۠ۧ۬ۦۜۘ۬ۨۘۘۙۥۤۘۜۘۖۡۜۤ۬ۙ۬ۥۜۘۤۖۖۘۘۥۨۘ۬ۤۡۚۜۘۘۥۢۧۜ۟۫ۢۡ۟ۨۦۚ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 2096636383) {
                                                    case -732650334:
                                                        String str5 = "ۧۖۘۘۡۡۤۥۛ۟۫ۖۜۥۦۖۘۜۜۧۥ۟ۘۘۜ۠ۜۡ۟ۢۚۘۤۡۥ۟ۗۙ۠ۤۖۘۛۛۢۤۖۥۡ۟ۦۘ۠ۨۛۡۡۚ۟ۥۥ۟ۛ۬ۧۧۦۘۚۡ۟۟ۖۖ۬۬ۡۘۖۖۥۜۙۙ۫ۡۜۦۜۥۜۖۜۘۢۙۤۖۘۢۜۗۗۡ۠ۚۨۤۨۙ۬ۗ۫ۗۥۘ۬ۜۜۚۦۢۚۘۘۘۚۡۙۛۛۤۜۨۧۘ۟ۙۜۦۦۙ۠ۚ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ (-1789495330)) {
                                                                case -104319806:
                                                                    str4 = "ۗۢۨۘ۬ۚۘۘۡۡۨ۬ۜۘۛۖۥۘۚۙۤۚۨۖۘ۫ۜۨۘۥۡۨۧۥۜۘۤ۠ۥۘۜۧ۫ۙۨۦۨۡ۟ۛ۬۠ۚ۬ۥۘۙ۠ۜۜۘۙۚۛۨۘۙۗۡۘۙۘۙ۫ۜۙ۟ۨۜۘ۟ۜۧۘۜۥۖۘ";
                                                                    break;
                                                                case 99077796:
                                                                    String str6 = "۬ۡۜۘ۫ۧۘۘۚۦۨۘۚۤۜۘۦ۫ۧۥۗ۠ۚۨۦۘۖۛۙۚۖۨۘ۟ۘۢۢۙۡۘۗۖ۟۟ۚۛۥۙۥۘۨ۠۠ۖۡۖۧۦۗۖۨۧۘ۟ۦ۫ۙۡۧۥۧۧۤ۠ۖۘ۬۟ۥۘۤۨۧۛۤۦۘ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ (-296737996)) {
                                                                            case -1600289125:
                                                                                str5 = "ۨۨۤ۠۠ۜۘۧۚۦ۬۬۬۫ۙۦۘۧ۟ۗ۫ۥۘۙۚۨۦ۠ۜۘ۬ۚۥۜۡۗۧ۠ۨۖۘۦۘۤۥ۫ۡۛۥۧۥ۬ۚۨۜۖۗۦۚ۫ۙۡۨۘۘۥۨۚ۫ۦۘۢۚۙ۬ۖ۟۬ۡۘۘ۬ۢۦۘۚ۫ۤۡۚۦۘۨۡۛۨ۫ۨۦۛۥۖۦۘ۟ۤۥۘ۫ۥ۟ۗ۠ۙۨۨۧۘۙۢ۫ۢۤۨۤۤۢ۠ۦۥ۫ۘۗ۠ۖ۟ۧ۠۬ۖۘۛۦۜ";
                                                                                break;
                                                                            case -1348264197:
                                                                                str6 = z ? "ۙۚۡۛۢۛۦ۬۬ۚۨ۟ۖۘۖۘ۟ۖۘۙۦۚۙۗ۬ۖۙ۫ۗۛۗۤۥۘۤۦ۫ۢۦۥۘۘۨۤۡۚۧۡۘۘ۠ۗۥۘۡۜۚۥۖۙۡۜۥۘ۠۠ۧۙۢۡۘۡۙۛۨۨۙۢۖۖۘۘۧۖۦۗ۫۠ۜۧۘۖۨۖۘۜۖۥۘ" : "۠ۦ۬ۛ۠۫۬ۛۥۘۢۦۨۘۥ۟ۨۘ۟ۥ۬ۤ۠ۨۡۥ۫ۙ۫ۨۘۤۘۧۖ۠ۜۚۘۗۖۥ۫۠۫ۨۜ۟ۦۘۙ۫ۤۢۨۤ۠ۦۡۤۗۨۦ۫ۖۚۢۘۙۥۦۘۥ۟۬ۦۚۚ۫ۤ۬";
                                                                            case -1165759950:
                                                                                str5 = "ۘۢۡۜ۬ۨ۬ۥۘۘۜۖ۬ۙ۫۟ۤ۟ۨۘۤۤ۠۬ۜۖۘۥ۬ۧ۫۬ۧۧ۫ۖ۟ۢۜۧ۫ۧۛۛۘۘۥۧۤ۬ۥ۠۠ۡ۠ۢۚۦۖۚ۬ۚۡ۫ۧۡۙۧۙ۟۠ۢۙ۫۟ۙ۫۠ۗۜۦۘۘۗۥۗۧۙۦۖۦۘۘ۬۫ۤۢۨۘۗۦۦۘۗۤۖ۬ۛۛۨۢۘۛۧۥۛۥۥۘۖ۠ۙۛۖ۫ۜۦۜۡۤۚۙۦۨۘ۫ۥۦۜ۠ۥۢۥ۟";
                                                                                break;
                                                                            case 919080203:
                                                                                str6 = "ۗۘۛۦۡۗۙ۫ۘ۠ۗۖ۬ۡۖۘۖۥۚۖۨۘۢۤۗۗ۬ۜۘۜۛۜۘۗۤۡۛۙۗۘۦۗۚۖ۬۠ۨۘۢۦۗۥۛۢ۫ۙۨۘ۠ۧۢۤۦ۫ۥۜۨۗۤۙ۠ۘۧۘ۠ۧۚۚ۟ۤۛ۟ۨۜۦۘۦۤۘ۬ۥ۫ۥۧۜۘۚۥۚۥ۟ۗۧ۫ۖۙۦۧۘۘ۫۟۫ۘۗۨۛۙۖۡۖۘ۟ۖۜۘ۫ۚ۠";
                                                                        }
                                                                    }
                                                                    break;
                                                                case 340515898:
                                                                    str5 = "۫ۖ۟ۖۨۘۧۙۛ۟۟ۦۘ۫ۗۥۘۛ۟ۜ۫ۤۧۦۡۙۥۥۘۘ۠ۙۘۘۦۢۤ۬۫ۨۘ۬ۛۤۢۘۨ۟۟ۚ۠ۙۦۜۘ۟ۥۛۨۦۨۘۦۜۥۚۧۧۘ۬ۘۖۢۗۛۙۡۥ۫ۚۨۚۜۡۘۘۘ۬ۙۛۗۜۦۛۡ۫۬ۡۘۥۡۛۚ۟۫ۧۨۚۨۖۧۘۦۜ۠۟۬ۡۢ۬ۖۘۜۗۦۨۚۨۘ";
                                                                case 1733880634:
                                                                    str4 = "ۖۧۚۨۨۘ۠ۡۥۘ۟ۦۧۚۚ۬ۙۢۧۜۦۘۢ۫ۖۘۜۧۡۖۛۙۨۥۦۤۘۜۘ۬۟ۙۨۖۜۖ۟ۧۨۖۗۚ۠ۖۚ۫ۗۗۗۤۥ۟ۤۘۘۥۡۡۘۗۤۧ۬ۤۘۡۗۥ۬ۢۜۦۡۡۘۘۥۗ۠ۦۚۦۙۥ";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case -450938309:
                                                        str3 = "ۙۛۘۘ۫ۗۡۘۦ۫ۨ۫ۚۖۘۜۖۡۧۤۥۨ۟ۖۘ۟ۤ۠ۖۖۜۢۦۖۦۥۚۚۗ۠ۜۤۘ۠ۜۖۘۙۙۜۘ۠۠ۜۘۖۚۥۘ۟۫ۢۧۦۜۚ۫ۧ۫ۧ۬۫ۜۘۚۡۘۧ۫ۡۗۧ۠۠ۙۛۚ۫ۜۘۢۤۤۦۧۘۤ۫۠ۢۛ۠ۨۨۥۘۤۢۢۗۗۛ۟ۙ۠";
                                                        break;
                                                    case -439065238:
                                                        str4 = "ۚ۠ۦ۟ۢۘۘۥۤۦ۫ۡ۟ۜ۟ۡۥۡۛۢۤ۫ۨۜ۟ۛۢۖۡۧۖۘ۟ۥۡ۫ۡۨ۟۠ۜۘۥ۠ۙ۬ۙۧۜۥۢۘ۠ۤۘ۠ۗۢ۠ۡۤۤۖ۠ۡۦۘۛۧۦۘ۬ۙۥۘۢۥۖۧۡۘۗۨۧ۟ۚۨ۟ۚ۫ۛۦۦۚۖۘ۬۟ۨۚ۬ۢ۬ۤۦ۫۬ۥۘۤ۫ۛۗۚۗۘۘۤۧ۬۠۬۠۬ۚۦ";
                                                    case 259836921:
                                                        str3 = "ۤۜۡۘۖۥۘۘۖۡۚۡۘۤ۫ۤۡۧۖۦۘۛۥۖۘۡ۬ۧ۟ۖۘۢۢۦۗۦۗۨ۟ۥۘۤۗۦ۠۟ۡۢۨۧۢۧۖۡۢۤۡ۫۬ۥۢۚۖۜۘۗۛۥۧۖۧۘۛۙۦۗۖۢۗ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 1570271489:
                    distances(999);
                    str = "ۨۢ۫ۥۛۦۘۡۙۛۥۚۚۦۧۢ۫۟۫ۚۗۛۖۨ۠ۚ۬ۤۧ۬۠ۨ۫ۨۤۦۘ۬ۥۨۦ۠ۚۧ۟ۘۤۜۗ۟ۦۧۛ۠ۙۡۘ۫۬ۥ۠ۧۗ۟ۦۥۜۜۜ۫۫۬۫ۡۘۛۗۢۗۧ۠ۜۘۖ۟ۥۥۘۘ۫ۙ";
                    break;
                case 1685370143:
                    StartAimFloat();
                    str = "ۙۤۦ۬ۢ۫ۥۨۥۘۖ۫ۥ۠ۜۤۙۗۡۘۧۥۥۤۙۛۥۢۜۥ۬ۡۜ۟ۘۘ۟۫۫ۧۛۡۘۥۙۦۘۚۖۨۨۖۤۢۧۛ۬ۨۛۥ۫ۡ۫ۦ۬ۙ۠ۡۚۙۥۘۥۖ۠ۙۥ۬ۧۙۜۥۙۖۘۖۙۖۖۛۥۛۨۨۛۙۤۧۦۖۗۖۜۙ۟۠ۦ۫ۖۘۥۡۥۙۤۤۦۥۘۥۧۡۜۤۢ";
                    break;
                case 1790152836:
                    Target(3);
                    str = "ۙۗۦۤ۫ۛ۬ۥۘۙۗۡۚۘۤۤۤۧۛۥ۬ۡ۬ۦۖۙۦ۬۫ۤۖۧ۫ۙ۬۟ۤۛۖۘۚۧ۬ۥۙ۠۟ۢۚۡۢ۟ۖ۫ۦۖۢۧۙۛ۟ۙۢۛ۫ۙ۟ۥۛ۟۬ۡۘ۠ۜۡۨۧۨۘۡۤ۠ۦۘۘۘۤ۠ۡۘۚ۟ۖۘ۬۫ۚ۟ۥۜۘ۠ۧۢۥۖۦۘ۟ۖۦۘ۫ۥۧۜ۟ۘ۬ۖۦۘۛۘۜۘ۟ۜۜۘ";
                    break;
                case 2061295998:
                    str = "ۡ۬ۚ۬ۖۗۗۙۡۘۢۘۘۘۧۨۙۧ۬۟ۚ۫ۦۨ۠ۥۘۖۦۛۧۜۢ۠ۦۦۢۚۜۥۘۚۘ۟ۦۚۖۘۘۧۤۖۤۚ۫ۨۘۛۡۘۨ۬ۡۧۘۤۚۧ۬ۛۤ۟ۛۥۧۘۛۢۢ۬۬ۜۘۚۚۘۗۨ۠ۘۙۚ۬ۢۨۘ۫ۜۧ۬۟۟ۗۖۥۗۡۘۛۗ۟ۦۗۥۘۡ۫ۖۘ۬ۜۘ۬ۢۜۘۖۖۤۛۛۙۘۛۘۘۤۡۜ۠ۡۧ۫۟ۙ";
                    break;
            }
        }
    }

    private void configureAutoSettings() {
        String str = "ۙۨ۠ۚۛۘۘۗ۟ۗۛۗ۫۬۫ۢۨۚۙۛۖۖۘ۟ۡۘۤۖۛۥۧۗ۬ۥۧۘۚۦۜ۫ۤۤۡۦۡۢۡۜۙۡۖۘۤ۫ۘۘ۬ۘۧۘ۟۬ۛۢ۟ۦۘۙ۫ۡۤۤۨۘۚۤۘۘۥۗۜۘۨۘۛۛۙۥۘۨۢ۟ۦ۠ۡۚۙۥۨ۬ۡ۬ۛ۫۟ۦۧۜۚۜۧۢۜۦۙ۟ۖۖۛۡۨۧۨۘۖ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 555) ^ 538) ^ 450) ^ 278) ^ 530) ^ 644) ^ 0) ^ 79) ^ 773) ^ 178) ^ 525) ^ 245) ^ 458) ^ 779) ^ 753) ^ 609) ^ 581) ^ 706) ^ 533) ^ 101) ^ 873) ^ 476) ^ 13) ^ 528) ^ 815) ^ InputDeviceCompat.SOURCE_KEYBOARD) ^ 286) ^ 514) ^ 81) ^ 69) ^ 187) ^ (-1540462896)) {
                case -1809195734:
                    SettingValue(17, true);
                    str = "ۚۥۤ۟ۢۧۛۨ۬ۤۥ۠۫ۖ۬ۙ۫ۛۢۧۛۚۦ۠ۖۜۢ۫۟ۡۘۢۙۙۨۚۘۡۖۥۘۘۥ۠۠ۤ۬ۖۚ۟۠ۥۦۦۧۘۥۨۙۡ۟ۚ۠ۛۡۘ۫ۡۦۘۖ۬ۘ۫۫ۜۘۨۙۦ۫ۘۚۧۤۜۜۖۜۦ۫ۨۘۗۛۦۜ۟ۥۡ۟۟ۦۤۙۗۤۦۘ۬ۨۚ۠ۛۛۜۙۘۘۥۗۖۘۘۤۥ۟ۡۥۘۤۧۡۚۤۘۘۗۘۡۖۜۦۦ۟ۨۘ";
                    break;
                case -1608572899:
                    SettingValue(2, true);
                    str = "ۢۡۚۗ۠ۨۘۤۤۥۘۨۥۥۡۘ۟ۜۨۤۜۤۗ۫ۨ۫ۧۤۙۢۘۘۦۙۥۘ۬۬ۖۘۚۤۖۘۚ۟ۛۖ۠ۡۖ۬ۡۙۧۘۘۢۥۨۘۦۖ۟ۛۗۦۥۘ۠ۗۨۘۧ۟ۙۖۚۚۘۨۨۘۛ۫ۚۛۜۛ۠ۧۜۘۥۖ۬ۢ۬ۘ";
                    break;
                case -1374593028:
                    setValue(Deobfuscator$$app.getString(-3440722022478208841L), true);
                    str = "۬۠۬ۨۖۦۘۘۦۛۥۜۚ۠ۥۜۜۚۡۖۤۤ۠ۨۤ۬ۦۛۗۖۘۘۚۨۤ۬ۧ۫ۦۢۦ۬ۧ۬ۨۧۦۧۘ۬ۖۡ۬ۜۡۙ۬ۘ۠۟ۡۘۛۚۦۘۦۥۘۘ۫ۢۖۨ۟ۨۘۥۦ";
                    break;
                case -1312855656:
                    SettingValue(6, true);
                    str = "ۚۥۧۦۤۧۛۥۗ۟ۚ۟ۧۨۘۢۥۖۘۖۨۘ۬ۖۗ۠ۤۧ۟۫ۛۡ۫۬ۘۧۚۧۥۢۦۚۦۘ۠۠ۡۥۗۘۖۧۨۘۗۛۤۙۚۡۡۥۤ۟ۤ۟ۥۢۨۘۗۤۥۗۥ۫ۨۨۘۘ۠ۚۗۤۚۢۡ۠ۨۘ۫۫ۥۖۨۧۗۥۦۘۖ۟ۘۡۤۜۘۢۡۖۚ۠ۜۘۜۚۜۘ۟ۥۤۚۢۢۡ۬ۢۖ۟ۙۤ۠ۡۨۗۙۧۘۛۜۦۖ۬۬ۥ";
                    break;
                case -1298754157:
                    return;
                case -958701956:
                    startService(new Intent(this.ctx, Overlay.class));
                    str = "ۛۥۛ۠ۢۖۗۛۥۘۙۨ۟ۚۙۚ۬ۚۛۨۛۨۘۧۦۨ۟ۖ۫ۗۥۛۛۚ۬ۢۦۗۥ۫ۖۘۚ۫ۥۜۖۨۘ۫۬۫۟ۘ۟۫۫ۨۨۡ۬ۤۤۢۧۛۤۥۜۘۗۧۜۙۛ۟۫ۢۜۘۙۙۧۚۛۜۚۘۘۛۖۧۘۚۛۨ";
                    break;
                case -135439743:
                    SettingValue(4, true);
                    str = "ۖۘ۠ۡۚۨۡۘۥۘۥۤۗۧۢۙۥۚۙۖۤ۬ۛۢ۠ۤۡۥۘۤ۟ۨۘ۫ۛۥۘۧۡۖۘۢۨۜۦ۠ۘۛۙ۬ۤ۟ۧ۟ۤۛۜۗۗۚۦۘۥ۫ۚ۠۫ۢۙۢۤ۬ۦۦۚۚۥۘۤۦۧۙ۬ۥۤ۬ۜۥۙۜۥۖۙۙۢۘۘۨۧۨۘۛۛۘۘۦۚۦۗۖۘۘۜۖۡۚ۬ۛۢۘۢۙۤ۟ۡۖۡ۟ۜۜۡۖۤۘ۠۫ۗۤۙۛ۠ۜۙۥ";
                    break;
                case -31158698:
                    SettingValue(10, true);
                    str = "ۛ۬۠ۦۘۧۘ۬ۛۡ۟ۧ۫ۥۨۡۘۜۦۗ۬ۨۤۛ۫ۛ۬ۦۘۛ۬ۘۛۖۘۘۥۘ۠ۗ۟ۛ۠ۙۚۤ۫ۜۢ۠ۥۘۜۗۨۘۡ۠ۘۘۥۢۘ۟ۙۚۡۡۥۦ۬ۤۖ۫ۛۚۡۧۖۚ۟۟ۥۨۧۖۘۙۨۦۙ۠ۜۨۘۢۗۡۘۜۘ۟ۥۚۚۘۛۥۙۡۘۘۘۖۘۘۨ۠۫ۡۤ۠ۡۦۜۛۖ";
                    break;
                case 294037622:
                    configureAimbotLogic();
                    str = "۠ۤ۬ۥۨۦۘۡۤۦۜۜۚ۬ۜۨۘۚۦۨۢۚۛۖۜۦ۫ۘۙۜۘۦۘ۬۫ۘۘۛۛ۟ۤۤ۫۬ۧ۫ۘ۬ۡۡۡۜۚۡۥۘۜ۠ۖۘۘۥ۫ۗۚۗۨۤۥۘ۠ۡ۬ۚۦۗۗۙۙۡۢۛۡۤۨۘۤۚ۟ۜۗ۬ۤ۫ۘۡۘۦۘۡۘ۠ۨ۟ۘۜۜۘ۠۬ۘۘۚ۠ۨۘۚۙۤۤۨۘ۬۠ۥۢ۠۟ۗ۟ۦۘ";
                    break;
                case 438149587:
                    enableAllItemsAndVehicles();
                    str = "ۨۡۨۘۘۦۡۤۥ۫ۖۡۘۘۨ۠ۗۚۦۘۜ۫ۖۚۥۤۗۖۗۗۢ۬ۢۢۧۙۧۜۗۡۙۚۤۙۘۜۖۘ۫ۤۘۛۚۢۤۖۘ۬ۦ۟ۨۜۧۡۚۜۦۚۖ۟ۦ۬ۤۥۘ۠ۢۨۘ۫۠ۘۘ۬۬ۘ۬ۡ۫ۚ۟ۨۘۦ۫ۚۤۧۛۛۤۢۦ۟ۧۢۥۘۘ۠ۖۙ۫ۖۥۚۛۦۘۗۧۥۗۤۡۘۤ۠ۚۥۖ۠ۘۢۖۘ۫۠ۖۘۡ۟ۥۜۜ۠";
                    break;
                case 826124665:
                    SettingValue(5, true);
                    str = "ۡۛۛۜۚۛۜ۫ۗۛ۬ۜۙ۫ۢ۟۫ۤ۠ۜۤ۟ۚ۫ۧۖ۟۠ۘۛۜ۠ۚ۟ۚۨۘ۟ۤۢۜۛۨ۟ۚۦۦۗۡۚۛۨ۫ۚ۟ۡۤۡۢ۟ۧۛۧۜۘۙۙۙۛۢۡۤ۟ۧۧۚۦۙۜۨۨ۫ۥۘ۠ۖۧۜ۟ۘۘۘۨۛۖۧۘ۟ۡۦۘۨۦۧ۫ۡۜۘۚۧۦۘۢ۬ۗۜۙۢۖۙۖ۫ۚۡۚۚ۫ۛۚۦۘۦ۬۟ۤۧۗ۬ۙۥۘۖۚ";
                    break;
                case 1120191445:
                    setFps(90);
                    str = "ۗ۠ۗۤ۫ۚۚ۫ۖۘۧۨۘۘۦۚۙۢۜۖۗۧۡۗۗۡۘۜۦۢۡۦۜ۫ۦۧۚۢۦۘۢۢۜۘۧۢۚۚۛۡۘۦۖۚۛۤۙۦۖۚۛۡۙ۬ۦۥۤۨۢۘۧۘ۫ۙ۠ۗۚۖۙ۫ۚ";
                    break;
                case 1310057214:
                    SettingValue(7, true);
                    str = "ۨۥۜۧۧۡۚ۠۠ۘۛۜۨۥۡۘۨۖۚۥ۟ۨۘۙۚۤۙۙۛۙۧۦۘۛ۟ۦۧۙۛۖۚۖۘ۠ۜۜۤ۠۫ۜۙۛۨۖۦۢۚۖۘۗۢۥۘۨۢۖۘ۟ۡ۫۬ۛۢۛۚۘۙ۠ۧۗۗۥۖۛۖۚۚۜۘۦۖۦۨۧۦۨ۠ۦ۫ۜۖ۬ۙۦۨۥۜۘۙۗۧۦۥۨۛۢۡۘۢۥۖۘ۟ۨۥۘۛۤ۟ۡۗۖۘ";
                    break;
                case 1443380292:
                    str = "۠ۦۘۦۥۦۘۥۧۦۥۨۦۘۖۘۜۥۤۡ۠ۤۤ۬ۧۗۖۛۧۧۖ۬ۗۙۖۘۤۛۚ۫ۡ۫ۡۢۘۥۜۘۚۛۚۤۤۧۗ۠ۨۦ۬۫ۗۨۥ۟۬ۘۘ۬۠ۚۦۦۡۖۙۨۧۨۦۘ";
                    break;
                case 1536061265:
                    SettingValue(9, true);
                    str = "ۖ۟۠۬ۙۙۦۦۥۘ۟ۖۥۘ۬ۖۗۢ۫ۨۥۘۢۢۦۡۧۨۘۘۡۗ۠۠ۜۙ۫ۧۥۗۜۘۧۖۡۨۗۨۘۘۚۜۘۙۗ۠ۚ۬۠ۖۨۧۚۜۜۘۙ۫ۥۥۥ۠۠۟ۙۧۦۦۨ";
                    break;
            }
        }
    }

    /*  JADX ERROR: Type inference failed with exception
        jadx.core.utils.exceptions.JadxOverflowException: Type inference error: update tree size limit reached
        	at jadx.core.utils.ErrorsCounter.addError(ErrorsCounter.java:56)
        	at jadx.core.utils.ErrorsCounter.error(ErrorsCounter.java:30)
        	at jadx.core.dex.attributes.nodes.NotificationAttrNode.addError(NotificationAttrNode.java:18)
        	at jadx.core.dex.visitors.typeinference.TypeInferenceVisitor.visit(TypeInferenceVisitor.java:114)
        */
    private void enableAllItemsAndVehicles() {
        /*
            Method dump skipped, instructions count: 5120
            To view this dump add '--comments-level debug' option
        */
        throw new UnsupportedOperationException("Method not decompiled: kentos.loader.floating.FloatService.enableAllItemsAndVehicles():void");
    }

    private void setFps(int i) {
        SharedPreferences.Editor editor = null;
        String str = "ۗۚۤ۠ۛۤ۟ۧۨۘ۫ۗۗۤۜۘۘ۟ۨۘۦ۠ۗۥۡۦۤۘۡ۬۬ۘۘۘۨۧۘۨ۫ۨۘۨۦۙۥۢۗ۟ۙ۠ۦۢۥۘۢۙۖۘۜۛ۟ۜۖۘۡۡ۠ۜ۠۠ۘۙ۠ۥۜ۠ۘۢۖۘۗۥۘۜۥۖۘۙۗۚ۬ۦۢۡۨۦۧۚۙۚۛۥۙۥۧۡۖۗۦۜ۠ۤۢ۬ۖۜۢۤۜۖۘۥۚۤۖۨۦۘ۠ۨ۬";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 338) ^ 567) ^ 104) ^ 963) ^ 309) ^ 889) ^ 368) ^ 292) ^ 286) ^ PointerIconCompat.TYPE_NO_DROP) ^ 563) ^ 652) ^ 875) ^ 163) ^ 736) ^ 810) ^ 57) ^ 196) ^ 426) ^ 907) ^ 744) ^ 71) ^ 605) ^ 256) ^ 716) ^ 332) ^ 961) ^ PointerIconCompat.TYPE_GRAB) ^ 398) ^ 967) ^ 731) ^ 1204381722) {
                case -1318214531:
                    str = "ۡ۠ۘۘۚۧۢ۫ۙۖۘۦۖۛۥۧۤۢۨۤۚۡۥ۠ۗۧۨۘۛۥ۫ۚۡۗۧ۫ۙ۬ۤۗ۠ۤۡۤۤۗۘ۫۬۫ۚۖ۬ۛۥۘۘۨۡۦۘۡ۠۠ۖۥ۟ۦۖۘۚۙۦۧۚۛۢ۟ۘۦۚ۫۠ۙۖۤ۠ۗۤۖۗۨۖۘۘۜۛ۬ۛۘۚۨۘۘۗ۬ۜۢۚۢ";
                    break;
                case -885128763:
                    editor = getSharedPreferences(Deobfuscator$$app.getString(-3440721970938601289L), 0).edit();
                    str = "۠۫ۖۘۙۚۡۘۧۘۦۚۡۨۖۢۜۘۜۚۨۘۢۛۚۧۘ۠ۢۧۖۧۚۛ۬ۘۘۛۤۤۗۜ۫۫ۨۡ۫۠ۙۥۨ۟۫۫ۥۢۥۘۤ۟ۖۘۧۡۧۙۗۤۗۖۘۡ۠ۥۛۨۘ۠ۤۥۢۢۚۘۢۦۨۡۘ۫ۛۘۥۤۚۙۢۡۙۚۘۘۖۢۥۗۨۘۘ۠ۜ۫";
                    break;
                case -560077883:
                    return;
                case 123770130:
                    editor.putInt(Deobfuscator$$app.getString(-3440721657405988681L), i);
                    str = "۬ۜۛ۠ۗۚۜۗۡۘۤ۠ۖۛۛۢۤۚۨۧۛۚ۟ۦۘ۫ۗۡۘۖ۬۬ۗۦۗۤۥۙ۠۬ۦۗ۟ۦ۟۫۫ۨۘۗۗۛ۫۟ۡۨۘۥ۫ۘۘۙۛۚۡۘ۬ۚۤۖۘۚ۠۟ۚۨۜۘۤۤ۫۬۫۫ۘۢۙ۫ۡۨۘۡۙۨۧۛ۠";
                    break;
                case 272145811:
                    str = "۫ۘۥۘ۠ۢ۟ۨۙۨۘۥ۟۟ۜۘۘۘۦ۟ۖۡۜۘۨۦۢۢۨۥۢۗۘۜ۬۬ۨ۠ۡۥۥۡۘ۬ۡ۟ۨۧ۠۬ۙۦۘۥۘۨۘۜۗۗ۠۠ۖۚۜۦۙۢۦۤ۟ۖۤۜۧ۟۫ۢ۬ۥۚۚۦۥۜ۟ۨۘۘ۠۠ۥۗۤ۠ۜۧۘۧ۟ۥۛۡ۟۠ۥۖۘۘۥۘۤۗۨۘ۟ۤ۠۬ۚۘۘۢۦۙۖۘۖۛ۬ۦۘۡۚ۫ۢۚۥۦۢ۠ۧۛ۠ۥۚ";
                    break;
                case 1210654955:
                    editor.apply();
                    str = "ۚۜۨۙۥۤۗۡ۟ۖۨ۫ۜۘۘۘۙۨۘ۬ۤۥۨۤۧ۠ۢۘۗۘۜۥۘۦۥ۠ۨۘۡۘۖ۟۬۟ۤۦۛۢۤۧ۟ۦۘۢۜۘۦۥۜۛۛۨۜۗۙۢۦۨۦۖ۬ۦۗۛۗۡۛ۠ۢۖۘۘۘۘ۠ۤۜ۫ۗۘۖۨۛۖۘۦۢۥۘۛۗ۠ۙۘ۫۬ۨۡ۠ۘ۠ۡۥۨۚۗۥۜ۠۟۫ۢۗۚ۟ۦۘۖۥۥۘۥۜۨۘۨۗۨ۬ۥۥۘ";
                    break;
                case 1752144455:
                    ESPView.ChangeFps(i);
                    str = "۫ۨ۟ۡۜۢ۫ۦۦۜ۬ۥۘ۫ۖۨۘۡۜۖۘۥ۬ۥۘۢۛۚۡۜۥۥۗۡۘۥۦۦۘۜ۫ۨۘۛۖۧۜۗۜۨۧۢۙۡۤۨۦۘۨۤۡ۠ۤۘۜۜ۟۠۬ۗۖ۠۠۬ۙۨۗ۬ۢۖۦۖ۠ۨۢۗ۠۬ۛۙۧۖۖۙ۫۫";
                    break;
            }
        }
    }

    private void setValue(String str, boolean z) {
        SharedPreferences.Editor editor = null;
        String str2 = "ۜۙۜۘۦۥۢ۠ۢۗۖۢ۫۠ۜۢ۠ۙۦۘۧۖۙۚۙۗۥۗۗۘۚۚۜۘ۠ۜۖۖۘۦۜۛۙۧۡۙۥۘۗ۬ۖۖۜۥۘۧۘ۫ۚۦ۬ۜۘۗۛۡۤۖ۠ۦۡۧۡۨۨۙۜۡۘۙۛۖۘۛۚۨۘۙۚۙۧ۟ۨۘ۫۟۠ۤ۠ۛۡۜۤۡۚۨۛۦۜۘۥ۬۫ۚۜۡۘۘۗۜۘ۠۟ۧۙۧ۫ۦۘۥۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 311) ^ 73) ^ 465) ^ 3) ^ 677) ^ 943) ^ 996) ^ 645) ^ 557) ^ 569) ^ 36) ^ 836) ^ 908) ^ 560) ^ 821) ^ 42) ^ 397) ^ 188) ^ 366) ^ 859) ^ 740) ^ 945) ^ 885) ^ 70) ^ 597) ^ 963) ^ 600) ^ 814) ^ 546) ^ 224) ^ 226) ^ 38283591) {
                case -1770372808:
                    editor.putBoolean(str, z);
                    str2 = "ۦۧۘ۟ۙۖۡ۫ۧۡ۠۬۫ۢۘۘۡۛۥ۠ۧۥۗۘۙۨۧۥۗۧۗۨ۟ۥۘ۠ۛ۬ۜۘۘۚۘۘۥۛ۠ۥۦۘۦۘۛۨۤۢۘۨ۠ۗۚۥۛۚۖۘۡۧۨ۬ۜۢ۫ۧۘۘۦۘۖۧۘۢۡۨ۠ۡۢۥۘ۫۫ۡۘ۫ۖۡۘۙۧ۬ۦ۬ۜۙۦ۠ۚۖۢۦۛۛ۫ۨۨۗۚۛۦۖ۠ۥۚۢۧۖۧۛۧ۟۟ۤۚۘۘۨ۠ۙۘ۬ۗ";
                    break;
                case -1666352700:
                    str2 = "ۛۨۘۘۢۤ۠ۥۛۖۘ۟ۤۤ۠ۥۘۥۡۦۘ۟۠۟ۡۛ۬ۚۚۙۢۦۘۛۥۖۘۥۥۡۘ۬ۧ۬۫ۡۨۡۤۡ۫ۧۖۘۤۦۢ۠ۙۡۦ۠ۚۗۚۜۘۥۛۘۘۧۜۙۡۘۛ۬ۧۤ۬ۛۦۘۚۙۥۘۡۦۡۨۜۖۘۗۜۧۘ۬ۚۧۨ۠ۖۘۜۙ۠ۡ۟ۘۘۢۧۦۙۘۗۨ۠ۘۦۥۙۤ۬ۗ۬ۙ۟ۜۗ۠۬ۜۡۘۤ۬ۙۨۚۡۘ۟ۥ۬ۨ۟۠";
                    break;
                case -806491138:
                    return;
                case -414702512:
                    str2 = "ۖۗۖۘۡۢۦۡۗۦۤ۫ۢۘ۬ۡۘ۠ۙۡۗۜۦۘۜۚۥۘۥۧ۟ۖۢۜۗۡۧۚۙۜۧ۫ۢۨۖۦۘۘۢۤۦۤۙۨۘۦۗۤۦۗۤ۬ۗ۬ۛۥۨۘۘۖ۟ۢۡ۟ۦۧ۬ۢۧۡۛ۫ۡ۠ۡۢ۫ۧۧۗ۬ۜۘ۬۬ۥۘۖۧۜۘ۫ۧ۠۟ۜۥ۟ۙۘۢۦۦۘ";
                    break;
                case -40052613:
                    editor = getSharedPreferences(Deobfuscator$$app.getString(-3440747745037344585L), 0).edit();
                    str2 = "ۚ۫۠ۘۖۦۘۖۥۧۘۥۛۚۧ۟ۘۘۛۜۡۘۧۛۦۙۙۦۥۥۦۘۜۨۨۚۛۖۙۗۚۢۙۜۙۤۖۥۘۖۘۚۧ۠ۢۗۢۗۘۧۘۜۙۖۚۛۜۖۖۧۘ۬ۦ۟ۡۘۖۡۥ۫ۙ۫ۨۘ";
                    break;
                case 239725065:
                    editor.apply();
                    str2 = "ۥۢ۫ۙ۬ۘۘۡۖۜۘ۠ۢۘۘۨۢۜۡۥۚۚ۫ۤۘۙۥۘۤۚۦۗ۠ۦۗۛۖۨۘ۟ۖۖۧۘ۬۠ۜۘ۬ۨۨۧۘۖۘۚۦۦۜۛۜۘۢۘۚ۟ۚۥۘۜ۟ۗ۫ۥۤۘۘ۠۬ۡۘ۟ۖۧۥۛۘۘۧۢ۠۬ۚۦۘۘ۠ۡۘۘۤ۟ۘۜۥۦۥۜۘۡۛۡۦۛۖۦۦۗ";
                    break;
                case 2084140734:
                    str2 = "۫ۧۖۘۖۜۨۘۤ۫ۨۘۥۙۨۢۧ۫ۨۦۘۧۤۧۥۛۘۜۖ۠ۤ۫ۚۗۨۨۛۖۢۨۥۘۜۢۢۦۛۡۗۨۙۘۧۘ۫۬ۙ۟ۖ۫۟ۛۨۘۨۚۥۡۛۛ۬۬ۗۨۥۢۚۗ۬";
                    break;
            }
        }
    }

    public native void AimBy(int i);

    public native void AimWhen(int i);

    public native void AimingSpeed(int i);

    public native void Bulletspeed(int i);

    public native void RadarSize(int i);

    public native void Range(int i);

    public native void SettingAim(int i, boolean z);

    public native void SettingMemory(int i, boolean z);

    public native void SettingValue(int i, boolean z);

    public native void Smoothness(int i);

    public native void Target(int i);

    public native void TouchPosX(int i);

    public native void TouchPosY(int i);

    public native void TouchSize(int i);

    public native void WideView(int i);

    public native void distances(int i);

    @Override // android.app.Service
    public IBinder onBind(Intent intent) {
        String str = "ۜۥۤ۫ۘۧ۫ۤۧ۟ۜۨ۬ۤۜۘۜۘۘۘۙۨ۬ۖۦۙۛۗ۠۫ۗۤۦ۬ۚۧۖۤۘۤۘۛ۟ۧ۠ۨۨۘۧۡۧ۬ۧۡۘ۬ۢۖ۬ۢۚ۫ۨۘ۬ۥۜۘۜۘۜۘ۫۫۟۫ۚۡۖۘ۠ۥۘۢۨۘۦۘ۬۟ۦۘۥۥۙ۫ۨۜ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 790) ^ 185) ^ 304) ^ 953) ^ 586) ^ 523) ^ 519) ^ 279) ^ 686) ^ 290) ^ 686) ^ 843) ^ 297) ^ 270) ^ 725) ^ 84) ^ 127) ^ PointerIconCompat.TYPE_VERTICAL_DOUBLE_ARROW) ^ 884) ^ 571) ^ 424) ^ 532) ^ 461) ^ 335) ^ 462) ^ 109) ^ 354) ^ 46) ^ 351) ^ 325) ^ 781) ^ 918484270) {
                case 286986085:
                    str = "ۤۜۥۘۧۗۖۖ۠ۖۤۨۨۥ۟ۛۧ۫ۚۤۨ۫ۗۜۘۨۛۨۘ۠ۜۛۨۧۘۘۥ۫ۖ۬ۢۘۗۥۗۖۘۨ۟ۘۘۙۚۥۚۥۧ۬ۚ۟ۘۧۦۘ۠ۗۚ۫ۨۛۜۜۘ۠ۢۖۘۘ۬ۡۘۤۧۨۘۘۚۤۦۘ۫ۗۦۡۘۛۧۗۗۗۙۥۗۚۚۡۦ۟ۙۥۘۗۦۧۘۦۘۘۗۡۘۜ۫ۘۗۢۡۘۛۚ۬ۡۤۤ۫ۨۜۘۘۛۜۘۨۖۜۘ";
                    break;
                case 1248965131:
                    str = "ۛۧۧ۬ۘۗ۬ۜۘۢۙۥۧۙۥۘ۠ۘۥ۫ۚ۬ۨۚ۫ۦۥۗ۬ۙۦۨۨۗ۟ۙۙۡ۠ۡۘۖۢۗ۟ۘۨۗۡۦۘۘۨ۠۠۫ۨۘ۟۟ۨ۬ۧ۬ۦۚۨۘۢۡۧۘۗ۟۟ۡۨۧۛۙۖۘ";
                    break;
                case 1558347987:
                    return null;
            }
        }
    }

    @Override // android.app.Service
    public void onCreate() {
        String str = "ۙۙۤۧۢ۟۟ۖۘۛۢۖۛۗۖ۬ۨۥۘۤۥۥ۬ۛۜۘ۬ۜۘۖۡۦۘ۬ۡۡۢ۟ۨۘ۟ۤۤ۫ۗ۟۠ۦۧۘۙۗۖۘۖۘۘۘۘ۟ۡۛۥ۠ۙۡۧۘۧۖۥۛۛ۫ۙۙ۫ۛۨۧۘ۠ۤۥۚۡۘۧۧ۫ۥۧۗ۫ۥ۟۬۫ۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 869) ^ 229) ^ 723) ^ 374) ^ 664) ^ 545) ^ 81) ^ 196) ^ 570) ^ 221) ^ 819) ^ 951) ^ 141) ^ 99) ^ 343) ^ 211) ^ 145) ^ 834) ^ 96) ^ 642) ^ 141) ^ 422) ^ 448) ^ 324) ^ 618) ^ 635) ^ 829) ^ 687) ^ 219) ^ 774) ^ 644) ^ 1688882121) {
                case -1851165714:
                    super.onCreate();
                    str = "ۙۙۢ۟ۦۡۘۦ۠ۘۘۡۦۖۛ۠ۖۖۧ۠ۚۧۥۘۨۛۙۡۗۢۥۙۨۚۡ۬ۢۦۡۘۖۛۦۡۧۚۛۡۧ۫ۢۙۙۖۖۦ۫ۜۚۦ۠ۦۧۢۙ۫ۨۢۗۥۧۜۘۡۗ۬۬ۘۢ";
                    break;
                case -1513237522:
                    this.ctx = getApplicationContext();
                    str = "ۡۙۖۘۖۥۜۛۘ۟۟۟ۗۥۤۦۛۗۗ۫ۧ۟ۚۦ۫ۨۦۘۘ۟ۖۜۘ۠ۖ۟۟۬ۡۗۥۧۘ۫ۙۥ۠ۡۥۘۥۘۥۘۧ۬ۦۘۦ۫ۖۘۛۡ۫۟۫ۗۙ۫ۦۘۗۙۡۢۚۨ۟ۥ۠ۜۡۘۗۦۙۗۤۛۙۢۜۘۗۤۚ۟ۘۥۘ";
                    break;
                case -1491967635:
                    configureAutoSettings();
                    str = "ۦۘۖۘۜۙۢۙۖۤۥۨ۠ۢۖۧ۬ۙۚۡ۟ۧۡ۠ۘۤۦۤۛۥۨ۫ۨۥۖ۬ۚۘۛۚ۬ۖۘۧ۠ۡۤۥۥۢۜۗۜ۠۬ۗ۟ۖۘۦ۠ۗۜۖ۫ۗۧۡ۟ۖۚ۬۫۠ۖۚۙۧۜۘۘۧۘۦۛۡۦۤ۬۠۟ۖۘ۠ۥۘۘۚۘۚۥۖۜۘۙۨ۠ۢۡ۬ۧۨۛۦۡۜۙۖۗۤۛۦۛۘۥ";
                    break;
                case -1247272179:
                    return;
                case 254951989:
                    str = "ۚ۫ۛۢۙۡۘ۠ۖۤۦۜ۠ۚۨۜ۠ۘۡۘۦۗ۠۫ۥۨۢۦۗۚ۫ۗ۬ۙۚۖۧۖۤۛۚۤۨۘۦۢۢۢۗۙۖۜۧ۫ۘۖ۠ۜۘۘ۟ۖۡ۠ۦ۬ۨۗۧۤۚ۫ۛۨۙۢۘۘۙ۫ۡۤۚ۫ۡۨۧۘۤ۫۟ۘۖ";
                    break;
            }
        }
    }

    @Override // android.app.Service
    public void onDestroy() {
        String str = "۬ۚۙۥۦۥۗ۫۫ۦ۬ۚۢۥۦۢۥ۫ۛ۠ۛۙۘۗۖ۫ۖۘۙۦۦۘۗۨ۬۠ۜۚ۟ۨۥۘۛۨ۟ۛۙۦۘۘۙ۫ۥۡۜۘۨۥ۟ۡ۠۫ۜۦۥۘۢۚۦۘۦ۫ۦۛۦۦۦۗۧ۫ۧۖ۠ۡۖۛۧۦۘۤۖۙۛۖۦ۟ۛۥۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 63) ^ 270) ^ 702) ^ 594) ^ 498) ^ 933) ^ 453) ^ 943) ^ 910) ^ 846) ^ 953) ^ 236) ^ 964) ^ 388) ^ 925) ^ 371) ^ 907) ^ 382) ^ 385) ^ 243) ^ 361) ^ 623) ^ 386) ^ 213) ^ 385) ^ 813) ^ 583) ^ 316) ^ 63) ^ 45) ^ 748) ^ 301812118) {
                case -1335997999:
                    return;
                case -729014062:
                    super.onDestroy();
                    str = "ۖۗۦ۬ۚۙ۫ۧۖۘ۫ۡۨۘۢۢ۫ۦۦۘۦۧۦۘۨۖۥۚۖ۫ۢۡۤ۟ۨۤ۬ۘۜۙۖۜۘ۫ۜۦۘۖ۟ۥ۬ۛۤ۬ۤۡۚۥۨۦۥۢۢ۬ۚۢۢۙ۬۬ۖۘ۠ۤۨۗۤۗۤۖ";
                    break;
                case 590016023:
                    stopService(new Intent(this.ctx, Overlay.class));
                    str = "ۙۚۦۘۡ۬۫۠ۢۖۘۤ۟۠ۙ۟ۚۧ۫ۖۘۜۚۛۙۨۨۘ۬ۗۙۢۦۥ۫۟ۘۖۜ۠۫ۖۗ۠۫ۚ۫ۡۖۘۗۡۡۦۧۜۡۧۘ۟ۘ۬ۛۨۦۘۤۜۨۘۗۗۧ۫ۧۥۘۦۡۢۚ۟ۙ۠۟ۜۘۨ۟ۢ۟ۦۥۨۢۜۘۗۦۘ";
                    break;
                case 1274999447:
                    str = "ۚۤۛۚۢۚۤۨۥۨۛۤۘ۫ۙ۠ۢۢۡۖۡۘۖۧ۬ۡ۠۫ۘ۬ۧۘۘۥۨۛۙۢ۠ۡۢۨۡۖۜۘۨ۟ۦۥۙۚۘۘۘۧۙۚ۫ۡۘۦۧۖۘ۬ۦ۬۫ۨۘۢ۠ۘۘ۠ۡۨۘۙۨۙۙۥۢۡ۬ۥۗۚۡۘۗ۬ۥۘۦۚۨۘۗ۟۟ۗۨۘۙۘۦۥۧۥۢۥۦۘۤۛۨۘۡۙۧۥۤۘۘۚۤۥ۫ۡۢۡ۬ۨۘۤۘۛۖۙۜۡۥۜ";
                    break;
                case 1444411665:
                    StopAimFloat();
                    str = "۟ۤۧۖۛۖۚۢۡۥ۬۫۫ۛ۫ۥۦۘۥۨ۬ۖۚۤۡ۟ۤۛۙ۫ۛۥ۬۬ۧ۠۠۫ۥۘۙۗ۟ۧ۠ۖۘ۬ۢۘ۟ۤ۬۟ۚۡۘۙۤۧۙۙۚۡۡۘۤۘۥۥ۫ۜۧۡۘ۟ۛ۟ۡ۬ۥۘۙ۬ۜۨۖۘ۫ۡۦۘۖۡۛ";
                    break;
                case 1887888634:
                    StopAimBulletFloat();
                    str = "۟ۦۖۘۚۨۘۙۚۘۘ۠ۘۗ۟ۦۡۘۗۡۙۤۚۡۘۗۖۛۚۤۥۨۛۢ۫ۡۜۙۜۛۖ۠ۘ۬ۜ۠ۤۖۡۤۦ۫ۤۡۚۨۧۙۤۗ۟ۤۜ۫ۡۨۘۚۗۦۘۢۨۖۖۤۜ۟۫ۨۘۗ۫ۡۘۨۦۘۘ۬ۦۘ۫۠ۥۘۦۚۚۖ۬ۖۦۛۖۘۗ۬ۘۚۖۥۘۜۘۜ";
                    break;
            }
        }
    }

    @Override // android.app.Service
    public int onStartCommand(Intent intent, int i, int i2) {
        String str = "ۜۢۨۘۜۥۜۢۦۦۦ۠ۥۘۖۚۦۘۥ۫ۡۘۙ۬ۗۥۢۥ۫ۘۘۘ۬ۨۚ۫ۖۦۨ۟ۦۧۤۖ۫ۖۤۧۦۦۘۚۜ۬ۡۛۘۘۡۜۢۘۗۡۘ۟ۚ۬ۛۗ۬ۚ۫ۘۘۦۥۜ۟ۧۗۡۢ۟ۧۢۨۘۖۙۖۘۦۘۜ۠ۥۘ۠ۚ۟ۥ۬ۦۘۖ۫ۦۘۛۜۘ۬ۥۙۨۖۙۗ۟ۜ۬ۚۨۦۘۤۧۧ۬ۧۢۨۛۛۖۘۚ۫ۜۘۗۤۛۤۡۘۦۘۥۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 320) ^ 860) ^ 687) ^ 634) ^ 72) ^ 245) ^ 108) ^ 861) ^ 977) ^ 656) ^ 712) ^ 710) ^ 654) ^ 938) ^ 81) ^ 894) ^ 788) ^ 910) ^ 869) ^ 704) ^ 687) ^ 266) ^ 26) ^ 562) ^ 439) ^ 730) ^ 288) ^ 131) ^ 128) ^ 792) ^ 103) ^ (-2120565748)) {
                case -1867817733:
                    str = "ۚۗۧۘ۟۬ۤ۠ۧ۟ۦۘۥۘۡ۟ۚۗۖۤۙۨۥ۬۠۬۬ۧۡۙۢ۠ۨۘۜ۬۬ۛۜ۬۫ۧۙ۟ۦۙ۫ۡۘۤۜۙ۟ۥ۟ۤۗۛۦۜۙۤۧۛ۬ۨۛۗۨۤۤ۠ۛۜ۫ۧۙۘ۫ۧۢۢ۫ۦ۠۟ۜۘ۫";
                    break;
                case -1655747768:
                    configureAutoSettings();
                    str = "ۗ۫ۦۘ۠ۘۘۨ۬ۖۘۧۗۥ۠ۡۜۜۡۦ۬ۚۤۥۖۙۛ۟ۨ۫۬ۖۘۥ۟ۡۘۡۗۡۦۡ۠ۦۛۛ۟ۡۙۥۖۖۙۖۡۜۦۖۧۘۡ۬ۥۘۥۛۙۢۤۨۨۘۡۘۧۗۚ۠ۗ۬ۥۧۜۗۧ۠ۙۤۚۛۙۜ۟ۖۛۡۧۘ۟ۤۛۧ۟ۨۘۥۦۨۢۧۖ۟ۦ۬ۧۜ۫ۨۙۥ۠ۦۥۦۨۧ";
                    break;
                case -1631802656:
                    str = "ۦ۫ۧۦ۫ۙۥ۫ۙۚۧۛ۫ۥۥۘۙ۠ۚۧۦۦۘۘۧۜۦۢۦۚۘۥۘ۠ۤۜۘۢۛۨۘۗۘۘۘۜۤ۬ۥۡۡۢۨۘ۬ۡۦۘ۠ۜۙۚ۫ۢۢۨۘۡۘۧۘۚۛ۬ۙۡ۟ۚۦۗۖۙۨ۟۬۫ۡۖۦ۫ۢۤۚۚ۠ۘ۟ۦۘ";
                    break;
                case -1578763348:
                    str = "ۨ۟۟ۨۡۘۘۡۨۚۛۡۡۖۨ۠ۜۤۖۘۗۨۖۗۖۡۢ۠ۥ۟۟ۥۛۜۘۥ۟ۗۛۨۧۘۤ۫ۡۜۖۖۘۜۦۚۚ۬ۖۛۡۦ۫ۢ۬ۘۖۨۘۨۜۦۘۢۖ۬ۛ۫ۦۚۜ۬ۜ۬ۧۚ۬۠۠ۡۡۦۚۘۘۘ۠ۜ۬ۜۖۜ۟ۧ۫ۙۥۘۜۜۖۘۨۤ۫ۥ۠ۡ۟ۜۘۥۜۥۘۢۗ۠ۤۙۥۘ۟۠۫";
                    break;
                case -864273407:
                    return 1;
                case -513987352:
                    str = "ۤ۟ۥۘ۬ۥۧۦۙۢۘۤ۠ۦۖۘۘ۫۫ۛ۠۫ۖۚۗۚ۠۬ۛۡۧۘ۫۠ۢۘ۟ۢۧۗ۬ۥۥۙۥۚۘۡۗۡۡۙۘۘۛۦ۬ۖ۫ۜۙ۟ۥۘۖۤۜۛۗۢۙۖۗۜۧۡۗ۫۠ۨ۫۬ۙۥۘۨۗ۫ۖۗۥۘ۠ۗۨۘۧۙۘۘۢۤۨۨۗۦۘ۠۟ۥۘۧۘۡۘ";
                    break;
            }
        }
    }

    public native void recoil(int i);

    public native void recoil2(int i);

    public native void recoil3(int i);

    public native void setLineColor(int i, int i2, int i3, int i4);
}
