package kentos.loader.floating;

import android.app.Service;
import android.content.Context;
import android.content.Intent;
import android.graphics.Canvas;
import android.os.Build;
import android.os.IBinder;
import android.view.ViewConfiguration;
import android.view.WindowManager;
import androidx.constraintlayout.solver.widgets.Optimizer;
import androidx.core.view.InputDeviceCompat;
import androidx.core.view.PointerIconCompat;
import androidx.recyclerview.widget.ItemTouchHelper;
import com.google.android.material.internal.ViewUtils;
import java.io.IOException;
import kentos.loader.activity.MainActivity;
import kentos.loader.utils.FLog;
import kentos.loader.utils.FPrefs;
import org.lsposed.lsparanoid.Deobfuscator$$app;
/* loaded from: classes2.dex */
public class Overlay extends Service {
    public static Context ctx;
    private Overlay Instance;
    private ESPView overlayView;
    private WindowManager windowManager;

    static {
        try {
            System.loadLibrary(Deobfuscator$$app.getString(-3440722052542979913L));
        } catch (UnsatisfiedLinkError e) {
            FLog.error(e.getMessage());
        }
    }

    private native void Close();

    private void DrawCanvas() {
        int i = 0;
        int i2 = 0;
        WindowManager.LayoutParams layoutParams = null;
        String str = "ۡۧۢ۫ۘ۠۟ۢۚۧۗ۠۠ۖۥۘ۫ۚۡۘۤۗۖۢۧۡۥۦۨۘ۬ۘۡۥۥۖۘۚۤۗۜۛۧ۟ۦۙ۫ۨۦ۟۠ۦۙۥ۬ۙ۬ۨۗۥۜۘۙ۬ۖۖۡۘۘۤۘۧۥۗۥۘۧ۠ۘۗۢۥۘۖ۫ۙۘۡۦۘ۠ۗۘۘۤ۫ۙۡۨۧۜۢۗۙۨۛۜۙۨۚۚ۠ۧ۟ۨ۟ۛۧۚۤۙۤ۬۫۬۠ۛۘۥۡ";
        int i3 = 0;
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 311) ^ 36) ^ 273) ^ 487) ^ 716) ^ 948) ^ 816) ^ 329) ^ 496) ^ 702) ^ 65) ^ 536) ^ 473) ^ 411) ^ 482) ^ 211) ^ 324) ^ 619) ^ 771) ^ 939) ^ 749) ^ 759) ^ 532) ^ 116) ^ 456) ^ 221) ^ 502) ^ ItemTouchHelper.Callback.DEFAULT_SWIPE_ANIMATION_DURATION) ^ 792) ^ 509) ^ 454) ^ (-667318754)) {
                case -2056141476:
                    layoutParams.x = 0;
                    str = "ۙۥۧۧۘۥۘۥ۫ۢ۬ۖ۟ۡۨۦۦۥۤۧ۫ۚ۠۫ۘۘ۫۬۫ۧۧ۟ۤۥۡۥۤۗۗۗۤ۠ۖۨۜ۬ۥۘۡۢ۟ۥۧۢۛ۠۫۟ۨ۟۠ۛۥۜۢۡ۟ۖۤ۬ۘۘۘۦۙۚ۫۫۫ۜۗۡۙۧۙۨۖۘ۫ۘۡ۬ۖۘ۠ۧۦۦۢۖۘۘۜۛۦ۟۠ۥۡۤۥۚ۫۫۠ۘۘۤ۬ۦۘۨۜۡۘ۟ۙ۟ۥۤۘ۠ۦۥۘۖۨۨۘۗۜۖۘ";
                    break;
                case -1999511858:
                    String str2 = "۫ۙۛۧۗۖۘۜۘۖۘۡۨۧۢۡۤۖۜۦۨۛۗۖۡ۠ۨۨ۠ۤۢۜ۠ۥ۫ۡ۟ۦۘۦۛۖۖۡۡۘ۫ۨ۠ۜۛۥۥۙ۫ۤۨ۟ۨۥۢ۠۠۠ۖۖۦ۫ۢۡۘۗۡۥۢۥ۬ۡ۫ۦ";
                    while (true) {
                        switch (str2.hashCode() ^ 1008239689) {
                            case -1974530110:
                                str2 = "۬ۘۖۧۡۘۘ۠۬ۡۘ۠ۨۨۘ۫ۘۡۘۖۤ۠ۚۛۘۥۚۜۘۥۜۦ۬ۗۦۘ۠ۧۛ۟ۚ۠ۘۦۢ۫ۚۡۦۙۥ۠ۛۡۘۙۜۙۖۗۥۜ۬ۡۘ۬۟ۗۦۨۦۡۘۦۤۛۦۘۗۛ۟ۗۡ۫ۜۨۜۖ۫ۜۘۖۢۧۨۨۘۧۛ۬ۗ۫ۖۘۖۡۦۘ۟ۨ۠۠۟ۘۘۖۦۙۧۧۨۗۖۤۘ۫ۚ۟ۖۤۗۚ۬ۖۥ۠ۙۗ۬ۤۦۘۧۧۢ";
                            case -214022079:
                                str = "ۧۡۧۗۥ۬ۚ۟ۜۜ۠ۧۖۜۡۢۧۦۥۤۢۧ۟ۡۘ۟ۜۘۤۙۥۘۖۦۘۘۜۖۘۘۨۡۧۘ۟ۦۡۚۚ۠ۚۧۢۢۢۗۢۙ۟ۚ۬ۨۨ۠ۡۘۙ۟ۖۨۗۜۘۡ۠ۚۥۥ۬";
                                continue;
                            case -22069889:
                                str = "ۘۨۥ۫ۜۢۦۙۖۘۜۡۥۘۧۡۡ۬ۤۥۚ۠ۘۗۜۥۛۘۗۦۚۘۖۢۗۦۧ۟ۦۡۦۘۘۡۧۘۨ۟ۜۘۚ۫۬۟ۜۧۢۗۛۙ۟ۤۘۧۘۧۧۚۦۥۙۡۧۜۘۢۧۢ۠ۜۡۗۚۨۛۘۘۙ۠۠ۢۜۘۧۜۖۘ";
                                continue;
                            case 78351103:
                                String str3 = "۫۠ۙۤ۟ۢۚۜۧۛۘۡۚ۠ۤۨ۟ۖۥۥۧۘۗۜۨۧۘۥۖۜ۟ۖۦۨ۫ۨ۠ۢ۠ۜۙۦۗۦۘۜۖۥۥۦۢۜۘۥۗۙۢۘۥۘۙۜۚۘۖۧۛ۟ۦۨ۫ۨۦۦۗۨۥۘۘ۠ۡۡ۠۟ۢۤ۫ۦ۫ۗۥۘۚۘۜ۫ۤۗۜ۠۬۫ۦۗ۫ۧۖ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-1935816349)) {
                                        case -1339564630:
                                            String str4 = "۫۫ۢۚ۬ۥۘۖۧۨۧ۠ۤۤۨۨۘۢۖۘ۫ۧۢ۫۟ۥۘۖۗۘۢۦۜۘۦ۠۫۟ۜۧۘۥۚۢ۠۠۬ۛ۬۟۠ۧ۫ۥ۠ۦۧۜۡۘۢۙۨۘ۬۟ۖۘۛۖۦ۠۟ۦۙۦۖۜۡ۫ۡۖۜۘ۠ۢۜۘ۟ۚۥۤۘ۫ۚ۫ۚ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-788562939)) {
                                                    case -999885485:
                                                        String str5 = "ۡۜۡ۟ۗۘۘۡۡۧۙۦۦ۟ۚۖۜ۬ۖۘ۠ۥۧۘۧۖۚۖۛۗۦۤۖۘۖۦۘۧۨ۠۟۫ۥۢۤۖۘۗ۟ۘ۠ۗۡۛۚۚ۟ۜۗ۟۫ۜ۬ۡۜۘۙۚۗ۬۫ۨۘ۫ۤۢۘۘۗۧ۠ۛۦۡۘۨۖۧۘ۠۫ۚۤۨۛ۟ۡۗۖۛۖ۫ۖۦۘۤ۟ۛۡۛ۠ۢۦۧۘ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ (-594626385)) {
                                                                case -1234371211:
                                                                    str4 = "ۗۜۜۛۜۖۘۛۜۘۖۦۡۥۛۨۘۜۛۥۘۘۜۘۘۧۛۗۜۡۨۢۜ۫ۧۥۖ۬ۖۚۡۥۛۢۨۛۢۦۦۤۗۧ۟۫ۦۥۧ۠ۛۤۘۘۧۤۙۧۖۧۘۜۡۜۘۥۦ۟۠۫ۘۡۨۡۘۖۨۘۛۡۘ۫ۖۘۢۜۦۨۦ۟ۥۢۖۥۛۦۘۜۚۗۦۗۖۛۤۘۥ۟ۙ۫ۜۧۙۢۘۘۙۖۖۛۖۦۘ";
                                                                    break;
                                                                case -831767468:
                                                                    str4 = "ۘۖۜۘ۫ۧۘۘۢۥۖۘۧ۠ۘۚۛ۫ۢۘ۟ۡۜۘ۠ۢۗۨۘۘۧ۬ۦۛ۠ۜۖ۠ۦ۬ۖۨۘۛۥۙۙۙۢۘۥۜۘۧ۫ۘ۠ۥۧۘۘ۟ۗۤۘۘ۫ۧ۫ۘۘۦۘۨۢۗۥ۟ۚۨۛۨۚۤۜۘۧۘۨۡۧ۟۬ۡ۬ۚ۠ۤ۟ۡۖۘ۟۬۟ۛ۠ۧۛ۫ۜۗ۫۟۬ۘۨۚ۠۫ۡۚۨۘۙۘۧۘۢۨۦۘۖۛۗ۫۟ۥ۠۬۬ۖۡۡ۠ۚ۫";
                                                                    break;
                                                                case -733221438:
                                                                    String str6 = "ۢۦۡۤۘۨۘۡۦۡۘۤۛۖۘۗۥۜ۠ۙۦۘۤۛۡۘۖۨۨۘۥۧۤۧ۫ۨۘۡۖۥۘۤۖ۫ۦ۫ۧۖۚۖۘۨ۠ۧ۟ۚ۠ۗ۠ۡۧۥ۠ۛ۬ۨ۫ۚۚۘ۠۬ۥۘۜۤۖۡۙۘۘۛۚۦۡۤۖۙۖۚۘۨۛ۠ۛۛۧۥۦۘ۬ۖ۟ۗۤۥۘ۫ۛۙۨ۬ۡ۫ۥۘۧۖۦۜۤ۟ۢ۟ۖ۟ۘ۟ۥۧ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ (-523959194)) {
                                                                            case -1351053068:
                                                                                str5 = "ۖۗۥۘۜۧۦۛۢ۬۫ۙۚ۠ۨۘۡۚۜۘۗ۟۠ۤۖ۫ۚۢۦۘۡ۠ۜۘۜۦۨۢۥۦۙۦ۠ۚ۠ۢ۬ۢۦۘۤۘ۠۟ۛۤۦۧۧۡۗۛۤ۠ۖۧۘۚۗۘۘۛۢ۠ۜۥۚۨۦۥۢۧ۟ۢۤۘۘۡۥۡۨۥۘۦۜۡ۫۟۫ۛۛۜۘۤۛۤۚۡۥۘۖ";
                                                                                break;
                                                                            case -445937221:
                                                                                str6 = Build.VERSION.SDK_INT >= 28 ? "۟ۧۘۘۦۙۢۦۨۛۧ۟ۙۨۨۛۧۗۥۛۛۤ۠ۢۨۤ۠ۛ۬ۡۙۨۡۖۖۦۨۘۨۜۘۢۢۘۘۨۗۨۘۦۦۡ۠ۢ۟ۙۡۤۘۚۦۘ۬ۢۤۖۥۧۘۧۙۦ۟ۤۨۘۨۘ۟ۥۙۦۘ۠۬ۡۘۢۙۘۤ۟ۢۜ۟ۜۘۨۛۦۘۧۙ۫ۧۖۜۘ۫۠ۨۡۤۛۨۢۖۗ۟ۗۤۡۖۜ۟۬۬ۧۤۖۦ۟ۜۤۘ۟ۖۜۘۛ۟ۜ۠ۚۜ۫ۙۙ" : "ۧۡۡۘ۬ۚۥ۠ۥۙۜۛۖۧۚۖۨۛۡۘۨۨۗ۫۬ۜۡۦۚۦۘۥۦ۠ۖۙۘ۫۫ۡۘۖۛۧۗۤۢۧۙۘۘۦۜۚۘ۟ۤ۠ۜۛۡ۟ۚۚۜۘۘۨۙۡۙۡۘۧۙۘۘۦۤ۫ۙۨۨۖۖۘۢ۫ۧۤۙۘۘ۬۠ۥۗۖۚۙۤۦ۫ۡۧۦ۫ۢۦۜۨۘ۫۠ۙۚۙۘۡۜۛۥۜ۟۟۠";
                                                                            case -254280743:
                                                                                str5 = "ۚۛۡۙۚۗۡ۟ۛۘۘۡۘ۠ۙۙۜۥۛۙۨۜۤۘۡ۫۫ۙۘ۟ۖۘۧۛۛۚ۫ۜۛ۟ۚۙۤۡۘ۫ۤۥۤ۟ۗۛۨ۠ۨۨۜ۫ۦۨۨۡۥۘۙۧۜۘۨۦ۠ۘۖ۠ۧۘۢۖۧ";
                                                                                break;
                                                                            case 2134286465:
                                                                                str6 = "۬ۥۧ۟۬ۜۘۗۥۘۘۢۙۜۘ۫ۜۜۘۙۚ۫ۡۥۦۘۤۛۥ۬ۤۡۘۨۤۢۙۚۛۚ۟ۥۡۥۖۘۛۘۨۥۥۛۘۗۡ۠ۗ۬ۛۥۥۨۘۢ۬۟ۡۛۗۥ۬ۨ۟۠ۤۘۖۗۨ۫۬";
                                                                        }
                                                                    }
                                                                    break;
                                                                case 748758435:
                                                                    str5 = "ۢۛ۫ۤۖۢۦۗۧۗۖۘۘۧۡ۫ۚۙ۠ۜۚ۬۟ۡۨۘۧۙۤۘۢۥۦۥۤۨ۟ۥ۟ۥۖ۫ۜۖۘۚۛۤۢ۠۫ۖۤۘۘۖۚ۠ۤۡۥۘۨۗۧۡۢۧ۟ۡۥۘۚۛۜۘۘۤۥۘ";
                                                            }
                                                        }
                                                        break;
                                                    case -644787449:
                                                        str3 = "ۧۨۨۛۤ۠ۜۗۖۘۡ۟ۢۙۚۡۘ۬ۢۥۡۧۧۜۗۡۘ۠ۦ۠ۖۢۗۧۢۥۜۡ۟ۤۙۥۧۖۦۢۜۤۨ۫ۢ۟۟ۤ۠ۖۘۡۜۥۘۘۨۘ۬ۥۨ۫ۚۦ۠ۜۛ۠ۙۢۤۖ۟ۧۧۦۦ۟ۛۜ۬ۙۢ۟ۖ";
                                                        break;
                                                    case -221037038:
                                                        str3 = "۫ۦۨۘۤۗۖۘۙۥۤۖ۬۬ۢۗۜۨۘۥۘۦۙۡۘۥۧۦۖۖۧۘۤ۫ۨ۬ۗۘۗۙۦۦۦۜۘۘ۬ۡ۫۬ۖۘۥ۟ۖۘۜ۠ۚۨۙۦۖۧۜۘ۫ۛۛۙ۫ۙ۟ۢ۬ۦۖ۫ۡۖۤۚۙۘۙۨۘۙ۫ۤۜۤۧۗۧۥۘ۬۟۬";
                                                        break;
                                                    case 2026713765:
                                                        str4 = "ۜۙۖۢۢۜۘۗ۬ۛۦۥۤ۫ۦۘۛۜ۬ۙۖۙۚۧۙۛۥۥۤۗۖۤ۫ۚۥۖۥۥۦۦۛ۟۫ۘۘۘۛۗۦۤۖۘ۫ۜۛۤۥۥۤۡۤۖۡۦۘۤۥۥۢۨۡ۟ۚۜۘۚۤۢ";
                                                }
                                            }
                                            break;
                                        case -1238870376:
                                            str2 = "ۛۛۦۘ۟ۡۖۘۦۥۦۘۥۙۚۢۘۛۨ۠۫ۤۖۘ۬۫ۚۡ۬ۡۘۢۚۡۘۗ۟ۦۙۢ۟۠ۨۜۧۨۘۦۦۡ۟۬ۧۧۡۨ۟ۜۘۜۢۜۤۛۨۘۘ۬۫ۥۤۥۘۘۢ۫ۚۘۧۘۦ";
                                            break;
                                        case 158474879:
                                            str2 = "ۥۗۥ۟ۡ۟ۧۛۦۘۢ۠ۚۧۡۡۘ۟۟ۧۘۦۙۙۜۘۧۙۖۘۢۜۦۘۘۨۢۗ۫ۘۘۥۛۛۚ۠ۨۘۦ۠ۤۨۛۙۛۗۢ۫ۚۖۙۗۧۙۥ۟ۜۙۘۘۖ۠ۜۘۛۙۨۚۖ۠ۙۤۗۛۙ۟ۥۢ۠ۘۘۧۧۢ۠ۡ۫۟ۥۡۘۘۖۥ۟۬ۘۘۖۦۘۦۥۗۨ۫ۤۦۢ۠۠ۦۨۘۢۢۧ۟ۧۥۘ";
                                            break;
                                        case 1510119576:
                                            str3 = "ۗۡۦۧۛۨ۫ۥۗۦ۟ۛۨۢۡۘۡۜۡۧ۠ۙۙۦۘۗ۟۫۬ۨ۟ۤۜۚۙۜۛۛۡۖ۫ۦۖ۠۫ۚۧۜۧ۬ۚ۫۬ۖ۠۬۠ۨۚۨۚۨۙۨۘۧۘۚۢۛۨ۠ۥۗۘ۠۬ۨۙۡۘ۟۠ۘۘ۬۟ۖۢۤۖۙ۫۫۫۟ۘۘۜۥۘۘۚ۟ۢ۫۫ۨۢ۟ۘۘ۬۬ۖ۟ۘۖۘۖ۫ۡۘۜۨ۠ۧۢۡ";
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case -1465202766:
                    i = 2038;
                    str = "۠ۗۡۘ۬ۛۘ۟۠ۖۡۘۘۘۛۚۖۧۥۘۘۘ۠ۡۨۙۦ۠ۡۘۖۜۛۨۥۤۦ۬ۤۜۧۘۨۖۦۥۗۧۢۦۢۨۙ۠ۢۨۘۢۖۨۘۛۧۛۤۜۘۛۢۛۨۧۘۦۖ۠ۙۧۥۢ۫ۖ۠ۗۚ۫ۨۢۥۨۛۨ۫ۜ۠ۨ۠ۖ۬ۗۡۨۥ۠ۧۜۘۢۘۘۛۧۦۜۨۘۤۙ۠ۖۜۘۦ۠ۥۘ";
                    break;
                case -782932943:
                    layoutParams.gravity = 8388659;
                    str = "۬ۡۚ۠۫ۨۢۘۤۡ۬۫ۗۚۥۜۥۙۘۥۘ۬۟ۜۘ۫ۡۛ۟ۦۚ۫ۥۨۦۤۙۤۢ۟ۨۧۚ۠ۖۜۨ۟۠۫ۚ۠ۛۜۘۦ۫ۨ۫ۖۚۥۢۧۦۘۥۘۡ۠ۨۨۙۖۧۚۚۙۖۘ۠ۚۜۚۡۨۘۛ۫ۗۜۜۛۧۦۥۘ۫ۧۥۘۚ۬ۚ۠ۜۢۦۥۥۗۘۦۘۗۨ۟ۦ۟ۛۦۢۖۘ۟ۙۙۖۜۡۘ۬ۙۡۤ۟ۖۥۤ۫ۧ۠ۙ";
                    break;
                case -638670070:
                    str = "ۡۚۢۛۘۧۖۙ۠ۖۨ۫ۛۦ۠۠ۡۦۗۡۗۖۗۦۘۡۘۗۘۘ۬ۢ۫ۨۦۙ۫ۧۨۜۧ۠ۨۤۡۘۡۦۡۘۤۘۘۦۜۗۢۛۤۨۚۘۘۛ۬ۜۡ۫ۙ۬ۘۡۧۨۚ۫ۡۘۘۚۧ۬ۥۘۢۘۢۜۧۥۘۦۢۗ";
                    i2 = i;
                    break;
                case -343076973:
                    this.windowManager.addView(this.overlayView, layoutParams);
                    str = "ۦۘۗۨۜ۫ۨ۬ۖۘۧۤۥۧۛۤۨۙۡۘۛۦ۟ۦ۠۬ۢ۬ۘۘۡۧۖۘ۟ۙ۬۟۬ۙۗۤۡۘۨۡ۟ۗۢۦۘ۬ۤۦۗۢۦۖۖۖۦ۬ۖۘ۬ۖۘۘۗۢۨ۫ۚۥۘۙۜۚۨۜۡۦۖ";
                    break;
                case -138327147:
                    str = "ۡۜۦۘۘۢۧ۫ۢۖۘۖ۠۠ۢۛۥۢۙۛ۠ۡۛۦۖۥۘۙ۠ۨۙۚ۫۟ۗۢ۟۫ۗۗۥۛ۬ۙۢۨۨۢ۠ۦۘۡۨ۠۬ۤ۠ۛۘۤۥۡۘ۟۫ۚۧۤۡۥ۠ۚ۟ۨۥۘۨۦۤۤۛۨۧۛ۫ۛ۫ۖ۠ۖۥۗۨ۬۟ۗ۟ۦۛۡۘۢۘۜۢۗۘۘۤۧۜۧۙۡۚۘۘۧۚۘۘۛۗ۬ۘۡۨۘۚۦۗۖۗ۟۠ۤۧۙۢ۫ۗ۟";
                    layoutParams = new WindowManager.LayoutParams(-1, -1, 0, getNavigationBarHeight(), i2, 1304, 1);
                    break;
                case 492609030:
                    layoutParams.layoutInDisplayCutoutMode = 1;
                    str = "ۘۨۥ۫ۜۢۦۙۖۘۜۡۥۘۧۡۡ۬ۤۥۚ۠ۘۗۜۥۛۘۗۦۚۘۖۢۗۦۧ۟ۦۡۦۘۘۡۧۘۨ۟ۜۘۚ۫۬۟ۜۧۢۗۛۙ۟ۤۘۧۘۧۧۚۦۥۙۡۧۜۘۢۧۢ۠ۜۡۗۚۨۛۘۘۙ۠۠ۢۜۘۧۜۖۘ";
                    break;
                case 708189624:
                    str = "ۛۧۘۛۡۖۙۤ۬ۘۦ۫ۛۘۛۤۙۛۙۦۚۡ۠ۜۥۡۦۤۛۥۘۦۡ۫ۘۛۡ۟۬۠ۜۙۡۤۘۘۨۗۚۦۗۤ۟ۘۚ۠ۘۨۘۛ۟ۢۜۗ۬ۛ۬۟ۖۗۖۘۜۘۘ۫۠ۜ۬ۖ۠۟ۚۛۙۤۧ۟ۜۤۤۥۤۖۙۤۧۙ۟ۧۙۥۘۙ۟ۚۛۧۥۡۥ۠۫ۥۜ۫ۖۤۗۡۚ۟ۡۖ۫ۤۘ۟ۖۘ۠۫۠ۦۗۜۤۙۨۘ";
                    break;
                case 720261429:
                    HideRecorder.setFakeRecorderWindowLayoutParams(layoutParams);
                    str = "ۙۖۤۛۥۥۘۚۗۡۘ۠ۦ۟ۥۤۧۚ۬ۜۘۦۚۤ۟ۚ۬۟ۤۧۡۥۧۘ۠ۤۥۘۧۚ۟ۗۤۡۚۖۜۦۧۚۛۦ۠ۖۥۘۘۜۡۚۨۜ۬۠ۘۢۤۖۚۖۡ۠۠ۚ۬ۚۙ۬۠ۜ۬ۦۜۥۢۘۛۡۖۢۢۘۙ۬ۜۦ۠ۦۘۜۚۚۥۤۖۘ۬ۚۛۙ۫ۥۘ۬۫ۦۜ۬ۨۧۧۛ۠ۨۘۘۛۜۙۥۢۥۖۖ۫ۖۥۥۘۧۨۥۘ";
                    break;
                case 773077998:
                    return;
                case 929384621:
                    str = "ۙ۟ۥۘۡۨۛۗۘۖۤۚۨۘۖۡ۬ۧ۠ۥۡۜۘۤۡ۬۬ۦۨۜۦ۟ۘۤۦۘ۬ۙۖۘۢۧۜۘۘۧۖۘۢۗۢۛۗۘۚ۟ۡۘۨۚۛۡۘ۬ۡ۬ۘۜۡۘۛۛۢ۬ۢۘۘۗۘۡۘۦۡ۫ۨۜۜۘۜۥۘۦۙ۠ۢۖۥۘۢۙۥۘۙۖۘۢ۫ۡۘۨۚ۠ۢۚۡۤۜۘ۟ۖۗۗ۠ۜ۬۠ۡۘ۠ۧۖۗۙۨۚۤۖۧۢۜۘۖۖۚۤۤۡۧۧۘ";
                    i2 = i3;
                    break;
                case 1107555352:
                    String str7 = "ۙۜۖۦۥۧ۬ۖۤۥۙۚ۟۠ۨۛۧۨۘ۟ۙۦۘۙ۬۟ۛۢۛ۠ۨۜ۟ۙ۟ۦۛۡۙۡۗ۫ۨۦۨۛۥۘۜ۟ۥۘۤۡۘۘ۬ۛ۫۟ۨۜۨۥ۠ۡۦۘۙ۫ۚۤۜ۫ۚۡۦۢۜۜۘۨ۠۫ۥۙۗۦۡۨ۟۫ۛ۫ۥۖۘ۫ۢۖۜۢۖۘۢ۫ۙۡۢۤۨ۟ۥۦۤۚۜۘۖۖ۟ۢۚۛ۬ۘۨ۬ۦۙۦۘۘۜۜۘۚۥۚۤۨۘ";
                    while (true) {
                        switch (str7.hashCode() ^ (-2083835005)) {
                            case -65574436:
                                str = "۫ۥۜۘۢۗۜۘۖۛۜ۠ۤۥۘۖۚ۠ۘۘ۬۫ۖۚ۟ۢۖۛۤۤۧۤۛۦ۫ۜۡۨ۫ۛۦۨۘۧۗ۫ۦۗۗۛۥۘۨۤ۬ۥۨۘ۟ۙۥ۟ۨۗۖۖۖۦۦۨۜ۟۬ۢۨ۟ۡۜۥۘۦۨۦۘۤ۫ۖۤۤ۠ۦۧۘۤۙۡۘۨۤۨۘۜۤۢۜۚۦۘۗ۟ۚ۫ۙ";
                                continue;
                            case 1239679754:
                                String str8 = "ۢۛ۠ۛۢۡۘۙۚۨۘۛ۬ۨۘۘ۬۟ۜ۟۬ۗۢۛۧ۟ۦۘۤۗۗۨۥۦۙۛۙۢۧۥۘۤۖۧۗۙ۫ۜ۬ۨۘ۫۫ۦۘۧۡۨۙۧ۠ۖۦۗۗۢۚۤۢ۫ۧۨۗۚۦۘۛۛۘۘۗۜۨۘ";
                                while (true) {
                                    switch (str8.hashCode() ^ 292214378) {
                                        case -2087967253:
                                            String str9 = "ۚۤۡۘۨۘۦ۠ۛۦۚۘۙۡۧۜ۠۟ۧ۬ۡۖ۬ۘۘۚۧۘۘۦۖۛۢۛۥۗۨۛۢۚۥۘۙۙۘۗ۟ۖ۟ۖۨ۫۬ۦ۠ۘۥۘۢۨۙۙۖ۠ۛۗ۟ۜۡۘۛۚ۬ۤ۟ۨۚۨۧۘ";
                                            while (true) {
                                                switch (str9.hashCode() ^ (-1637754100)) {
                                                    case -1241753446:
                                                        str8 = "۠ۡۜ۫ۘۖۘۨۡۘۘۥۤۘۘ۬ۜۘۘ۬ۜۧۙۗ۫۫ۘۘۜۘۨۘۙۘۤۨۥۨۢۜۨ۫ۨۘۙ۟ۡ۠۠ۛۜۧۛۧۡۦۤۨۧۚۘۘ۟ۦۖۧ۬ۡۗۗۛۨۨۘ۬۟ۢ۬۬ۧۥۖۦۘۤۥۨۨ۫۠ۨۙۜۡ۫ۡۘۘ۟ۘۘۨ۠۬ۡۘۖۘۖۧۖۘۖۗۜ۫ۘۛۗۦ۠ۡۧۚۜۧ۫ۢۥۦۗۚۛۜۦۘ۬۟ۛۨ۫ۦۘۧۨۛ";
                                                        break;
                                                    case -923461512:
                                                        str8 = "ۗ۠ۥۚۢۨۘۤۚ۠ۡۖۘۜۘۡۘ۫ۙۤۜۦۡۘۚۙۨۧۘ۟ۥۚۦۛۖۘ۟ۛۜۢۜۥۘۙۦۡۘ۫ۦۨ۫ۛۡۥۜۜۘ۬ۗۜۘۗۦۜ۬ۙۥۘۨ۬ۘۘۢۙۥ۟ۢۖۘۗ۠ۘۡ۠ۦۡ۫ۨۘۨۦۡۘۥ۬ۨ۬ۥۨۘ۬ۘۥ";
                                                        break;
                                                    case 337920117:
                                                        String str10 = "۠ۥۘ۫ۚۤۡۜۛۖۧۤۗۘ۠ۖۡۗ۟ۡ۫ۤۖۛ۫ۘۥۘۚۢۨۛۖۘۨ۠ۗ۟ۢ۟ۗۚ۬ۗۦۤۛۥۙۤۛ۠ۡۥۧۧۘۡۘۨ۠ۖ۫ۢۥۚۡۗۤۗۘۘۗۗ۠ۛ۟ۖ۠۫ۢۤۛ۟ۘ۫ۨۢۜۗۥۜۧۧۖۦۡۧۦۧۖۘ۬ۚ۫۟۟ۧ۟ۜ۟ۗۦۧۘۛۙۥۘۢ۫ۦۘۢ";
                                                        while (true) {
                                                            switch (str10.hashCode() ^ (-1811972025)) {
                                                                case -94799777:
                                                                    str9 = "ۘۙۨۢۗۖۘۛۚۡۘ۟ۘۢۚۤۛۚۡ۠ۢۨ۫۟ۧ۟ۤ۠ۚ۠ۤۘۥۛ۬ۚ۫ۨۘ۫ۖۦۜۧۙ۟ۖۦۘۤۨۢۨۙۖۘۗۖۧۧۙۢۜۧۥۙۖۡ۠ۧۚۖۜۧ۬۟ۛۛۘۘ";
                                                                    break;
                                                                case 213519709:
                                                                    str10 = "ۛۜۦ۠۟ۖۗ۬ۤۛۘۜۘۙۖۙۗۦۖۙ۠ۤۚۥۘۘۗۗۖۘۗۨ۬ۢ۬ۜۢۥۢۖۜۛۡ۬ۖۖۦۧۜۨۧ۫ۦۥۥۧۥۘ۟۠ۢۚ۟ۤ۬ۘ۠ۛۢۥۘۛۤ۟ۜۡۘۥۗۘۡۗۦۤ۫ۦۘۘۗۘ۟ۢۛۦ۫ۤۦۗ۟ۦۗۙ۠ۡۚۧۘۨۡۚۘۘۗۜۖۦۥ۬ۜ۫ۜۘۥۦۦۤۧۦ";
                                                                case 994387787:
                                                                    str9 = "ۢ۬ۤۥۙۚۧ۬ۗ۟۟ۜۘۧۚۥۘ۬ۖ۫ۥ۟ۘۢۘۘۗۘۥۘۢۢۡۘۦ۟ۚۗۦ۟ۢۘۧۤۥۧ۫ۙ۫ۚۖۧ۫ۘۚۤۥۛۗۤۧۨۨ۬ۡ۬ۘۥ۟ۖۨۙۖۘۨۨ۫";
                                                                    break;
                                                                case 1247072900:
                                                                    String str11 = "ۤۚۧۛۡۜۘۜۦۨۜۢۦۘۛۜۡۘۦ۫ۡۘۥۛۘۘۚۙۤ۬ۡۜۘۜۢۜۘۜۤۚۖۘۙۤۜۨۛۥۘۧۙۗ۬۟ۧۘ۟ۧۙۙ۬ۗۦۙۡ۠ۧ۫ۥۘۥ۬ۦۜ۫ۥۤ۟ۨۥ۠۠۬ۡ۠۟۬ۨۗ۬ۚ۟ۦۜۘ";
                                                                    while (true) {
                                                                        switch (str11.hashCode() ^ 1483210008) {
                                                                            case -1247425247:
                                                                                str10 = "ۥ۠۫ۛۥۡۢۤۘ۬۬ۛۜۘۧۘۖۦۦۡۡۨۘۥۤۘۖۡۘۖۥۚۦۤ۠ۗۧۧ۫ۖۨۘۢۛۘۘۤ۟ۘۘۘۖۜۘۧۖۙ۫ۘ۫ۗۢۥۤۘۨۘۢۡۡۘۤ۫ۛۨۘۖ۬ۜۨۘۘۙۜۘۨ۬ۥۤۖۖۨ۫ۡۛۗۥۜۡ";
                                                                                break;
                                                                            case -269512374:
                                                                                str11 = Build.VERSION.SDK_INT >= 26 ? "ۘۢۘۘۥ۫ۜۙۙۤ۫ۡۨ۠ۥۧۘۥۨۤۧۢۤۥۜۗۜۘۧۘۛۖۖۡۚۦۘۧۤۖۗۛ۫ۖۗۙ۬ۧۧۡۦۧۧۥۖۢۤۗۤۥۤۚۚ۟ۖۜ۠۬۬ۜ۟ۜۘۘۘۤۙۧ۟ۥ۠۠ۙ۬۠ۢۘۧۗۗ۟ۡۤۜ۬ۘۗۛ۟ۦۦۘۛۤۢۗۖۦ۟" : "ۥۚ۫۫ۗ۫ۤۛۢۢۙۨ۬ۢۚۗۥۦۘۢۥۤۥ۠ۖۘۖۜۘۘۨۧۘۘ۠ۗۡۥۙۗۛ۟ۖۘۜۜ۬ۜۢ۠ۨۖ۬۫۟۠ۧۡۗ۠ۨۘ۠ۡۗۢ۠ۙ۠۫۠ۡۧۦۡۜۥۘۧۡۥۘ";
                                                                            case 415435263:
                                                                                str10 = "ۢۚۖۘۤۥۥ۟۬ۘۘۧۥ۠ۦۦۜۘۤۖۢۛۜ۠ۥۖۧۛۦۚۦۗۥۘۡۧۙۤ۫ۙۡۚۧۙۜۢۦۧۘۗۜۖۘۗۜۦۚۤۖ۟ۨۛۢۨۦۙۘۥۨۖۛۧ۠ۥۘۙۖۜۘ۬ۗۡۨۗۗۜۙ۬ۧۥ۟ۨۙۗۤۚ";
                                                                                break;
                                                                            case 1137801787:
                                                                                str11 = "۟۠ۘۨۦۡۘ۬ۥۧۚۜ۟ۜ۟ۡۨ۠۠ۨ۠ۜۘ۬ۜۖۘ۬ۘۨۘۡۥۜۦۖۛۧۨۗ۬۬ۖ۠ۘۨۘۖۥۧۘۡۤۜۘۡۨ۟ۤۨۥۘۘۨۜۧۖۚ۫ۤۡۘ۬ۖۢۨۦۜ۬ۗۤۥۦۖۘۘ۟۠ۖۖۨۘۧ۬ۜۘ۠ۦۧۘۘ۫ۤۢۘۧۘ۟ۥ۠ۛۧ۠ۦۡۤۢ۠ۜۘ";
                                                                        }
                                                                    }
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 1013255548:
                                                        str9 = "ۨۛۘۢ۬ۦۖۖۜۘۢۢۜۜۜۖۘۗۗۙۡۙۡ۠ۡۘ۠ۢۥۚۖ۟ۛۡ۠ۤ۠ۜۖۢۧۜ۫ۨۘ۫ۚۘۖۦۘۘۨۘۚۡ۬ۨۥ۫ۤۘۢۤۜ۟ۙۘۨۜۘۧ۫۠ۙۗۜۨۚۛۢۡ۟ۥۖ۠ۙۢۖۧۧۗۢ۫۟ۡۧۨۘۤۨ۫۠ۘۜۨۢ۫۠۟ۥۙۢۥۛۦۧۘۦ۟ۛ۟ۖۛۘ۫ۡۘ";
                                                }
                                            }
                                            break;
                                        case 1411045315:
                                            str7 = "۟ۦۨۥۡۘۗۖۖۘۡۗ۟ۢۗۥۤۡۤ۫ۧۥۘ۠ۡۡۡۛۥۘۙۢ۬۫۟ۖۘ۠ۘۙۖۘۨۨۜۥۦۜۤۥۥۦۜ۬ۧۡۖ۬۫ۘ۠ۗۥۘۖۢۨۘ۬۫ۡۙ۬ۛۙ۫ۖۘۛۛۡۘۢۜ۟ۜۨۧۢۘۚۛۧ۬ۨۗۖۛۧۢۖۤۙۡۘۥۦۨۘ۫ۚۦۘۚۥۗۢۦ۫ۘۖۨۧۤۦ۫ۥ۬ۚ۫۫ۤۥۥۘ۬ۡۜۖۧۘۖۘۘ";
                                            break;
                                        case 1840875511:
                                            str7 = "۫ۦۘۘۡۤ۬۟ۗۘ۫ۜۘ۬۟ۦ۠ۨ۠ۖۛۙۛۜ۬ۜۘ۟ۜۡۘۛۥۡۘۢۛۗۛۘۧۘۦ۫ۙۖ۠ۜ۬ۨۡ۠۫ۥۜ۠ۦ۫ۖۥۘۢۘۘۛۖ۫ۖۥ۫ۜۘۘۚ۫ۡ۫ۜۤ۟ۙۚۙ۫ۧۘۥۧۨۦۦۥۘ";
                                            break;
                                        case 1945478677:
                                            str8 = "ۙۢۨۘۡۥۙ۠ۤۗۚۘ۬ۜۨۨۘۖۦۛۢۨۘ۬ۢۧۖۡۥ۠ۚۢۚۗۘۘۙۗۦ۫ۦۛ۫ۛ۠ۚۗۨۖۥۘۦۛۨۧۨۘۘۧ۫ۚۡۦۖ۟ۡۤ۬۫ۤۗ۬ۦۘۗۙۜۙ۬ۛۘ۬ۡۦۜۖۧۤۨۘۚۙۡۘۗۢۥۘۦۖۖۖ۫ۨۢۜۧۘۖۡۧۘۘ";
                                    }
                                }
                                break;
                            case 1980557417:
                                str7 = "۠۟۬ۦۤۦۘ۫ۨۦ۟ۧۤۙۚۗۚۥۘۦۤۧۚ۫ۥۘ۫ۢۘۛۡۥۘۢ۫ۖۘۢۜۥۖۜۜۘۦۗۦۦ۫ۡۘ۠ۦۜۘۚۤۦ۠ۘۗ۬۫ۘۘ۫ۦۜۘۡۥۢۙۦۧۘ۠ۗۦ۫ۧۧۜۡ";
                            case 2114143189:
                                str = "ۜۤۜۘ۫ۖۚ۠ۗۦ۟ۘۖ۬ۡۧۗ۫ۜۘۦۖۡۘۨۗۤۦۜۘۜۨۤۜۦۡۘۥۥۡۢۙ۟ۗ۬ۖ۬ۨۗۘۦۖۘۚۥ۟ۜ۟۫ۢ۬ۛۖ۬ۤۙۛۙۦۤۦۥۡۛۦۗۡۘۥۛۛۨ۠ۥۘۧۛۦۤۗۙۨۤۡۧۧۥ";
                                continue;
                        }
                    }
                    break;
                case 1166568693:
                    str = "ۗۥۦۥۙۘۡۗۛۛۘ۬ۧۖ۫۫ۧۦۜۘۜۦۙۤ۫ۛۖۗۡ۫ۢۙۘۗۛۛۦ۟۠ۙ۟ۧۛ۠ۥۧۘۙۜۙۥۙۧ۫ۚۨۘ۠ۚۚۜۧۘۥۨۘۢۨۙۗۙۡۘۛۙۡۤۜۛۥ۫ۘۚ۟ۥۘۧۨۨۤۗ۠ۦۥۛۧۧ۫ۙ۬ۖۘ۟۠ۧۤۘ۫";
                    i3 = 2006;
                    break;
                case 1332474808:
                    String str12 = "۟ۖۜۘ۟ۥۨۚۦۨۘۡۡۡۢ۬ۦۘۛۡۜۘ۠ۚۜۘۥۘۘۗۛۢۖۥ۠ۗۘۥۤۙۘۦۥۚۛۙۜۙۢۢۙۡۘۜۘۘۘ۫ۧۖۘۚۧۦۢۗ۟ۥۗۘ۠ۜۚ۟۟۫۬ۚۜۤۖۜۘۨۛۗۡۧۡۘۗۗۖۘ۟ۖۨۘۡ۬ۥۘ۫ۙ۬ۗۚۖۘۗۧۖۘۙۘۙۨۗۛ۠ۤۥۘۨۛ۟ۘ۟ۢۡ۬ۜۙۤۛۨۜۨۘۛ۬ۖۘۨۘۦۘۢۢۚۜۥۢ";
                    while (true) {
                        switch (str12.hashCode() ^ 1503956011) {
                            case -1938619968:
                                str = "ۢۥۧ۟ۚۥ۫ۚ۬ۤۗۥۦ۠ۘ۫۫۫ۙۛۘۡۡۘۛۚ۟۫۫ۜۘ۟ۘۗۢۚۦۘۗۧ۠ۘ۟ۨ۬ۢۥۘۘۦۨ۬ۢ۠ۖۘۛ۫۬ۧ۠ۢۘۤۖ۠ۨۡۖۘۡۢۘ۟۫ۥۥۗۤۘۗۨ۫ۤۖۙ۬۫ۖۡۨۘۥ۫ۧۧۗۦۘۚۖ۫ۜۛۢ۟ۢۥۥۗۘ";
                                continue;
                            case -688647140:
                                String str13 = "ۥ۠ۨۢۚۥۗۥۘۜۜۥۖۢۙۥۡ۟ۡۘۘۥۥۧۤۙۡ۠ۚۜۙ۬ۤۥۨۘ۫ۥۥۢۗ۫ۖۡۛۢۖۤۙۚۡۨۗۚۤۖۚۡۖۢۢۡۦۘ۬۬ۜ۠۫ۙۦۖۘۘۜ۠ۧ۬ۛۥۘۚۚۗۥۘۨۙۜۥۘۚ۠ۨۘۡۦۦۡۢۛۥۚۦۖ۟ۙۢ۟۫ۤ۬ۦۘۤۘۘۨۢۙ۟ۗۙ۫ۗۗۚۖۖۖۗۜۘۖۙۜۘۧۡۘۘ۠۠ۥۘ";
                                while (true) {
                                    switch (str13.hashCode() ^ 719442467) {
                                        case -650098713:
                                            str12 = "ۖۢۢۛ۫ۚۘۦۖۘ۟ۡۘۘۖ۫۬ۛ۠ۦۡۘ۟ۥۥۖۢۥۥۘۜۘۘۡۚۚۡۘۘۘۜ۟ۘۤۖۘۧۧ۟ۗۦۖۚۛۨۘ۬ۖۨۘۘۗ۫ۧۙ۠ۚۥۢ۟ۦۡۤۤۡۘ۟ۡۘ۬ۡۦۘ";
                                            break;
                                        case -130854273:
                                            str13 = "ۥۡۡۗۦۥۘۘ۫ۜۘ۟ۢۘ۫ۜۧۘۧۢ۟ۥ۫ۗۜ۬ۜۘۥ۫ۖۘ۫۟۟ۤۛۘۛ۫ۦۗۚۤۗۜ۫ۜۖۨۗۨۙۜ۟ۢۚۧۘۘۜۚ۫ۘ۫ۘ۬۬۬ۦ۫ۙ۠ۙۜ۠۠۠ۤۜۘۖ۟ۡۘ۫ۧۤۦۨۡۘۛۥۘ۟ۡۧ";
                                        case 482782487:
                                            str12 = "ۧۦۨۘۘ۠ۧۘۦ۫ۢۜۘ۬ۚۘۘۥۙۜۘۡۨۨۥ۠ۨۛۨۧۛۡۖۦۡ۫ۥ۬ۙ۬ۚۙ۟ۡ۬ۖۢۜۥۘۘۢۡۖۘۨ۟ۜۘۛۨۤۦۜۦ۫ۡۧۡۦۛ۠ۧۛۢۘۥۤ۠ۡۖۥ۠ۤۢ۫ۘۨۘۤۗۦۡۗۨۢۡۘۦۢ۬۠۟۠ۤ۟ۛ۫ۜۙۤۢ۠۬ۡۧۗ۠۬ۤۛۥۘۛۖ";
                                            break;
                                        case 1249340413:
                                            String str14 = "ۚ۬ۡۢۖۥۘۙۡۙۢۧ۠۟ۨۘ۫ۢ۫ۡۨۖۖۦۘۙ۟ۨۘۛ۫ۖۤۥۛۨۤۨۚۥۦۘۥۤۥۘ۠ۨۙۥۖۚ۟ۖۦۨۜۛ۟۬ۚۥ۬ۡۙۡۤۗۚۜۘ۫ۛۗ۟ۤۨۜۘۜۜۗۡۡۙۘۡۧۥۥۦۘ۫ۚۦۘۡۗۦۘۘۘۦ۠ۚۘۘۦۦۢۧۧ";
                                            while (true) {
                                                switch (str14.hashCode() ^ 166262951) {
                                                    case -1293983684:
                                                        str13 = "ۤۧۖۤۦۖۧۙۘ۬ۗۘۛ۠ۨۘۛۧۚۦ۟ۧۥۡۦۘۨۚ۟ۤۘۘۦۚۜۘۦۧۘۘۗ۬۬ۙۗۙۖۖۧۘۢ۬ۨۘۜۦۥۖۢۡۚ۫۠ۡ۫ۖۡۤۨۤۚ۫ۜۦۛۨ۬ۦۘۚۖۙۛ۬ۤ۠ۨۨۨۚۥۥۖۘۚۥ۟";
                                                        break;
                                                    case -614646379:
                                                        str13 = "ۡۧۡ۫۬ۨۗۢۙ۟ۜۛۗۜۘ۠۬ۨۥۡۘۚۤ۬۟ۚۙۡۨۥۗۥۨۨ۬ۦۘۥ۟۟ۖۘۖۘۜۗ۟ۜۙۖۦۡۦۡۤۨۘۛۚۖۘ۬ۦ۬۬۠ۖۦۜۘ۬۠ۨ۫۫ۢۗۢۖۧ۫ۤۜۖۜۦۚۢۖۥۨۧ۟ۡۢۧۦۜۢۜۘۦۛۖۘۘۜۖۘۗۛۖۘۖۤۛ۠۬ۡۘۥ۬۟۫ۚۖۘۦۜۦ";
                                                        break;
                                                    case -458925870:
                                                        str14 = "ۖۛۥۦ۟ۥۘۤۙۢ۫ۘۡۤۚۜۘ۟۫ۙ۫ۙۚ۫۠ۖۘ۠ۖۘ۠ۤۘۘۘ۟ۥۘۢۙ۬۠۠ۦۘۨۚۤۡۨۜۘۚ۠ۢۦ۟ۖۦۚۡۘۧۚۤۙۥۤ۬ۘۤۨۚۨۘ۫ۢۡۧ۠ۙۦ۬ۘۘۡۘۥۘۚۥۘ۟ۤۡۘۚۘۦۘۥۥۘۘۡۢۢۚۥۦ۠ۤۡۘ۫۫ۘ۠ۗۡۘ";
                                                    case 41974449:
                                                        String str15 = "۫ۢۡۨۦ۟ۙ۫ۜۘۥۙۢۖۥۧۘۗۘۡ۟ۖۖۚ۟ۚۗ۬ۢۦ۫ۤۛ۬۬ۖۘ۟ۨۦۨۘۜۗۘۘۙۢۚۜۨۖۘۤۗۡۘۧۤۗۛۘۖۘۙۧۙۙۚۙ۬ۘۦۘ۫۫۫ۙۖۘ۬۠ۨ";
                                                        while (true) {
                                                            switch (str15.hashCode() ^ 1532285237) {
                                                                case -1551485760:
                                                                    str14 = "ۨۘۗۛۛۦ۫ۥۖۘۛۘۢ۟ۨۡ۫ۧۨۘ۠ۨۖۘۢۧ۫ۤۨۛۥۘۧۘۘ۠ۗۜ۬ۥۤۦۥۘۦۗۛۙ۬ۥۘۡۤۨۥۛۡۡ۫ۢۛۖۡۖۦۢ۟ۨۚۨۤۙۦۧۜۦۥۗۡۡۨۘ";
                                                                    break;
                                                                case -831822750:
                                                                    str15 = "ۢۥۛۥۧۥۘۨۖۥۘۤۨ۟ۙ۠ۨۘۙۗۖ۬ۤۨۢۖۦۙ۫ۧۙۤ۟ۚۚۚ۠ۡ۟ۖ۬۫۬ۤ۠ۘۘۗۥۜۘ۠ۡ۠ۥۢۚ۫ۢۖۧۗ۟ۦۨۥۗۤۚۢۙۘۘۙ۠۫۟ۨ۠ۨۜۖۚۦۙۥۙ۫ۗ۠۠۬ۙۡۘۛۢۘۘۚۙۨۘۧۜ۬۟ۧۢ۫ۙۤۛ۫ۦۘۚۤۡۙۗۨۢۦۨۘ۫ۡۦۘۥۦ۠ۥۡۦۢۛۤ۬ۢۥۘۦ۫ۛ";
                                                                case 276141098:
                                                                    String str16 = "ۛۡۥۘۘۨۨۛ۬ۦۤۜۡۘۜۡۦ۟ۜۨۖۧۨۘۛۖۘۘۘۙ۫ۥ۠۟ۢۛۧ۫ۢۤ۬ۖۘۘۚۙۦۖۚۨۜۘۢ۫۠ۜ۫۬ۘۙۖۙ۠ۗۡۛۚۖۨۘۗۚۖۘۘۗۡ۟ۙۡ";
                                                                    while (true) {
                                                                        switch (str16.hashCode() ^ 221917224) {
                                                                            case -602345981:
                                                                                str16 = "ۧ۟ۡۤۢۦۘۙۚ۟۠ۛۥۗۗۘۘۦۥۖ۬ۤۛۗ۬ۚۘۤۖۘۧۜۡۘۥۨۦ۠۬۫ۗ۬۟ۡۤ۬ۧۧ۫۬ۡ۠ۜۡۛ۟ۨۧۙ۠ۖۨۜۘۥ۠ۗۖۤۛ۫ۦۥۤ۠ۛۦۦۘ";
                                                                            case -601718032:
                                                                                str16 = getConfig(Deobfuscator$$app.getString(-3440722357485657929L)) ? "۬ۘ۫ۤۘۘۗۢۛ۬ۥ۫ۛۜ۠ۖۜ۬ۨۥۖۧۜۘۘ۫ۛۤۛۖ۠ۥ۫۫۫ۜۘۘ۫ۡۘ۟ۨۘۘۘۚۚۗۗۘۜۦ۟ۛ۟ۦۤۚۢۛۚۜ۫ۨۘۜۥۖۘۖۥۙ۟۫ۤۧۜۘۥۡۨۨۤۘۙۘۘۧۤۘۖۤۘۘ۬ۗۖۦۧۘۥۥۦۘۦ۠ۦۛۖۡ" : "ۧ۫ۨۖ۬ۢۖۥ۫ۧۖۙۦۢۙۙۧۡۜ۟ۛۙ۠ۢۛ۠ۦۜۙۡۘۜۗ۠ۦۘۡۘ۠ۧۡۘۡۥۙ۠ۥۥ۫ۗۦۥۖۙ۟۟۬ۥۗۨۡۢۦۧۙۖۨۤۥۘۜ۟ۘۚۤۙ۟ۢۗۡۘۥۘ۬۠۟۠ۢۢۚۨۧۤۤۛۛۙۡۛۖۡۘۚۖۥۤۗۤۘۧۚۖ۠۟ۡۨۛ۟ۖۦۦۨۨۥ۠ۥۘ";
                                                                            case 107462910:
                                                                                str15 = "۠۫ۦۡ۟ۛۜۚۘ۬ۘۘ۫۟ۜۘ۟ۥۨۘۤۢ۫ۛۚۘۥ۬ۘۘ۬ۤۥۤ۫ۘۖۗۧۡ۬۟۫ۜۘۦۗۡۘۗۖۧۡۦۤۙ۫۟ۗۚۦۘۡ۠ۥۘۧ۟ۜۘۤۦۡۨ۬ۥۘ۬ۨۥۘۙۛۛ";
                                                                                break;
                                                                            case 1712812356:
                                                                                str15 = "۟۬ۜۛۙۗۧۖۡۘۥۧۢ۟ۢۥ۫ۥۙۙۜۗۗۥ۬۟ۨۘ۬۠ۘۗۡۘۥۥۨۛۤۘۘۖۙۧۜۦۘۤ۠ۖۘ۬ۡۨ۬ۢۨۘۡۖۜۘ۫۟ۦۘ۫ۤۢۛۜۜۘۨ۬ۜۖۧۦۨۘۘۧۘۦۤۜۘۦۤۜۘۥۦۤۡ۬ۢ";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case 1968701121:
                                                                    str14 = "ۦۢۚ۟ۛۙۜۘ۠ۡۢۖ۫ۡ۬ۢۛۤۗۜۥۘۘۦۘۨ۫ۥۘۨ۫ۨۘۦ۟۟۠ۖۦۜ۫ۘۘ۠ۡ۫ۘ۬۠ۖ۟ۡۘۨ۠ۥۥۦۥۘۢۘۖۛۢۦۘۧۥۨۘۦ۟ۖۙۙۧۨۢۜۘ۬ۤۜۦۚۛۘۜۡۛ۠ۦۘۤۨ۫ۘۨۧۘ۬ۥۡۘۚۨۦۗۛۗ۬ۗۜۨۚ۟";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case -408860789:
                                str = "ۙۖۤۛۥۥۘۚۗۡۘ۠ۦ۟ۥۤۧۚ۬ۜۘۦۚۤ۟ۚ۬۟ۤۧۡۥۧۘ۠ۤۥۘۧۚ۟ۗۤۡۚۖۜۦۧۚۛۦ۠ۖۥۘۘۜۡۚۨۜ۬۠ۘۢۤۖۚۖۡ۠۠ۚ۬ۚۙ۬۠ۜ۬ۦۜۥۢۘۛۡۖۢۢۘۙ۬ۜۦ۠ۦۘۜۚۚۥۤۖۘ۬ۚۛۙ۫ۥۘ۬۫ۦۜ۬ۨۧۧۛ۠ۨۘۘۛۜۙۥۢۥۖۖ۫ۖۥۥۘۧۨۥۘ";
                                continue;
                            case 1227164102:
                                str12 = "ۤۙۖۘۘۤۡۘۢ۬ۗۦ۫ۙۜۡۡۧۢۦۙ۟۟ۧۘۨۘۥۖۢۨۨ۟ۛۢۘۘۙۨۦۘ۫ۤۜ۟ۖۘۘ۟۬ۙۙ۠ۘۥۧۚۗۦۢۘ۠۟ۢۜۙ۟ۨۗۚۨۡۘۖۜۛۖۨۤۥۧ۟ۙۡۜۤۡۖۘۦۖ۫ۨ۠۬ۤۖۚۚ۬ۡۚۙۖۘۚ۫ۤۛ۟ۘۘۢۧۧۙۧۛۢۗۥۚۗۢ۟۫ۨۦ۟ۧۘ۟ۡۢۗۨۘۥۤ۬ۗ۠۟ۜۧۜۘ";
                        }
                    }
                    break;
                case 1544813129:
                    str = "ۙ۟ۥۘۡۨۛۗۘۖۤۚۨۘۖۡ۬ۧ۠ۥۡۜۘۤۡ۬۬ۦۨۜۦ۟ۘۤۦۘ۬ۙۖۘۢۧۜۘۘۧۖۘۢۗۢۛۗۘۚ۟ۡۘۨۚۛۡۘ۬ۡ۬ۘۜۡۘۛۛۢ۬ۢۘۘۗۘۡۘۦۡ۫ۨۜۜۘۜۥۘۦۙ۠ۢۖۥۘۢۙۥۘۙۖۘۢ۫ۡۘۨۚ۠ۢۚۡۤۜۘ۟ۖۗۗ۠ۜ۬۠ۡۘ۠ۧۖۗۙۨۚۤۖۧۢۜۘۖۖۚۤۤۡۧۧۘ";
                    break;
                case 1929200476:
                    layoutParams.y = 0;
                    str = "ۨۥۥۘۙ۬۟ۥۥۚۚۦۥۧۘۢۨۚ۫۬ۗۦۨۥۘۘۦۢ۫ۥۡۘۖۚۡۛۘۖۤۘۗۗ۫ۤۜۜۨۗۨۨۘ۟ۙۘۨۧ۫ۗۘۡۦۜۨۨۖۡۢۗۥۚۢ۬ۛ۟ۜۤۨۡۢۥۘۘ۠ۨ۫۫ۘۚۨۚۦ۬ۨۚۥۙ۬۫ۘۗۖۘۦۙۜۘۘۛۜۘۙ۫ۦۘۖۜۧۦۛۜۘۖۗۡۡۖۥ";
                    break;
            }
        }
    }

    public static native void DrawOn(ESPView eSPView, Canvas canvas);

    /* JADX WARN: Code restructure failed: missing block: B:7:0x0013, code lost:
        kentos.loader.utils.FLog.error(org.lsposed.lsparanoid.Deobfuscator$$app.getString(-3440722323125919561L));
     */
    /* JADX WARN: Code restructure failed: missing block: B:8:0x001a, code lost:
        return;
     */
    /*
        Code decompiled incorrectly, please refer to instructions dump.
    */
    private void Shell(String str) {
        String str2 = "۬۟ۢ۟۫۟ۦ۠ۜۘۡۡۡۢۗۨۜۘۘۘۡۧۘۘۘۧ۠۬ۙۖۘۙۘۖۘ۬۠ۜۘۖۦۘۘۘۤۧ۠ۜۘۖ۬ۘۘۨۚ۬۠ۖۥۤ۬ۦۘۛۚۡ۠ۘۡ۬ۧ۫۫ۘۡۦۖۘۧۡۥۚ۟ۢ۫ۘۦۥۡۙۗۥ۬ۜۡۤ۠ۢۥ۫ۥۘ۠۠ۖۢۦۗۛۡ۠۫۫ۛۗۗۡۘۤۦۨۗۜۥۘ۫ۙۦۚۜۘۧۗۚۚۢۛۙۡۘۢ۟ۦۙۛۥۘ";
        while (true) {
            switch (str2.hashCode() ^ 2080970598) {
                case -822270466:
                    String str3 = "ۤۨۛۧۡۤۛۨ۠ۛۢۡۧۜۖۚ۟ۡۘۘۥۥۚۜۨۚۥۖۘۡ۬ۡۘ۠ۗۡۗۨۦۜۥۡۘۥۘۥۦۘۧۘۦۘۨۘۘۢۗۗۧۨۘ۠ۤۦۚ۠ۤۧۗۙۜۥۥۧۡۨ۠ۡۨۘ۟ۤۦۜ۠ۧ۟ۨۨۨ۫ۘۚ۟ۡۘۜ۬ۡۘ";
                    while (true) {
                        try {
                            switch (str3.hashCode() ^ (-1004886196)) {
                                case -1749606245:
                                    Runtime.getRuntime().exec(str);
                                    FLog.debug(Deobfuscator$$app.getString(-3440722155622195017L) + str);
                                    return;
                                case -1429895956:
                                    str3 = "ۢۤۥۚ۟ۖۗۥۜ۟ۢۨۧۚۥ۟ۘۚۚۤۡ۬۫ۖۘۨ۫ۘ۟ۤۚۧ۠ۨۖۡۘۘۤ۟ۘ۫ۜ۬ۡۦۙۨ۠ۙۢۥ۬۠۬ۥۥۥۘۘۗ۫ۡۨۖۡۡۜۖۘ۫ۦۧ۟ۜۚ۫ۙ۫ۗۘ۬ۡۨۧۘۨ۟ۥ۠۠۬ۨۤۦۘ";
                                    break;
                                case -634956506:
                                    String str4 = "ۤۚۤۥ۫۫ۥۙ۫ۛ۠ۦۘۙ۟ۢۥۗۡۘۢۖ۠۠ۖۘۘ۬ۨۤۙۡۚ۠ۨۗۙۜ۠ۢۨۜۨۖۘۡۙ۟ۜۢۖۘۡۜۖ۟۠ۙۨۢ۫ۙۜۜۘۥۢۦۘۢ۠۟ۡۖۘۗۨۖۧۙۜۘۧۨۖۨۡۥۘۘ۟ۥۨۨۤۖۛۖۘۨۡۡۢ۫ۢۧۧۡۘۘۧۚۨۜۖۘۨۤ۠۬ۜۨۗ۫ۧۗ۫ۘۘۦ۠ۡ";
                                    while (true) {
                                        switch (str4.hashCode() ^ 152626296) {
                                            case -2038561307:
                                                String str5 = "ۛۙۤۤۡۖۦۚ۠۟۠۫ۖۢۥۘۢۜۘۙۡۥۤۘۘۦۗۖۗ۫ۥۘ۬ۙۢۤۥ۠۬ۥۘ۬ۛۨۙۚۨۜۜۘ۬ۗۜۘۡ۬ۘۘۨۖۤۥۦ۫ۨ۟ۢۦۘۘۘۜۘۜۘۚۥۢ۫ۗۧۨ۠ۥۘۥۜۤۜۧۥۤۡۙ۟۫ۨۖۘ۟۫ۥۦۘۧۙۧۖۘۡۦ۬";
                                                while (true) {
                                                    switch (str5.hashCode() ^ (-1125071443)) {
                                                        case -1395001833:
                                                            String str6 = "ۤۤۗ۟ۘۦۘۢۜۥۘۜ۟ۤۦۦۘۗۨۘۘ۟ۜۛ۬ۡ۬ۖۤ۠ۚۖ۟ۨۘۢۤۧۦۘۛۤۜۘۥۤۜۚۤۨۘۜۡۜۖۨۤ۬۬۫۫ۦۨۤۢۦۤۨۡۤۗۘۧۗۙۥۙۧ۬ۘ۬ۧ۟ۚۜۤۙۖۧۗۢ۠ۧ۠۟ۦۘ۫ۢۢۙۙۨۘ۫۫ۘ۬ۢۦۘۤۜ۟ۘ۠ۚۘۜۡۢۚ۟ۖۚ۫ۚۦ";
                                                            while (true) {
                                                                switch (str6.hashCode() ^ 1183475778) {
                                                                    case -1944606947:
                                                                        str6 = "۟ۜۘۘۦۧۢۚۡ۬ۨۥۢۚۥ۠ۥۧۜ۟ۛۖۘۚۛۖۘۙۜۡۘ۠ۘۤۗۘ۫ۢۡۘ۬ۖۡ۬ۛ۫ۗۡۛ۟ۧۦۘۦۙۨ۟۠ۖۘۜۚۥۛۖۡۥۨۘۡۚ۟ۛۥۦۘۦۡۨۘۥۛۥۥۗۚۡۚۗ۟۟ۗ۟ۧۡۘۤۡۤۚۤۚ۬۠ۙۜۡۜ۠ۚ۠ۧۨۘ";
                                                                    case -1050351483:
                                                                        String str7 = "ۤۨ۫ۡۗ۬ۨۜۜۘۙۥۖۘۙۦۤۡ۫ۙۤۗۘۘۛۘۨۘۖۘۡۘۚۜ۟۬۟ۥۘۦ۬ۙۖۙۨۦۧۢۤ۠ۚۗ۬ۤ۫ۤۙ۟ۙۢۨۨۜۘۥۖۤۙۥۗۖ۟ۡۧ۟ۨۚۢۨۘ";
                                                                        while (true) {
                                                                            switch (str7.hashCode() ^ 1910759269) {
                                                                                case -2012311083:
                                                                                    str6 = "ۛۥ۠ۙۧۢۥۙۦۘۢۛۦۤ۫ۨۙۤۖۘۜۖۗۤۚ۫ۘۖۧۖۡۧۘۤۢۙۡۥۙ۬ۥۤۤۖ۠ۛۧۡ۠ۦ۠۬ۦۜۗۗۗۖ۬ۘ۠ۡۘۦۢۛۚۤۙۡۡۧ۬ۨۜۗۜۜۙۗۜۜ۟ۙ۫ۖۤۦۘۤۦۨۘۦۧۧۘۛ۫ۗۙۨۚۗۖ۫ۜۜۜۚۤ۫ۙۦۘ۬ۦۜۖۖۨۘۥۧۘ";
                                                                                    break;
                                                                                case -1532097406:
                                                                                    str7 = !str.trim().isEmpty() ? "۫۫۬ۗۙۖۥۘۧۘۧۦۖۘ۟ۘۘۘ۬ۜۡۘۢۧۦۦۘ۬ۙۗۜۘۘۛۘ۠۫ۡۘ۫۟۠۬ۚۡۢ۠ۗۥۨۦۘۤۦۦۖ۫ۨۘۛ۫ۨۥۘۘ۬ۛ۟ۦۖۡۥۢۨۘۡ۟۬ۨۚۡۘ۠ۨ۫۟ۖۧۘۙۢۨۗۘۖۘۨۨۛۖۨۖ" : "ۜۚۦ۠ۖۘۘۧۦۨۘۛۡۦۡۡۡ۠ۡۧ۫ۨ۟۟ۚۡۘۘۨ۬ۢۛ۬ۢۚۦۘۖۨۦۘۨۚۚۚۖۦۘۧۡۡۢۦ۫ۤۢۘۨ۟ۨۡ۠ۡۘۧۢۤۛۥۦۨ۠ۦۡۖۢۦۧۢۜ۟ۖ۬۠۟ۛ۠ۥۡۙ۠۬ۖۨۡۘ۠ۙۦۗۛۥۡۤۙ۟ۡۨۗۜۨۘ۫ۡۜۘۡۥۧۥۗۘۧۥۡۧۧۥ";
                                                                                case -1434376378:
                                                                                    str7 = "۫ۛۨۘۥۢۧۥۚۘۘۙۜۥۘۡۤ۟ۨۨۛۖۧۨۘ۫ۧۦۧۘۖۘ۬ۤۛۡۨۖۡ۟ۚۙۙۖۖ۫ۦۘۨۖۢ۫ۧۢ۠ۢۦۘۗۤ۟ۙۧۥۘۡۡ۫ۙۜۗ۫۟ۥۢۧۜ۬ۚ۟۠ۙۡۙۤۖۡۤۤ۫ۛۧۜۜۙ۟ۜۜۗ۟ۦ۠۟ۡۗۧۛۗۨۘ۠ۦ۟";
                                                                                case 505811453:
                                                                                    str6 = "ۧۡ۟ۗۤۡ۟ۜۡۘۘۨۜۘ۬ۘۡۘ۠۠ۗۘۖۗ۫ۦۛۡۙۚۥۦ۠ۛۛۘۨۦۖۥۜ۫۬ۚۨۘ۫۬ۘ۫۫ۦۘ۬ۦۙ۟۠ۙۢۧ۠۠۟ۢۘ۬ۘۘۙ۟ۧۨۦۥۜۖۚ۫ۧۙ";
                                                                                    break;
                                                                            }
                                                                        }
                                                                        break;
                                                                    case -801996518:
                                                                        str5 = "ۨۚۥۘۖۖۨۗۖۡۡۡۙۖۛۨۚۢۨۦۖۘۢۗۦۡۦۘۥۜ۟۬ۥۡۦۦۖۤۥۚۚۨ۟۠۬ۚۤۙۘۖ۫۠ۗۗۗۦۡۢۤۛۛۡۨۚۛۖۥۖۙۘۥۖۘۗ۬ۦۘ";
                                                                        break;
                                                                    case -794390337:
                                                                        str5 = "ۖۧۛۨۚۗۨۖۘۚ۫۬ۤۡ۟ۛ۬ۥۘۤۚۡ۟ۛۦۗ۫ۤۤۦۡۙۛۥۘۖ۠ۢۡۧۜۙۨۖۘۙۜۘۘۖۗۤۙ۬ۥۘۢۢۡۢۨۜۘۡۥۥۘۛۨۖۜۥۘ۫ۙۨۘۢۘۨۤۤۙۢۢ۟۟۫ۙۛۖۜۙ۟۟ۨۘۧۖۦۖۚۨۜۡۧۘۜ۠ۖۘۥۚۥۘۥۢ۫۟۫ۤ۬ۜۦۦۧۡۤۘۘۘۤۤ۟ۙۘۨۚۛۨۖۘۤۘۛۚ";
                                                                        break;
                                                                }
                                                            }
                                                            break;
                                                        case -1167332796:
                                                            str4 = "ۖۨۦۘۛۥ۟ۡۘۖۘۡ۬ۗۡۥۦۘ۬ۘۚۗۘ۠۟۠ۧ۬ۙۧۜۡۧۚۧۘۘۚۧۨۗۥۘۘۡۦۚۚۚۥۤۤۨۛۤۛۢۨۨۗۥۦ۬۫ۛۛ۬ۛ۟ۦۗۛۡۨۘۢۘۦۚۦ";
                                                            break;
                                                        case -855545739:
                                                            str5 = "ۦ۬۬۬ۤۡۘۦۜۖۡۛۥۘ۠ۗۡۜۙۚۨۡۚۦ۬ۡۗۗۜۢۛۦۘۖۚ۬۟ۘ۠ۥۚۨۘۘۘ۟ۜۛۧ۟ۗۚۘۗۡۤۦۘ۟۬ۚۗۥۧۡۜۘۗۛ۫ۨۙۡۗۜۗۡ۫ۛ";
                                                        case 739165407:
                                                            str4 = "ۥۦۧۘۢۢۛۨۤۢۙۙۛ۫ۤۦۨۗۦۘۘۘ۬ۘۘ۬ۢ۟۟ۡۜۘۥ۠ۖۘۚۦۨۚۜۘۙۗۡۙۥۥ۬ۘۥۘ۫ۨۜۘۡۘۜ۫ۛۡۛۜۦۢۗۜۘۡ۠۠۟ۛۜۘۚۜۚۥۙۨ";
                                                            break;
                                                    }
                                                }
                                                break;
                                            case -119917188:
                                                str3 = "ۥۗۜۘۛ۠ۘۧ۠ۚۘۤۖۤۢۤ۫ۡۢۨۘ۬ۡ۟ۚۢۡ۫ۨ۠ۨۘۜۖۡ۫۟ۢۤۧۤۤۦۘۘ۟ۚۥۡۛۥۚۘۤۗۦ۫ۗۤ۠ۖۙۖۛۥۘۥۡۖۘ۟۬۫۫ۘۥۜۢ۠۫ۧۧۜ۬ۘۚ۠ۖۘۛۚۦۤۜۛۡ۫ۢ۬ۛ۫ۥۦۦۤۢۦۦۗ";
                                                continue;
                                            case 363686307:
                                                str4 = "ۖۘۧۘ۬۟ۜۘۡۗ۟ۖۘ۫۠ۙ۟ۗۧۦۘ۫ۖۨۘۥۢۡۘۘۘۘۜ۬ۜۧۨ۟ۦۦۨۘ۠ۗ۟ۜۖۗۗ۬ۨۘۨۢۥۘ۫ۡۧۘ۫ۧۤۘ۟ۦۘۘۤ۟ۤۦ۬ۧۡۜۘۚ۠ۤۤ۠ۦۘۚۚۦ۟ۛۥۦۧۘۦۢۜۘ۫ۗۦۘۧ۟ۦۘۥۦۖ۠۫ۜۘۤۢ۟ۡۦۥۘ۬ۚۖۢۢۘۥ۫ۗ۠ۗ۫ۙ۟ۘۦۛۘ";
                                            case 1163053619:
                                                str3 = "ۙۜۦۘۥ۬۫۬ۙ۫ۨۦۜۘۦۗۗۤۡۘۢ۠ۘۘ۟ۚۦۘۥۥۘ۟ۜۧۘۘۖۘ۟ۦۛ۠ۛۛۛۛۤۖ۬ۨۘۖۧۥۘۛۦۛۨۥۨۘۖۡ۠ۥۘۘۥۘۦۦۘ۫ۚ۬ۧۤۜۖۖۙۖۥ۟ۢۦۛۨۢۘۖۗۦۦۘۘ۠ۘۘۚۡۚ۫ۗ۫ۜۜۜ۬ۗ۬ۖ۠ۛ";
                                                continue;
                                        }
                                    }
                                    break;
                                case 190770098:
                                    break;
                            }
                        } catch (IOException e) {
                            FLog.error(Deobfuscator$$app.getString(-3440721915104026441L) + e.getMessage());
                            e.printStackTrace();
                            return;
                        }
                    }
                    break;
                case 332467258:
                    str2 = "۫ۙۡۥ۟ۜۘ۟ۘۘۜۘۥۢۙ۬ۧۚۦۘۘۙ۫ۢۗ۠ۘۖۜۧۦۥۘۦۗۨۘۛۚۢ۟ۧۗۛ۬ۦۘ۫۫ۦۘ۠ۜۤۙۥۥۘ۫ۗ۫ۧۙۖۘۚۜۗ۠ۡۤۖۖۡۘ۟ۗۦۘۦ۫۟ۨۥۘ۠ۘۡۨ۟ۡۘۙ۫ۦۘۖۤ۬۫ۧۥۘ";
                    break;
                case 718007819:
                    break;
                case 959484270:
                    String str8 = "ۡۥۤۗۥۢ۬ۤۦۤ۠ۡۘۘۡۦۚۛۜۘ۬۟ۘۡۘۡۘ۟ۦۛۥۨۘۜ۬ۢۘۘۥۙ۫ۗۚۡ۟ۧ۠ۨۙۥۘۦۜ۫ۙۢ۬ۘۙۗۙۛۙۜۤۖۤۢۖۘۗۘۡۘۡۘۥۤ۫ۤ";
                    while (true) {
                        switch (str8.hashCode() ^ 1833067554) {
                            case -1620314343:
                                str2 = "ۛۦۗۨ۬ۦۤۡۥۙۘۡۢ۬۠ۧ۬ۖۢۡۧۘۡۦۧ۫ۜۥ۫۠۬ۖۥۡۘۤۗۗۜۨ۫ۛ۟ۡۘۧۖۘۘ۠ۜۡۡ۟ۧ۠ۚۥۘۦۢۨۨۥ۟ۜۘۥۡۦۘۛ۫ۡۘۨۦۥ۠ۥۡۘۘۨۧۘۖۥۨۜۨ۬ۥۚۛ۬۠";
                                continue;
                            case -1554020270:
                                str8 = "ۖۡۧۛۤۧۧۧۘۗ۠ۡۘ۠ۨۦۘۙۛۤۗۤۛۜۡۛ۠ۜۘ۟ۛۡۙ۠ۥۜۛۙۙۡ۬ۘۦۥۗۚۧۧۚۥۘۜۢۙۡۛۘۚۨۜۘ۟ۥۨۘۦ۟ۥۨۘۖۘۙ۠ۦۘۢ۬۬۬ۦۖۘۨۧۖۘۨ۟ۘۥۨۙۡۥۘۘۙۨۡۘۙۥۖۚۗۙۚۛ۟ۥۛ۟ۖۤۤۜۛۨۘۧۦۨۘۜۗۖۜۧۦۘۗۖۥ";
                            case -1331880756:
                                str2 = "ۢۥۗۙۗۗ۬ۙۘۡۢۙۘ۠ۤۡۜ۠ۜ۠ۚۜۗۛۥ۟۠ۙ۫ۤ۠ۖۗۙ۠ۥۦۘۘۘۤۙۤۧۨۘ۠۬ۛۚۘۨ۟ۚ۠۬ۚۡۦۙۨۗۤۡۘۦۘۤ۟ۢۚۜۙ۟ۖۘۡۘۧۜۥۨۚۜۘۨ۫ۗۗۧۖۘۗۦ۫ۘ۬ۜۘۜۙۡۖۖۙ۫۫ۡۘۨۙ۠";
                                continue;
                            case -206168546:
                                String str9 = "ۙۘۢۜۨۧ۠ۚۡۥۗۨۜۜۘۘۥۗ۟ۧۥۚۢۨۖۘۛۘۘۜۙۦ۬۠ۗۛۜ۟ۚۦۚۨۚۚ۬ۦۦۤۛۧۘ۫ۗۡۦ۫۠ۡۘۗۛ۟ۗۥۘۡۢۖۘۥۛۢۜۧۧۦ۫ۖۗۧۧۜ۫ۦۘۛ۫ۗۢۖ۫ۧ۠ۥۧۢۨۖۘۜۧۖۨۢۚ۠۫۬ۧۘ۟ۢۧ۫ۚۜ۟ۢۥۘۤۤۡۘۢۚ۠ۗۖۤۚ۟۬ۚۥۘۘ۟ۙۦ";
                                while (true) {
                                    switch (str9.hashCode() ^ 975935335) {
                                        case -1487402343:
                                            String str10 = "ۗۡۜۘۖ۟ۨ۠ۛۖۘۘۜۘ۫ۖۛۢۤۥۘ۫ۢۙۡۛۨۘۡۢۦ۟ۤ۠ۜ۬ۡۘۨۖۨۘۢۜۖ۫۠ۨۘۜۘ۟ۗۘۘۦ۟ۖۘ۟ۨۧ۬ۢ۟ۗۜۨۘۡۜۖۚۦۖۘ۫ۢۘۜۘۖۡۢۥۘۜۖۥ۟۠ۡ۠ۙۨ۬ۨۗۖۖۧۘ";
                                            while (true) {
                                                switch (str10.hashCode() ^ (-1189038687)) {
                                                    case -1823427227:
                                                        str9 = "ۚۡۦۘۡۤۦۘ۬۬ۦۘۡۖۜۨۥ۬ۥۗۛ۫ۙۗۜ۬۫ۥۘۘ۬۠ۖۘۡۤۛ۠ۜۗۢۛ۟ۙ۠ۤۗۢۚ۫۫ۘۖۧۖۨ۠ۡ۫ۛۥۘۗۛ۠ۨۙۡ۫ۥ۫ۤۥ۟ۤۥۚۥۦ۠ۖۗ۟ۡۢ۬ۖۗ۬ۦ۫ۥۘۖۤۖۜۨۦۘۤۤۜۤۛۖۘۧ۫ۗۤۦ۟ۖۗۤۤۚۖ۠ۥۧۖۗ۬ۖۡۘ";
                                                        break;
                                                    case -221698055:
                                                        String str11 = "ۨۧۛ۠ۛۖ۫۠ۦ۫۫۟ۗۧۨۦۚۗۙ۟ۦۡۨ۫۬ۖۡۘۗۙۡۗۜۨۘ۫ۢۘۖۥۛۥۤ۬۠ۢۨۘۛ۬ۢ۬ۤۨۘۧ۟ۢۙۧۤۢۜۨ۬ۥۖۗۙۡۘۤۗ۠ۢ۠ۜۘۜۖۡۘۛۖۖۜۜۡۘۙۨۙۡۦ۫۬۬۫ۗۗۡۛۘ۬۟۫ۦۥۢۡۧ۫";
                                                        while (true) {
                                                            switch (str11.hashCode() ^ (-302245587)) {
                                                                case -1661842692:
                                                                    str10 = "ۛ۬ۥۘۤۦۡۘۜ۬ۨۘۤۡۘۥۛۜۘۘۗۖ۟ۖۤ۟ۖۜ۟۬ۜۜ۫ۗۚۖۧۘۢۗ۟۟ۘۙۤۜۘۢۗۨۗۙۦۛۦۢۢۜ۟ۗ۟ۗۜۗۖۘ۬ۗۥۘۨۖۘ۠۫ۢ۬ۘ۠ۙۛۡۖۚۨۘ۫ۛۖۘۤۚۜ۠۫ۖ۫ۥۘ";
                                                                    break;
                                                                case -1569256852:
                                                                    str11 = str != null ? "ۘۙ۬ۢۥۢۥۙۙۨ۫ۖۘ۫ۙۤۘۡۤۢۧ۬ۜۤۦ۬ۜۥۗۦۦۘۖۛۖۗۘۦۛۙۛۘۜۗۛۗۨۘۖۛۥۘۢۤۧۜۧۘۦۙۖ۫ۡۜۘۛ۟ۘ۬۟ۖۦۜۧۙ۫ۥۘۖ۟ۦۘۜۜۦۘۤۨ۬۫ۜۢۢۥۜۘۤ۬۫ۤۦۥۚۜۗۡ۠ۡۘۚۚۡۘۤۜۛۜۥۛۙۦۦۘۡۡۡۨۧۗۤۢۘۦۖۥ۠ۥۡۘ۠ۙۦۜ۟۫۫ۖۗ" : "ۡۧۖۘ۠ۨۧۘۡ۟ۡۗۧۧۢۥۖۘۙۛ۠ۚ۟ۜۡۙۘۜۖۦۘ۬ۨ۫ۘ۠ۡۚۜۚ۬ۡۘۗۖۚۡۧ۫ۚۥۘ۫ۙۜۘۖۖۘۥۥۨۘۛ۟ۗۥۗۥۥ۬ۡ۬ۛۚۚۦۘۨۙۛۤ۠ۡۙۧۚۥۛۜۡۘ۟ۚ۠ۦۘۙ۠ۤۡۗ۫ۦۤ۫ۦۡۦۘۛۡ۫ۙ۠۟۫ۤۨۡ۟ۖۢ۬ۗۡۨۘۘ";
                                                                case -822654887:
                                                                    str11 = "ۨۢۥۖۖ۠ۦۜۧۘ۬۟ۥۘۢۚۛۡۗۥ۠ۖۛۦۘۘۨۙۦۘۗۤۡۨۤۡۘۢۜۥۛۜۘۨۚۘۨۛۜۢۧۖۚۛ۟ۤۥۧ۠ۤۦۜ۫ۚۛۢۜۘۦۙۦۤ۫ۜ۠ۡۖۘۙ۬ۜۘۦۘۧۘۤۨۧۘۚۙۥۦۡۥۜۨۦۡۧۗۢۨۤۙۘۜۥۡۜ۬ۚۘ";
                                                                case 1901170402:
                                                                    str10 = "ۗ۬ۧۖۢ۬ۛ۟ۢۥ۠ۧ۫ۢۤۙۤۥۘۜۢ۠ۤۖۧۘۖۡ۠ۘۙۚۗ۟ۨۘ۟ۨۢۚۦۨۘۚۡۧ۬ۤۛۛۥۧۘۤۢۜۘۦۗۚۢۛۢ۫۫ۦۘۥۖۨۤۜ۟ۖۢۗۡۚ۫ۤۥۡۜۧ۟ۨۧۖ۠ۘۘۗۡۧۜۗۥۘۨۥۥۘ۠ۖۢۢۥۖۘ۫ۡۛۧ۫ۨۘ";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 125208340:
                                                        str10 = "ۧۙ۟۫ۗۙۦۡۦ۠۠ۥۨ۟ۘۘۧۥ۫ۢ۟ۦۤۥۢ۟ۦۧۘۗۡۧۧۚۘۘۜۛ۠ۡۗۙ۠ۖۘۘ۠ۡۚۙ۬ۥۘۦۨۨۘ۫ۡۖۘ۬۠ۜۘۨۧۘۘۗۘۖۘۖۘۛۜ۬ۙۚۤ۟ۡ۟ۨ";
                                                    case 291655099:
                                                        str9 = "ۗ۟ۗۚۨۦۘۡۡۦۘۨ۠ۧ۠ۧۢ۫۫ۛۦ۫ۡۘۙۥۗۖ۬ۥۘۜ۠۠ۜ۬ۦۘۘۨۧ۬ۗۡۘۥ۫ۦۜ۟۫ۛۥۙۘ۬ۦۘ۟ۗۘۛۙۛۜۥۗۡۗۜۚۘۦۢۗۖۤ۫";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 321169942:
                                            str9 = "ۜۧۘۥۧۢۡ۟۫۫ۦۨۚۨۙۨۖۜۘ۬۠۠ۖ۟ۙۚ۠ۘۖۡۗۛۙۙ۠ۗۤۚۜۧۙۜۖۘ۫ۦۡۘ۠ۥۥۘ۠ۢۤ۟ۨۘۨۡۡۘ۟۠ۨۘۚ۟ۡ۠ۡۗ۬ۥۨۨ۫ۗۢۘۘۢ۫ۦۘ۬ۖۘۘ۠۠ۦۢ۠ۥۛۗۘۘۤۦۥۗۡۢۦۜۨۙۤۚۦۚۥ";
                                        case 376649293:
                                            str8 = "ۖۜۨۘۥ۟ۨۘۨۢۘۡۤۤ۠۬ۥۦ۟ۚۙۡۜۨ۬ۙ۬ۢۢۧۜۡ۫۠ۜ۬ۧۨۨۢۨۘۢ۠۠ۦۧۦۘۨۛۘۙۗ۟ۙۙۘۛۙ۫ۥۛۡ۫ۥۥۢۦۗۛ۠ۢ۟ۧ۬ۖۧۘۤۤ۬۠۬ۦۘ۫ۘ۫ۘۚۥۘ۫ۦ۫";
                                            break;
                                        case 746647386:
                                            str8 = "ۤ۫ۚۦۖۗۧۜۖ۬ۢ۬ۡۜۨۘۤۛۘۘۧۦۢۢ۫۠ۥۘ۠ۜۗ۬ۜۚۦۘۛۨۘۜۢۡۘۗ۠ۘۖۚۡۘۛۡۨۨۗۧۨۛۙ۬۫ۥۘۖۘۗۧۨۘۘۗۖۜۘۚۨۤۙۖۡۘۚ۠ۜ۠ۡۡۘۘۦۛ۫ۗۦۙۥۘۦۛۙۢۛۜۥۚ۫ۖۡۦۘ۟ۛۘۤۖ۬ۢۤۥۘۛۗ۫ۙۥۙۤۡۡۘۚۦۘۘ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
            }
        }
    }

    private void Start() {
        String str = "ۡۨ۠ۖ۫ۧۢۗۜۧۘۛۗۧۖۘۤۙۢۗۤۡۘۗۘۜ۠ۙۨۚۡ۫ۢۚۖۨۗۥۘۦۨ۬۬۬ۥۘۜۥۤۧۜ۬۫ۢۧۧۛۛۥۗۘ۠ۤۖۥ۫ۨۘۗ۠ۘ۠۟ۦۦۤۜۧۨۗ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 654) ^ 228) ^ 905) ^ 373) ^ 983) ^ 775) ^ 484) ^ 403) ^ 319) ^ 96) ^ 454) ^ 156) ^ 380) ^ 327) ^ 514) ^ 15) ^ 218) ^ 222) ^ 362) ^ 683) ^ 834) ^ 133) ^ 777) ^ 813) ^ 591) ^ 484) ^ 317) ^ 657) ^ 299) ^ 981) ^ 94) ^ 1302712100) {
                case -383406930:
                    String str2 = "۠ۙ۠۠ۥ۟ۥۡۦ۫ۜۦۘ۠ۙۡۨۧ۬ۛۖۛۙۘ۟ۙۚ۟ۘۤۤۜۦۘۘۘۤۨۦۡۥۘۥۡۧۧۚۛ۟ۛۘۤ۫ۧۘۢۤۗۦۘۖۧۘۘۘۖۛۘۤۡۘۧۡۡۘۤۤۡۘۖ۟ۦۘ";
                    while (true) {
                        switch (str2.hashCode() ^ (-1349735141)) {
                            case -1886482176:
                                String str3 = "ۙ۫ۧۜ۠ۡ۫ۡۚۜ۬ۥۡۚ۟ۘ۬ۚۦۨۦ۬ۗۗۦۧۜۘۜۖۦۘۘۜۡۖ۬ۡۘۛۤۥۘۢ۟ۨۨۛۙۥ۟ۛۦۖۛ۬ۡۨۦۛۖۥۤۨۧۦۡۢ۬۬ۜۢۜۛۖ۫ۖۜۨ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-1077015591)) {
                                        case -1011510212:
                                            str2 = "۟ۥۦۨ۠ۘۘۜۨۦۘۜۤۖۘ۠۫ۤ۠۟ۨۨۧۗۡۖۤۙ۠ۗۘۧۦۘۗۗۛۡۚ۫ۘۙ۫ۜۢۡۛۥۗ۠ۚۤۗۘۘۨۛۧۙۜۧۘ۫ۚۥۘۧۦ۫ۗۙۦۚ۬ۘۘۨ۬ۜۜۙ۫ۚۦ۟ۜۜۡۘۤۨۧۘۖ۬ۥۘ۟ۛۘ";
                                            break;
                                        case -557818752:
                                            str3 = "ۘۖۥۢۗۥۤۡ۫ۢۘۡۗۛۦۥۦ۬ۨۥۖۥۛۨۗۘۜۘۨۥۡۨۥ۫ۧۜۨۜۚۘۘۛۘۘ۬ۥۢۦ۫۫ۛۖۥۘۚۤۨۘۧۜۘ۟ۦۘۥ۬۬ۦۜ۟ۘۚۗۖۦ۟۟ۙۤۡۦ۬ۛۡۨۜۖۧۘۧۚ۠ۥۤۥ۫ۘۥۘۜۗۛۧ۬ۚ۠ۚۜۗ۠ۨۖۨۘۤۨۤ۬ۘۨۘۚۗۧ۬ۛۥۘ";
                                        case -76266046:
                                            str2 = "ۤۚ۫ۖۡۘۗ۟ۛۙۡۨۥ۠ۘۨ۫۠ۢۖۘ۠ۨۧۤۨ۫ۚۧۗۥۨۢ۫۬ۡۦۛۡۘۖۢۦۘ۟ۚۘ۠۬ۛ۟ۤۢۗۤۘۜۗۗۛۥۥۖۗۗ۠ۤۗ۠ۤۜۥۨۥۨ";
                                            break;
                                        case 1728231991:
                                            String str4 = "ۙ۫ۘۤۡۡۘۢ۫۬ۡۘۘۘۙ۬ۥۘۥ۠ۖۘۨۛۧۨۘۛۨ۬ۛۚۢۨۗ۬۫ۗۘۚۚۨۦۘۤۥۛۖۗۖۘ۬ۛۚ۠ۖ۟ۧۡۡۘ۟ۤۘۘۚۢۜۘۘۘ۬ۤۖ۟ۨۥۘۢۡۢ۟ۥۧۘۗۧۖۙ۠ۚۡۘۨۤۗۘۖۛۚ۫ۨۘۢۜۡۡۙۘۗۢۡۘۘۨۘۘۨۡۦۘۜۨۡۘۨۡۨۦ۠ۧ۠ۙۜۘ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-1927338108)) {
                                                    case -909789404:
                                                        str3 = "ۚۡۛۢۨۚۧۡۙ۟ۛۢ۫۬ۜۘۥۦۖۤۤۘۘۙ۠ۗ۠ۘۘۨ۫ۢۢۥۦۘ۫ۜۥۘۥۥۡۘۤۘ۬۟ۚۘ۟ۢۥۢۥ۟ۤۦۥۢۨ۟ۛۚۤ۬ۘۘ۬ۢۨۘۚۨۗۧۘ۫ۚ۠ۘۘۧۚۙۤۢۦۗۚۘۘۚۚۜ۫ۖ";
                                                        break;
                                                    case 348238781:
                                                        str4 = "ۘۜ۫ۙۗۦۘ۟ۨۖۚۨۗۙ۠ۘۨۘ۠۬ۥۖۤۥۘۖۗۧۤۛۖۛۢۛۢۡۧۘۗۛۜۘۦۨۜۘۘ۠ۘۧۥۘۜۙ۬۬ۡۖۛ۬ۘۘ۫ۙۥۦۗۚۜ۠ۨۦۗ۠ۡۖۨۘۖۨۡ";
                                                    case 542854822:
                                                        String str5 = "ۡۛۘۘ۫ۜ۬ۦۜۧۧۧۤ۫ۥۡۖۥۚ۠۫ۤۖۚۤۤۚۚۧۙۚۗۚۧۗۜۨ۬ۦۧ۫۫ۜۘۡۛۖۛۥۗۜۗۧۡۙۘۧۛۜۘ۬۬ۜۡۦۚ۫ۘۧۘۖۥۖۙۜۜ۠ۧ۠ۥۘۗۗۨ۟ۚۧۨ۟ۡۤۧۙۙۡۦۧۡۥۨۢ۟ۨۘۧۗۖۘ۬۠ۘۘۘۦۢ۟ۡ۫ۨۥ۟ۥۜ۫ۥۥۘۘ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ (-565233306)) {
                                                                case -1274459177:
                                                                    str4 = "۬ۗۤۤۤۧۨ۬۟ۡۖۧۘ۟ۙۙۢ۟ۢۙۦۜۘۤۙۡۘ۬۫ۚۙ۫ۦ۠۠ۨۦۘۘ۫۫۬ۘۙۢۤۢۢ۠۫ۧۗ۫ۨۘۦۧۜ۟ۨۗۦۜۨۙۦۛ۫ۥۤ۠۟ۖۘۜۦۦۘۥۚ۟۟ۘۦ۬ۡۚۨ۬ۙۧۤ۟۟ۚۨ";
                                                                    break;
                                                                case 820904387:
                                                                    str5 = "ۦ۬ۙۢۚۘۢۡۙۜۚۨۥۥۧۛۧۘۘ۟۟ۡ۫ۜۧ۟ۧ۟ۤۧۜۢ۬ۘۘۚۙۘۜۘۥۨ۠ۘۘۡۧۦ۠ۘۖۚۦۢۜۤ۫۠۬ۨۤۡۘۧۦۗۜۦۖۘۙۨۘۜۥۜۥۡۗۚۘۘ۬۬ۨ۠۟ۗۖ۬۟ۤۤۘۘ۫ۤۛ۬ۥۦۦ۠۬ۜ۟ۡۘ۬ۦۥۖۡ۫۟ۦۛ۟ۡۜۗۤۜۛۥۡۚۧۢۜۛۜۢ۟۠ۘۥۘۘ";
                                                                case 1155283608:
                                                                    String str6 = "ۚۤۡۘۜۛ۠ۜۨ۟ۜۗۖۘۦۙۖۗۦۦۙۚۛۤۥۗۢۤۘۘۘ۠ۜۛ۫ۖۘ۬ۧۦۗۛۤۢ۬ۥۥۖۘۜۥۡۘۡۛ۫ۗۘۖۨۡۦۘۡ۟ۥۘۢۦۙۗۖۥۘ۠۠ۡۚۘۖۘۨۗۖۘۙۗۥۘۜۚۧۚ۫ۢ۟ۥۖۢۨۜ۫ۦۛۡۛ۫ۨۡ۫ۖۗۢۜۛۥۘۗۘۖۡۥۦۘۢ۫ۛۦۖۤۡۘ۠۟ۙۤۘۡۡۡۜۗۤ۫۬ۚ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ (-690158190)) {
                                                                            case -796423850:
                                                                                str5 = "ۧ۬ۧۖۘ۬۫ۗۦۦۤۖۘۗۢۧ۟ۘۘۚۗ۬ۚۦۚۛ۫ۖۘ۫ۘ۠ۚ۫۠ۦۦۡۚۛۚۖۜۡ۟ۤۦۘۗۦۨۘۨۧۚ۫ۢۦ۠ۘۢۚۦۧ۟ۤۖۗ۫۠ۨۗ۟ۡۡۘۦۢۛ۠ۨۘۗ۬ۖۦۚۧۗۗۗ۬۬ۦۘ۠ۡ۬۬ۚ۬ۙۘۡۡۡۖۘۗۤۦۦ۟ۡۘۡ۟ۘۖۨۜۖۖۨۖۖۗۘ۟۫۠ۛ۬۫ۖۤۤۦۘۖۡۘ";
                                                                                break;
                                                                            case 961702612:
                                                                                str6 = this.Instance == null ? "ۗۜ۠ۤۚۘۤۛ۟ۨ۟ۨۘۡ۫ۦۘۤۙ۠ۧۙۜۘۘۖۥۘۚۦۖ۠ۜۚۚۤۛۧ۟ۡ۠ۧۥ۬ۜۙۖۥۡۖۢۡ۬ۘۖۤۡۧۚۛۙۢۛۡ۠ۦۘۗۨۘۘ۬ۨۘۦ۟ۜۦۖۗۤۧۗ۫ۚۡۦۡۧۘۨ۬۬۫۫ۜ" : "ۧ۠ۤۡۖۘۢۙۨۢۜۚ۠ۢۦ۫ۡ۠ۧۡ۠ۜۛۙۦۙۙۙ۠۫ۗۧ۫ۚۙ۟ۧۘ۠ۧ۠ۦۚۖۘۧۥۧ۫ۨۨۘۡ۫ۜۙ۟ۙ۬۠۬ۜۚۡۘۡۗۥۘۘۦۨۘۢۚۜۘۥۨۙ";
                                                                            case 1844615801:
                                                                                str5 = "ۡۥۚۛۨۡۘۘۚۨۘۙۧۖۘۤ۟ۦ۫ۦۡۘ۬ۨۢۘۡۡ۬ۜۜۦۦۡۜ۟ۦۜۢۗۤۤۖۙۗۨۡۙ۫ۗۛۨۘ۠۟ۘۘۙۧۦۨۗ۠ۘۦ۫ۗ۟۬ۢ۠ۗ۫۫ۚۘۤۗۙ۟ۧۦۦۧۜۛۡۥۥۘۤ۬ۤۢۥۜۘ";
                                                                                break;
                                                                            case 2142930425:
                                                                                str6 = "ۘۢ۬ۖۖۖۘۤ۬ۖۘۦ۟ۙۘۢۜۥۨۘ۠۫ۡۘۨۤۦۘ۫ۨۖۘۙۥۤۜۦ۬ۢۘۦۧۘۨۤۘۘۗ۫ۖۘۡۙۛۜ۫ۘۤۗۗۡۥ۟ۜۘۖۙۗۨۘۘۨۛۢۛۥ۬ۤۦۢۤۛۢۘۢۢ۬ۖۦۛۨۜۘ۠ۘۚۡۗۚۤۧۨ۟ۡۡۘ۠ۖۘۧۖۖۨۜۜۡ۟ۧۘۚۥۘ۠ۛۙۨۦۖۘ";
                                                                        }
                                                                    }
                                                                    break;
                                                                case 1995356319:
                                                                    str4 = "ۖۦۖۘۛۡ۟ۦۜۗۜ۬ۧۗۧۘۘۚۢۥۦۨۦۦۧۦۘۙۧۧۛۨ۬ۦۤۨۘ۬ۖۜۘۙ۫۠ۦۖ۫۟۬ۜ۟۬ۡۘۗۛۜۘ۫ۘ۫ۗۜۜۘۗۙۖۗ۟ۘۘۜ۠ۥۘۢۦۖۤۦ۠ۨ۬ۢ";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 1414594535:
                                                        str3 = "۬ۘ۬ۧۥۨۦۢۧ۟ۗۚۧ۬ۘۘۧۖۨۘ۫ۜۨۧۨۜۘ۬ۖۧۘۤ۬ۨۘۜ۟ۦ۟ۤۡ۠ۦۡ۫ۙۜۘ۬ۡۗۘۖۦۘۨۗۖۘ۠ۘ۠ۛۚۦۘۖ۬۠۟۫ۦۤۦۙۙ۫۟ۢ۟۠ۛۖۜۢۖۢ۟ۗۥۙۛ۬ۦۨۘۚ۠ۖۘۖۘۢۚۧۜۚۘۦۘۚۚۨۤۦۛۜۨۨۘۦۗۙۛۦۢۡۢۤۚۦۖ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case -1212425561:
                                str = "ۥۨ۠ۚۤۙۚۘ۫ۤ۬ۤ۫ۜۙۦ۠ۨۖۘۘۛۡ۠ۢۢۥ۬ۘۧۜۤۡۘۛ۬ۤۥ۫۟ۡۢۦۤۢۙۛ۠ۥۜۤۨۖۙۢۖۡۛۢ۫ۖۥۘۘۥ۠ۖۘۚۥۨۦۜۧۘۨۢۜۘ";
                                continue;
                            case 482228013:
                                str2 = "ۤۨۘۘۤ۠۠ۢۜۘۙۚۥ۠ۖۘۘۘۧۢۡۢۗ۠ۡۜۘ۟ۛۥۘۗۤۧۦ۬ۨۘ۫ۢۖۘۥۖۢ۫ۦ۟ۦۚۜۗ۬۠۫ۥۡۧۘ۫ۡۚۘۢ۫ۛۦۨۘۧۧۨۘۛ۫۬ۥۤۦۘۡۖۨۘۨۗۥۡ۬ۥۘۖۤۨۘۛۘۜۘۗۘۜۛ۫ۨۘۨۙۦۘۖۥ۫۠ۡۗۘۡ";
                            case 1455757391:
                                str = "۫ۨۙۜۤۢۦۦۨۘۜۦۙۦۨۘ۬ۗۘۘۨ۬ۡۜۦۘۜۚ۠ۙۧۨۘ۟ۜۚۜۤ۬ۡ۫ۨۧۢۛۛۘۘۘۦۖ۟ۗ۫۫ۢۦۘۙۗۤۥۨۥۘۥۙۜۘۡۡۘۘۧۧۘۚۛۥۜۗۘۘ۫ۨۜۡۗۥۦۦ۫ۛۖ۫ۘ۟ۡۗۜۘۗۚۦۜ۠ۨۘۖۙۧۢ۫ۙ۠ۦۡۤۙۤۖۧۧۨۤ۠ۛ۫ۦ";
                                continue;
                        }
                    }
                    break;
                case -110026977:
                    new Thread(new Runnable(this) { // from class: kentos.loader.floating.Overlay.1
                        final Overlay this$0;

                        {
                            this.this$0 = this;
                        }

                        @Override // java.lang.Runnable
                        public void run() {
                            String str7 = "ۚۖۤ۠ۙۦۘۗ۬ۖۘ۬۬ۦۘۙۥۡۘ۫ۙۘۘۢۧۖۧ۟ۙۤ۫۫۟ۜۡ۟ۦ۟ۖ۟ۦۖۖ۫۟۠ۥۘ۬ۗ۬ۢۛۙۜۥۦۘۡۤۖۘ۟ۗۚۥ۬ۗ۫ۜۡ۟ۘۖۘۨۦۗۖ۬ۗۜۢۛۖۧۤۢۧۡۘ۠ۢ۟۫ۤۨۘۢۨۧۘۤۛۚۖۢۨۢۥۥۘۚ۫ۦۚ۠ۥۤۜۧۘۛۧۗۡۧ۟ۦۛۨۧۛۡۤ۬۫ۙ۟ۡ۠۬ۙۥۡۘۦۢ";
                            while (true) {
                                switch ((((((((((((((((((((((((((((((((str7.hashCode() ^ 97) ^ 941) ^ 882) ^ 933) ^ 117) ^ 411) ^ 76) ^ 483) ^ 408) ^ 353) ^ 949) ^ 994) ^ 252) ^ 271) ^ 984) ^ 399) ^ 593) ^ 653) ^ 959) ^ 297) ^ 835) ^ 215) ^ 167) ^ 832) ^ 458) ^ 999) ^ 970) ^ 392) ^ Optimizer.OPTIMIZATION_STANDARD) ^ 160) ^ 14) ^ 1644791023) {
                                    case -2136841028:
                                        return;
                                    case -1114244889:
                                        str7 = "۟ۥ۠ۡۜۢ۫ۢۙۦۖۥۖ۫ۛۦۨۢۡۜۨۚۙۘۖۖۤۢ۬ۙۨۡۦۘۖۘۛۙۜۧۥۜۘۘۚ۫ۖۙ۫۠۠ۤۨۘۘ۟ۙۥۘۙۥ۫۟ۥ۠ۤۦۧ۠ۙۖۚ۟ۘۢۥ۠ۢۖ۫ۜۧ۬ۥۖۨۘ۫ۘۘۗۙۖۘۥ۫ۥۘ۟۬ۨۜۗ۟ۦۤۤۛۜۧۘ";
                                        break;
                                    case 811009369:
                                        Overlay.access$000(this.this$0);
                                        str7 = "۬ۧۦۚۨۢۙۤۜۤۙۤۜ۟ۙۜ۫۠ۨۙۚۛۜۥ۠ۡۥۚۤۨ۬ۦۡ۟۫ۛۖ۟ۨۧۡۤۡۙۥۛۜۡۨۢۖۘ۬ۤۦ۟ۖۘۘۤۛۘۜ۬ۗۖۨۛۡۤۤۤۦۘ۟ۜۥ";
                                        break;
                                }
                            }
                        }
                    }).start();
                    str = "ۤۨ۟ۨ۬ۦۘۘۦۥۨۨ۬ۥۖ۠۟ۙ۫ۢۡ۠ۖۡۘ۠۟ۘۘۖۧ۟ۙۡۘۘ۬ۨۨۘ۫ۤۤۢۚۚ۟ۡۜ۫۬ۡۘۢۘۧ۟ۥۚۗۨۗۜۜۘۧۘۘۤۗ۟ۧۧۥۘ۠ۙۨۘۡ۟ۘۘ";
                    break;
                case 46636327:
                    new Thread(new Runnable(this) { // from class: kentos.loader.floating.Overlay.2
                        final Overlay this$0;

                        {
                            this.this$0 = this;
                        }

                        @Override // java.lang.Runnable
                        public void run() {
                            try {
                                Thread.sleep(0L);
                            } catch (InterruptedException e) {
                                e.printStackTrace();
                            }
                            Overlay.access$100(this.this$0, MainActivity.socket);
                        }
                    }).start();
                    str = "۫ۨۙۜۤۢۦۦۨۘۜۦۙۦۨۘ۬ۗۘۘۨ۬ۡۜۦۘۜۚ۠ۙۧۨۘ۟ۜۚۜۤ۬ۡ۫ۨۧۢۛۛۘۘۘۦۖ۟ۗ۫۫ۢۦۘۙۗۤۥۨۥۘۥۙۜۘۡۡۘۘۧۧۘۚۛۥۜۗۘۘ۫ۨۜۡۗۥۦۦ۫ۛۖ۫ۘ۟ۡۗۜۘۗۚۦۜ۠ۨۘۖۙۧۢ۫ۙ۠ۦۡۤۙۤۖۧۧۨۤ۠ۛ۫ۦ";
                    break;
                case 605497864:
                    str = "ۢۨۗۦۡۘ۠۟ۧۘۛۗ۬۬۬ۘ۟ۛ۬ۚۛۧۧۥۘ۠ۚۥۗ۠ۡۥۜۧۖۜۢۚۘۢۨۨۙۦ۬ۖۘۛۘۢۥۘۨۘۤۥۖۘۙۙۗۦ۟ۚۨۚۛۘۙۜۘۨۘۨۘ۫ۖۖۘ۬ۡۧۘۜۥۛۥ۟۫۠۠ۚۧ۠ۡۘ۠ۘ";
                    break;
                case 802700796:
                    return;
            }
        }
    }

    static /* synthetic */ boolean access$000(Overlay overlay) {
        String str = "۠۬ۚۜۤۥۘۥۚ۠۫ۧۥۘۚ۠ۘۘۙ۟ۜۛۨ۫ۧۛۗۥ۠ۘۜۗۦۢۦ۠۫۬ۗۜۦۚۘۡۘۨ۠ۖۥۗۧۗۘۦۗۨۖۦۛۘۢۤۥ۫ۙۙۥۦۜ۬ۙۦۛۜۥ۬ۡ۫۠ۗۡۘۢۜۘۛ۟ۙۛۜۘ۠ۢۥۘۗۚۡۖۨۘ۫ۙۡۛۖۦۨۧۢ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 150) ^ 376) ^ 779) ^ 152) ^ 120) ^ 467) ^ 437) ^ 332) ^ 42) ^ 468) ^ 358) ^ 551) ^ 538) ^ 384) ^ 460) ^ 811) ^ 705) ^ 66) ^ 466) ^ 193) ^ 414) ^ 331) ^ 550) ^ 616) ^ 412) ^ 410) ^ 456) ^ 427) ^ 159) ^ 232) ^ 624) ^ (-258809917)) {
                case -2130162126:
                    str = "ۜۙۨ۟ۡۡۨۤ۟ۙۗ۟ۦ۠ۥ۟ۖۘ۠ۗۥ۬ۖۡۥۧۦۘۨۚۖۘۡۨۢۖۤۨۘ۬ۚ۬ۖۧ۬۫۫ۦۨۤ۫ۦۨۘۘۛ۫۟ۧۦ۠ۨۘۧۜۘۘ۠ۧ۬ۤۤ۠۠۠ۢ۫ۙۖ۬ۜۢۤۢۦۢۛۦۘ۫ۗ۟۠۬ۦۘ";
                    break;
                case -1161172073:
                    return overlay.getReady();
            }
        }
    }

    static /* synthetic */ void access$100(Overlay overlay, String str) {
        String str2 = "ۙۦۥۛۡ۫ۛۡۨۘۜۖۡۘۖۨ۬۟ۡۧۘۖ۫ۥۗۛۦۖۢۡۘ۟ۚۦۘۤۡۧ۟۠ۡۘۢۜۘۗۗۧۗ۠ۜۘۘۧ۫ۨۦۤۜۢۖۙ۫ۙۥۗ۠ۗۚۖۘۛۥۘۙ۬۠ۡ۟ۥۙۚ۫ۥۡۨۦۧۙۖۨۚ۠ۜۘ۠ۢۜۘ۟ۤۡۘۛۧ۟۠ۥۖۘۙۘ۟ۚۨۜۢۜۨۨۡۥۘۜۚۜۘۧۙۥۘ۠ۜۥۛۙۜۨۛۖۧۦۘ۬ۤۤۚۛۡ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 315) ^ ViewUtils.EDGE_TO_EDGE_FLAGS) ^ 450) ^ 818) ^ 57) ^ 520) ^ InputDeviceCompat.SOURCE_DPAD) ^ 463) ^ 947) ^ 853) ^ 343) ^ 781) ^ 575) ^ 309) ^ 404) ^ 688) ^ 213) ^ 137) ^ 776) ^ 766) ^ 554) ^ 10) ^ 854) ^ 826) ^ 694) ^ 986) ^ 659) ^ 699) ^ 813) ^ 85) ^ 284) ^ (-1633832865)) {
                case -1910827879:
                    overlay.Shell(str);
                    str2 = "ۗۗۡ۠ۛۜۡۨۨۘۚۜۖۘۤۢۥۘ۠ۢۛ۟ۛۦۗۡ۠ۗۦۦ۟۟ۡۛۦۦۘۖۚۙۥۤۤۗۜۧۡۚۨۘۢۤ۬ۛ۠ۧۨۘ۠ۤۗ۟ۤ۟۬ۦۜ۠ۦۡۘ۠ۨۡۦۦۖ۟ۡۧۘۜۜ۠ۘۦۨۚۙۖۘ۫۟ۛ۠۫ۦۛۦۖۨۤ۫۫ۙۥۧ۟ۤۗۘۤۥۤۦۘۦۖ۫ۜۘۘۖۧۖ۟ۘ۠";
                    break;
                case -1463424107:
                    return;
                case -640011082:
                    str2 = "ۜۨۜۙۛۙۜۦۦۘۢۤۢۥۗۗۘۚۨۘۡ۫۟ۢۨۢۖۚۧ۬ۨ۫۫ۘۢۧۛۗۚۗۚۡۜۧ۫ۛۤۜ۠ۜۘۥۢۢۧۗۨۘۢۥۢ۬ۘۘ۬۫ۡۚۜۗۚۢۡۘ۟ۘۙ۟ۦۨ۫ۘ۬ۦۧۥۘۨۢۤ۠۠ۡۗ۬ۖۘۤۙۖ۟ۤۖۦ۫۟ۚۡۨۢۡۖۘۤۡۥۘۧۨۡۘۢۤۥۘۗ۟ۧ۠ۜۜۘ۠ۚۦۘ۬ۧۘۘۢۡۧۤۧۗۦۖۜۘ";
                    break;
                case 944239396:
                    str2 = "ۜۙ۠ۜۖۢۗۦۘۘۖۨۥۦ۠ۘۤۥۚۡۘۛۛ۠ۚۤۛۢ۫ۧۖۚۚۦۘۚۥۨۙۤۤۛۜۛ۬ۙ۟ۢۨۘۖۜۦۖ۠۫ۗۛۤۚۡ۫ۗۡۘۘۤۨ۬ۛۘۖۘ۠۫ۤ۠ۚۖۡۘۗۗۗۛۢۖۘۚۥۨۘۧۨۖۜۙۛۜۡۘۧۤۢ۠ۨۦۙۤۖۜۖۘۨۘۗۦ۬ۨۘۖۜ۟ۨۤۙ";
                    break;
            }
        }
    }

    public static boolean getConfig(String str) {
        Context context = null;
        String str2 = "ۡۗۡۨۨۜ۬ۛۦۘۡۧۨۚۢۦۘۛۥۨۤۛۦ۠۠۠۫ۥۜ۟ۨۘۘۜۙ۫ۢۡۚۥۤۢۡۘۢۧۖۨۥۥۥۙ۠ۥ۫۫ۗۨۥۢ۬ۢ۠ۖ۠ۨۧۘۧۢۨۘۥۡ۬۬۫۟ۜ۫ۛۗۚۛ۠ۛۨۘۡۙ۬۟۠ۨۛۚۨۘۡۚۘۧ۠ۡۥ۫۟ۨ۟ۚۙۢ۬ۗۜ۟ۡ۟ۛۦۤۖۘۜۤۙۙ۬ۗۛۛۦۘۗ۠ۦۘۖۛۡۛ۬ۖ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str2.hashCode() ^ 578) ^ 121) ^ 598) ^ 505) ^ 448) ^ 861) ^ 328) ^ 350) ^ 202) ^ 269) ^ 118) ^ 182) ^ 968) ^ 949) ^ 556) ^ 940) ^ 176) ^ 70) ^ 702) ^ PointerIconCompat.TYPE_CELL) ^ 646) ^ 432) ^ 428) ^ 607) ^ 650) ^ PointerIconCompat.TYPE_TOP_LEFT_DIAGONAL_DOUBLE_ARROW) ^ 945) ^ 244) ^ 43) ^ 744) ^ 626) ^ 1629740566) {
                case -1562674731:
                    return false;
                case -1440272855:
                    str2 = "ۛۛۛ۟ۥۛۖۦۡ۠۫ۦ۬ۤۨۘ۟ۖۘۧۖۘۘۗۧۖۚۡۚ۬۟ۜۘۚ۟ۜۘ۫ۥۜ۠۫ۨۡ۠ۨۘۤۡۤۛۘۥۡ۟ۤۙ۠ۨ۟ۥۢۜۜۛۦۦ۠ۢۚۥۨۧۘۛۥۜۙۘۧۘۜ۬ۚۚۖۨ۬ۢۘۢۧۚۡۙۥۘۘۢۥۡۛۡۘ۟ۙۤۤۡۡ۬ۘۛۢۗۡۘۤ۫ۘۤۖۦۘۡۧ۠ۜ۬ۛ";
                    break;
                case -130372695:
                    return context.getSharedPreferences(Deobfuscator$$app.getString(-3440721816319778633L), 0).getBoolean(str, false);
                case -82498654:
                    context = ctx;
                    str2 = "۟ۘۤۚۤۡۖۖۥۨۦۗۢۡۙ۬ۙۚ۬۬ۡ۫ۚۢ۬۠ۖۧۛۖۘۦۢۧۘۖ۠ۥۖۡۘۦ۠ۜۖ۠ۥۘۗ۠ۦ۟ۙۘۙۛۨۘۨۘۘۥۛۥۚۦۗۘ۫ۢ۬۟ۙ۟ۘ۬ۜۦۘ۠ۧۦۘۖۦۡ۫ۙۙۤ۫ۘۘ۫ۗۜۥ۫ۤۧ۬ۛۖۜۘۖۘۦۙ۫۟۫ۨ۟ۙ۫ۗۧۥۘۘۤۘۘۧۙۖ۠ۥ۬ۡۤ۬ۚۥۨۦۦۘۡۥۧۘ";
                    break;
                case 452372545:
                    String str3 = "ۚۘۘۦۤۗۧۥۦۘۛۧۢ۠ۜۤ۟۟۠۫ۥۢۡۦۜۘ۟ۙۦۘ۠۫ۦۘ۠ۛۦۡۥۥۚۧ۬ۢۚۖۘ۟ۡۜ۟ۖ۬ۦ۬ۙۗ۟ۦۘۛۥ۬ۙ۟ۦ۠ۢۤۢۖۘۙۖۧۘۢۦۤ۟ۤۦۘۢۧۨۘۧۚۙۛۜ۠ۘۜۥۚۜۜ۫ۦۘۥ۫ۙۤ۫ۢۥۚۧ۫۬ۙۡ۫ۗۙۨۘ۫۬ۜۜ۬ۦۘۨۡۦۘ";
                    while (true) {
                        switch (str3.hashCode() ^ 643428403) {
                            case -356360621:
                                str3 = "۟ۜۦۘۡۜۡۘۦۖۜۨۦۜۙۢ۟۟ۜۘۥ۫ۨۘۘۦۧۘۘۗۖۤۙ۫ۜۚۥ۟ۧۘۙۚۛۦۢ۠ۙۡۘۙ۠ۥۘۦ۠۟۠ۡۧۘۤ۫ۨۦۡۥۤ۬ۘ۫ۥۘ۠۟ۖۜۛۨۘۛۡ";
                            case 528356271:
                                str2 = "ۢ۫ۡۘۙۙ۟ۘۜۖۘۨۚ۬ۚۡۖۤۧۜۘۙ۟ۙ۟ۦۚۙ۬ۥۘۡۤۥۘۨۧۚۡۢۘۥۥ۟ۨ۟ۛۗۘ۟ۙۜۨۛۧۨۘ۬ۨۜۘۥۛۨۨۤۚۦۙۦۦ۠ۤۗۗۡۘ۫ۡۤۚۥۜۘۢۛۤ۬ۘۥۘۜۥۜۜۧۦ۬ۢۡۗۨۜۜۙ۠ۛۨۘ۟ۨۛۢۤۧۘ۠ۦ۬ۗ۬ۛۢۦۛ۫ۚۗۛۢۛۨۜۛ۟ۜۥۤ۠۠۟ۥۘ۫ۚۦۘ";
                                continue;
                            case 813465148:
                                String str4 = "۠۟ۘۘ۠ۘ۟ۡ۬ۛۙ۬۠ۘۥۦۖۡۢ۟ۨۦۘۧۨۡۜۚۥۘۛۧۥۘۧۥۖۜۤۧ۠ۧۨۘۖۦۜۜۘۘ۟ۗ۬ۖۘۥۖۨۨۘۜ۫ۦۥۘ۠ۡ۟ۦۘۢۧ۠۬ۨۛۛۢۤۢ۠۟ۧۘ۠۬ۥۨ۫۬ۥۗۧۨۘۥۘۧ";
                                while (true) {
                                    switch (str4.hashCode() ^ 1096831232) {
                                        case -2016172461:
                                            str3 = "۬۟ۛ۠ۤۥۘۤۧۢۛۜ۬۟ۡۢ۠۠ۨۘۨۢۜ۫ۘۘۘۤ۟ۦۘۙ۟ۥۘۛۦۥۘۜۥۖۘۚۡۢۛۦ۟ۗۡۛۜۦۥۥۘۜۨۘۧ۫ۥۥۜۙ۬۬ۨۘ۠۟ۦۘۘۦۛ۟۟ۖۘۙۡۘۦۛۥۥۢ۟ۤۤ۬ۚ۬ۨۦۢۡۖۥۦۘۥ۠ۜۘۦۙۘۧۨۧۙ۫ۙۥۜۤ۬۠ۛۙ۟ۦۘۥۖۨۘۨ۬";
                                            break;
                                        case -1879182993:
                                            String str5 = "۫ۜۗۦۚ۟ۧۦۥۙۢۜۘۖ۬ۨۘۡۧ۫ۜ۠ۤۛ۟ۧ۟ۥۧ۠۫ۦۘۤۨۨۘۥۡۙۜ۬ۜۘۘۖۢۦۜۤۙۥۖۘۥۜۦ۠ۘ۠ۚۖۡۜۙۤۢۖۘۘ۟ۨۢۜۘۚۛۘۨۘ۠ۤۦۘۗۤۨۘ۬ۘۛۤۧۦۥ۠ۘۘۙۡۢۛۘۜۘۙۜۘۤۜۘۗۖۨۜ۫ۖۘ";
                                            while (true) {
                                                switch (str5.hashCode() ^ (-1321566813)) {
                                                    case -1240999230:
                                                        str4 = "ۢ۠۬ۘ۟ۨۘۥ۠ۘ۫ۖۥۘۦۤۢۗ۬ۦۦۙۡۘۛۤۛۚۘۜۙ۟ۤۦ۟ۦۘۨۛۧۚۤۥ۠ۘۧۖۘۤۧ۫ۛۥ۠ۚۦ۫ۙ۟ۘۘۨ۟ۢۧۦۥۡۘ۫ۨ۬ۘۜۘۘۛ۟ۦۘۚۨۜۘۦۘۙۧۥ۟ۡ۬۠ۜ۫ۘۘ۟۠۠ۦۧۨۘۛۜۖۘۡ۠ۡۘۜ۫ۜۘۜۦ۠ۜۖۥۘۖ۠ۜۘ۬ۥۧ۫ۛۛۙۜۚۜۛ۠ۧۙ۠ۙۖۡۘۤۚۥۘ";
                                                        break;
                                                    case -625080738:
                                                        str5 = "۬ۦۨ۫ۙۨۘ۫ۦۗۢۢۦۘۘۡۧۘۜۛ۟ۖ۟ۧ۫ۖۡۡۘ۠۟ۦۘۢ۠ۘۘ۬۟ۜۘۨۘۜ۟ۚۦۘۤ۟ۖۘۛۜۦۘۨۜۜۘۢۦۙۦ۫ۢۥۤۢۛۦۘۨۥۥۨۢۚۤۚۖۙۤۡ۬۟ۧۧۢ۫ۙ۬ۥۙۘۗۡۜۘ۫۬ۥۧۡ۠۫۫ۚ۠ۙۥ۫ۜۙ";
                                                    case 298817258:
                                                        str4 = "ۖۦۚۖۧۙۖۖ۠ۜۡۧۗۡ۬۠ۚۙۡۨۡۘۛ۠ۛ۟ۗۙۦۧۛۛۧۚۥۙ۬ۘۘ۫ۜ۠ۙۥۚۛۘۦۨۛ۠ۥۤۚ۟ۗۤۤ۠ۢۙۡۥ۬ۡۛۗ۠ۖۘ۫ۚۡۘۖۙۚۤۥۦۘۜ۠ۛ۫ۥۧ۬ۡۜۦۖۘۦۤۜۚ۠ۚۢۚۤۧۢ۬ۘۢۥۗۡۛ۟۠۫ۖۙۙ۬ۨۡۚۖ۠ۢ۬۟۫ۤۘۡ۬ۢۙۨ۠";
                                                        break;
                                                    case 301058697:
                                                        String str6 = "ۛۙۖۘۖۛۥۘۡۖۘۡۥۚۤۗۡۘۛ۫ۧۚۤۜۙۥۧۘۨۦۦ۟ۘۥ۬ۧ۟ۦۥۥ۫ۖۨۗۧ۠ۢۚۖۘ۟ۥ۫ۜۡۛۧۥۙۡۢۦ۬ۜۛۧۢۡۦۘۡۚۦۗۡۘۜۘۜۚۤۨۚ۫ۗۦ۠ۜ۬ۜۘۘۡۢۖۚۤۨۥۖۜۘۥ۟ۚۤۤ۬۫ۢۥۥۧۦۥۘۛۙۙ۫۠ۘۨۢۢ";
                                                        while (true) {
                                                            switch (str6.hashCode() ^ (-856129059)) {
                                                                case -1685934721:
                                                                    String str7 = "ۧۦۘۘۗۤۜۚۥ۫ۙۙۘۘۜۛۨ۬ۨۨ۠ۡۦۛۛۡۘ۫ۢۡۘۢۘۨ۬ۜۙۗ۬۬۟ۨۘ۟ۖۛۗۛ۬ۧ۫ۦۘ۠ۘۤۧ۬ۦۘۜۡۤۧ۟۬ۢۡ۬ۙۙ۠ۡۛۙۧۘۚۦ۟۫ۙۚۨۤ۟ۚ۫ۛۥۗۨ۟۠";
                                                                    while (true) {
                                                                        switch (str7.hashCode() ^ (-1347907146)) {
                                                                            case -644193449:
                                                                                str6 = "ۦ۟ۦۦۚۖۤۖۚۦۥۚۛۗۧۗۗۜۘۚۡ۬ۢ۫ۘ۟ۛۜۚۚۚۧ۬ۚۦۛۢۙۛۧۨۜۛۥۙ۫ۥ۫ۗۡۘۛۦۖ۟ۤۗۙۖۙۤۚۜۘۚۚۘۡۛۛۡۜۜۘۙۡۧۘۙ۬ۥۗۧۛۤۢ۟۫ۘۗۛۤ۬۠۠۫ۧ۫ۜۘۧۡۧۘۤ۠ۧۗۧۦۢ۟ۥۨۛۙۤۦۘۥۦۜۛۢۙ";
                                                                                break;
                                                                            case -321912082:
                                                                                str6 = "ۦۦۜۤ۬ۥۘ۬ۥۢ۫ۦۜ۟ۗۤۘۡۖۙۚۢۦ۫ۜۘ۠ۛۡۘ۬ۛۧ۬ۡ۟۬ۖۧۘۢۨۖۦۧۢۡ۟۬ۜۧۦۤۦۜۖۢۢ۬۬۠ۥۢ۬ۥۘۘۘۙۚۙۛۖۚۙۡۨۘۘۙۖ۠۬ۙۗ۟۫ۚ۠ۦۘۨۤۥۘۨۘۧۚۖۜۡ۬۬ۧۧۦۧۦۜۙۖۖۘۛۨۥۖ۠ۨۘ۟ۧۢۦۗ۬ۛۨۧۤۤۧۢۢ۬ۨۦۥۛۘ۠ۙ۠ۡۘ";
                                                                                break;
                                                                            case 1329733828:
                                                                                str7 = context == null ? "۫ۦۙۜۖۙۥۗۡۜۨ۟۠۬ۧۜ۟ۖۘۦۦۖۧۦۘۘۥۥۖۘۗۤۘۤۥۖۘۥ۫ۜۘۥۡ۠ۥۗ۠ۢۙۗۘۛۘۘۛۚۥۥ۟ۥۛۘۚ۫ۦۡۤۜۨۗ۫ۥۖ۟۬۬۬۟ۦۗۡ۟ۜ۫ۥۘۜۘۖۢ۟ۛۢۥۧۚ۬ۙۜ۬ۧۦۖ۫ۖۢ۬ۦۛۚۢۙ" : "ۗۚۖۧۘۥۘۢۥۨۡۙۡۨۧۥۘۖۨۦۘۥۜۜۘۤۨ۬ۢۨۜۘۖۛۦۘ۠۫۫ۦۡۘ۠ۢ۬ۤۛۜ۬ۛۙۙۡ۟۬ۦ۫ۜۙۥ۫ۜۘۘۤۖ۠ۗۖ۟ۗۛۨ۠ۦۘ۫ۛ۫۬ۗۙۡۢۦۘۚۡۘۘۨۦ۬ۚ۬۬ۧۥۘ۟۬ۜۘۢۖۤۜ۬ۛۛۧۨۜۘۖۘ۫ۘۥۙ۠ۦۘ۫ۤ۬۫۠ۡ۫ۜۜۘ";
                                                                            case 1592871518:
                                                                                str7 = "۠ۘۢۦۖۜۘ۟ۗۢۤۗ۠ۨۘۦۘۢۨۗۚۨۡۦۙۘۡ۟ۨۡ۫ۥۦۤۨۧۨۘۤۢۢ۟ۦ۟ۡۗۢۘۚۚ۫ۚۙۚۛۤ۫ۥۖۘ۫ۤۘۘ۬ۖۖۘۨۖۖۘ۠ۗۜ۬۟ۧۚۨۧۗۜ۫۬ۗۖۧۖۗۥ۬۫ۡۘۥۗۥ۠ۦۗۢۙۡۗۡ۬۫ۚۖۖۘ";
                                                                        }
                                                                    }
                                                                    break;
                                                                case -4022253:
                                                                    str5 = "ۡۢۘ۠ۙۨۘۢۚۤۜۚۙ۫۬ۧۨۡۡۥۥۚۢۡ۟۬ۧۢۨۧۨۛۜۧۘۖۨۦۧ۬ۤۦۨۘۥۗۦ۫ۙۤ۟۟ۛ۠ۖۨۚ۬ۚۗ۬ۡۘۗۦۨ۬۫ۦۘ۟ۙۤۙ۟ۦۙۦۛ";
                                                                    break;
                                                                case 1306886772:
                                                                    str5 = "ۢۡۨۖۜ۬ۖۙۥۜۡۡۧۡۜۘۗۡۙۚۡ۟ۨ۬ۖۘۖۘۧۘ۫ۚۦۧۡۡۘۤۢۜۘ۠ۧۛۚۘۘۘۨۘۤۗۘ۫ۤۥۦۘۡۖۡ۟ۗۛۡۘۖۜۧۜۤۖۚ۫ۚۡۘ۫ۘۜۦ۟ۦۡۧۥ۬ۤۚۥۛۘۖۨۖۘۦۘۧ";
                                                                    break;
                                                                case 1644961248:
                                                                    str6 = "ۗۜۙۖۨۨۦۜۥۦ۫ۜۗۤۗ۠ۤ۟ۢ۬ۥۥۛۘ۟ۚۜۗۡۘۜ۠ۖۨۘۥۘۢۜۦۘۜۧۖ۬ۘۨۚۧۥۘ۫ۖۥۗۛۡۘۖۧۧ۬ۧۚۖۥۥۤۥۘۘۨۛۛۧ۟ۜۤ۫ۡ۫ۖۖۢۗۜۘۖۘۘۘۙ۬ۖۘۦۤۘ";
                                                            }
                                                        }
                                                        break;
                                                }
                                            }
                                            break;
                                        case -1161112521:
                                            str3 = "ۨۘۖۗۙۙۗۛۦۘۛۘۜۘۢۥۖۘۦ۠۬ۤ۟ۛۚۤۜۘۖ۠ۦۘۢۘ۠ۢ۫ۜۖۤ۬ۡ۬ۘۚۦۜۗۧۡۘۘۙۖ۬ۧۡۘۧ۟ۚۥ۟ۡ۬ۛ۬۠ۦ۠۠ۘۢۚۗ۠ۦۖ۟ۢۖۤۘ۟ۚۢ۬ۨۘۡۥۥۢ۫ۜۜۙۙۥۡۨۘ۠ۚ۠ۚۙۛۜ۟ۘۘ۫ۥ۟ۦۤۘۘۜۡۘۢۗۨۘۥۦۗۖۨۘ";
                                            break;
                                        case 692114921:
                                            str4 = "ۡۗۙۙۨۢ۬ۛ۫ۙۜ۫ۘۘۤۘۗۗۗۜۘۘۦۛۗ۫ۗۨۘۜۖۘۘ۠ۥۘۘۛۖۡ۫ۖۖۘۨ۟ۗ۟ۘۜۘۙۗۤۦۖۧۤ۫ۦۘۧۥۗ۫ۙۡۘۥۦۛۤۚۘۧۧ۫ۤۤ۟ۧۖۨۘ۬ۗۖۘۡ۬ۛۥ۠ۦ۫ۡۜۘ۟ۗ";
                                    }
                                }
                                break;
                            case 2034418778:
                                str2 = "ۦۚۜۘۘ۠ۡۘۥۗۨۡۜۘۖۙۦۘۥ۟ۗۛۡۘۖۤ۟۠ۦۨۘۡۖۨۚۚۦۢۤۘۘۖۥۖۗ۬۫ۗۚۖۦ۫۬ۨۤۜۘۢۢ۬۬۫ۨۘۛۖۤۨۗۛۤۜۖۖ۫ۤ۫ۜ۠ۤۨۡ۬ۤ۟ۢۨۘۜۙۤۦ۫ۛۘۘۥۧۤۡۨۡۧ۬ۡۨۛۘۘۦ۟۫ۨۛۘۧۨۚ۠ۜۦۘ۟۫۫ۜۖ۟ۧۨۜۘ۬ۘۦۘۥۦۗۦۗۢۛ";
                                continue;
                        }
                    }
                    break;
            }
        }
    }

    private int getNavigationBarHeight() {
        String str = "ۛۥ۠ۜۨۢۦۚۚۗۘ۫ۦۤۛ۟ۤۨۘۘۥۤ۫ۦۚۛۙۢ۬۬ۤۛۡۨۗۦۧۘۦۢۚۘۗۖۘ۟۟ۧۡۧۨۘۚ۠ۚۖۢ۟۬ۢۜۘۖۤۜۙ۫ۖۘۢ۟ۦۚۜۜۜۡۤۜۥ۫۠ۗ۬ۚۡۦۦۖۡۛۜۛۘۨۘ";
        int i = 0;
        boolean z = false;
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 628) ^ 914) ^ 355) ^ 280) ^ 476) ^ 203) ^ 195) ^ 594) ^ 435) ^ 796) ^ 894) ^ 1022) ^ 963) ^ 402) ^ 497) ^ 500) ^ 321) ^ 463) ^ 350) ^ 92) ^ 66) ^ 464) ^ 906) ^ 566) ^ 675) ^ 508) ^ 528) ^ 12) ^ 194) ^ 675) ^ 886) ^ (-1355644068)) {
                case -1850154025:
                    return getResources().getDimensionPixelSize(i);
                case -1163741707:
                    return 0;
                case -733479593:
                    String str2 = "ۚۦۢۘۖۨۘ۟ۡۡۤۥۜۘ۟ۤ۫ۦۦ۠ۛۜۘۤۧۨ۫ۥۤۦۢۤۙۙۧۦ۬ۖۘۡۤۛۘ۟ۛۥۢ۠۠ۙۦۢۗۗۘۘۦ۠ۚ۟ۧۥۘ۠ۖ۫ۡ۠ۚۧۖۘۨۙ۠ۙۚۡۘۜۗۖۘۤ۠ۢ۠ۘۛۚۗۛۧۛ";
                    while (true) {
                        switch (str2.hashCode() ^ 1066024383) {
                            case -525001226:
                                str = "ۥۦ۫ۢۥ۬ۥۤۡۘ۫۫ۘۚۜۡۘۦۜۘۜ۠ۘۘ۫۟ۜۘۥۖۢۜۦۡۘۙۤۨۘۢۥ۠ۖ۫ۘۢۙۡ۠۠ۦۘۗۧۙۧ۬ۡۘ۫ۖۜۘۥ۫ۡۘ۟۠ۘۜۖۖۙۘۦۘۢۢۧ۟۠ۖۘۡۘۦۘۛۖ۠ۧۗ۫۫۟ۡۦۙۙ۫۠ۖۘ";
                                continue;
                            case -388584530:
                                break;
                            case -221520179:
                                str2 = "ۜۡۨ۠ۖۧۡۦ۫ۡ۫ۘۖۨۜۘۧۗۦۘۜۥۥۨۛ۠۫ۤۥۚ۟ۧۨۘۚ۟ۧۗۚۨ۟ۛۛ۠ۢۢۙۦۥۧۜۗۡۜ۠ۜۢ۟ۗۥۢۙۨ۬ۖۜۘ۫ۘۚ۟ۨۘۡ۬ۧ۟۠۟ۧۥۦۘ۬ۨۛۛۦۜۚ۬ۨۦۜۦۘۢۨۗۜۧۦۘۖ۬ۥۙۤۜ۫ۡۧۨ۟ۘۗۥۥۘ۬ۙۖۘ۠ۥۖۘ";
                            case 1437904859:
                                String str3 = "ۧۢۥۘۖۘۦۘۧۧۦۘۗ۠ۗۢۨۘ۬۫ۚۖۧۚۨۦۧۘۙۘۚۦۜۥۗۢۥۘۛۨۢ۫ۧۥۧۗ۠ۨۨۜۘ۠ۧۛۖۤ۬۟۠ۘۖۦۨۘۛۗۤۗۗۖۘۙۡۖۗ۟ۛۥۧۢۧۖ۠ۗ۫ۜۘۖۡۡۘۧ۟ۙۥۨۛ۟ۨۡۘ۬۟ۦۘۥۖ۫ۢ۟ۘۘۧۨۖۡ۟ۡۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-917054059)) {
                                        case -873229636:
                                            str3 = "ۥۦۖۘ۬ۘۨ۠ۘۦ۟ۜۨۘۧۗ۟ۧۧۖۤۗۦۘۦۧۨۤۥۤۢۤۚ۠ۗۨۘۥۡۗۛۙۢۜۜ۬ۘۦۘۖ۫ۧۗۥۘۨ۬ۡۖۖۖۖ۫ۚۙۖۘۗۢ۟۬ۗۨۗۜۗۤ۫ۖۨۘۡۚۨۘۡۧۜۜۛۜ۟ۘۨۢ۬ۘۘۢۨۘ۫۠ۛ۫ۚۗۛۛۖۘ۠۬۫ۢۢۜۘۧۗۨۘۜۢۤۜۦۜۘۗۢ۫ۢۨۧۜۜۘۛ۠ۨۤۜۙ";
                                        case -732387096:
                                            str2 = "ۚ۫ۘ۫ۤ۠ۥ۬۠۠ۚۙۧ۬ۥۘ۬ۖۨۙۙۖۗۘ۟۫ۥۗۦۜۡ۟ۗۦۨۘۨۥۖۘۥۥۧۘۡۧۘۘۜۙۥۘۧۖۢ۬ۚۖۘ۫ۖۧۖۨۖۘۥۥۥۡۖ۟ۖۚۨۘۗۢ۟۠۫ۦۜۜۥۘۧۙ۟ۤ۫ۙۚۧ۠ۗۘۘۙۤۘۘۘ۠ۖۘۜۚۨۘۨۙۙ۫۟ۜۨۚۨۘۗ۫۫ۤ۬ۨۘۡۙۢ۠ۤۚۛۙۜۘۨ۬ۖۘۛۧۨۘۥۚۘۘ۟۠ۢ";
                                            break;
                                        case 1001333776:
                                            String str4 = "ۦۘ۬ۗۚۜۘۥ۬ۦۤ۠ۗۨۛۘۘۚۨۙ۬۬ۤۤۙۦۘ۬۟ۤۥۗۖۘ۟ۙۡۡۦۨۘۛ۠ۦۙۦۢ۠ۤۘۘۙۘۗۡۨۦۘۡ۬۫۬ۢۖۘۛۚۡۢ۬ۥۘۧۗۜۘ۠ۛ۫ۖ۟ۤۙۢۛۦۦۚۘۥ۬ۙۥۡۚ۠ۥۤۚۧۘۡۘۖۡۘۘۧۛۦۘۨ۫ۖۘۥ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-934983306)) {
                                                    case -1427595070:
                                                        str3 = "ۦۚۡۘۥ۠ۨۘۜۛۚۛۡ۠ۘۥۘۥۛۨۘۤۧۡۖۦۜۧۛۜۖۨۖۘ۬ۖۧۘۘۤۙ۫ۗۙۜۨ۠ۙۨۢ۟ۜۦۧۛۜۘۘۡ۬ۨۙ۠۫ۥۨۖۘۜۨۥۘۤ۫ۘۘۤۡۧۜۜۥۘۖۡ۫۠۠ۡۘۙۦۦۘ۠ۦۧ۠ۢ۠ۨ۫ۘۘۦ۫ۦۘۥۛ۫ۢۡۦۖ۠";
                                                        break;
                                                    case -1113963393:
                                                        str3 = "ۘۥۡۢۧۢۧۛۙ۟ۧۚۛۗۥۙۥۖۜ۟۠ۧ۠۫ۚ۫ۨۧ۟۠۬ۗ۫ۛۨۘۖۛۢ۬ۘۙ۠۫ۤۜ۬ۦۡۜۘۥۡ۬ۡۖۦۙۤۨۗۖۙۖۨۖ۟ۚۘۗ۬ۨۘۡ";
                                                        break;
                                                    case -257614343:
                                                        str4 = "ۚۨۨۗۘۦۘ۫۟ۦ۫۫ۧ۫ۥۖۘۡۜۧۘ۠ۗۖۘ۠ۢۢۙۗ۠ۢ۫ۗ۫ۙۡۘۥۦۧۥ۬ۖۦ۟ۖ۬ۗۘ۬ۡۘۛۚۢۡ۠ۜۙۦ۠ۘۧ۫ۜۦۥۘۚ۬ۦۥ۟ۦۘ۬ۘۡ۬ۡۘۗۘۨۘ۬ۨۜۘ۬۠ۨۘۦۨ۠ۥۦۘۗۢۢۜۦۘۜ۫ۗ۠ۗۤۚۡۚ۫ۦۚۧۘۙۚۥۢۢ۬۬ۧۨۘۘ";
                                                    case 1306012990:
                                                        String str5 = "ۨۢۡۘۖۧۘۖۧۨۘ۟ۢۡۘۗۘۨۖۨۥۥۘۜ۫ۙۖ۟ۛۨۘۤ۟ۙۛۗۥۛۧ۠ۡۨۘ۬ۙۤۛۡۧۚۧۡۛ۬۬ۚۡ۫ۨۢۚۚۗۘۘ۠ۦۦۘۙۤۚ۬ۦۡۧۢۡۘۛۗۘۘۡۢۢۢ۟ۛۖۗۖۘ۫ۦۥۘ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ (-1870693648)) {
                                                                case -2088914165:
                                                                    str4 = "ۨ۠ۨۘ۠ۦۘۛۤۡۘۧۗۡۘۗۥۙۙۜۘۢۡۥۘ۬ۤ۬ۦۖۦۙۢۦۙۥۧۘۨ۠ۖۤ۬۟ۧۢۙۗ۫۟ۜۖۡۘۦۡۤۗۥۘۘۢۥۤۨۢ۠ۦۗۤۛۧۡۦ۠ۢۘۥۘۘ۟ۡۢۙۙۧۧۜۛۡۜۘۘۙۖۘ۟ۘۨۘۙۙۖۙۚۘۘۖۘۤۥ۬ۚ۟ۥۛۦۚۤۢ۫ۨۘۧۖۛۤۤۥۘۨۚۜۘۧۘۧۨۛۧۥۜۘ۟ۛۗۖ۠ۥ";
                                                                    break;
                                                                case -1133257194:
                                                                    String str6 = "۬ۜۥۘۚۦۙ۟ۗۘۛ۬ۡۧۦۖۘۜۡۦۘۤۜ۫ۦۡۖۛۤۨۜۡۙ۟۟ۛ۫ۚۨۜۦۧ۬ۛۨۗۘۘۧۨۜۦۡ۟ۨ۬ۜۘۘۙۧۦۥۗۗۚۙۨۦۚۥۨۨ۠ۘۡۖۡۥۘ۬ۙۡۘ۬ۢۗ۫ۚۙۡۦۘۨ۠ۤۤۨۨۘ۬ۢۥۜۤ۬ۙ۟ۚۘ۫ۜ۟ۛ۬ۙۦۨۡۨۘۗۚۥۘۥۚۥۘ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ (-109701793)) {
                                                                            case -1887853781:
                                                                                str5 = "ۨۚۥۘۦۢۖ۟ۘۚۖۤۦۘ۬ۥۚۢ۠ۥۦ۠ۚۤ۟ۘۡۧۥۘۚۥۘۗۛۡۙۤۤ۟ۧۨۗۗۖۤۜۘۘۜۦۤۘۨۚۚۧۦۚ۟ۜۙ۫ۨ۟ۗۖ۠ۖۘۨۥۥۘۖۨۦۘۡ۫ۚۧۘۘۜۨۦۥۧۘۗۧۛۚۧۖۘۤۦۡۘۥۨ۠ۦ۫ۙۡۜۘۦۤ۫ۦۚۜۛۨۡۥۛۙۡۚۨ۬ۚۧۜ۟۫ۡ۟ۙۡۗ۫ۥۡۡۘ۬۫ۘۘ";
                                                                                break;
                                                                            case -264500599:
                                                                                str5 = "ۙۜۙ۠۟۠۟ۖۡۘ۟ۙۢ۬ۜۘۙۗۢ۟ۨۚۧۚۜۘ۬ۛۦۘۗۙۥۘۗۧ۫ۗ۟۫ۡۤۦۘ۠ۡۢۤۦۡۘۧۧۖۘۗۤۨۙ۠ۖۜۦۘۦ۫ۛۢۥۡۘۙۙۡ۫ۛۗ۠ۖۢۡ۬ۜۘۜۛۥۧ۬ۛۧۛۚۜۜۥۧۧۘۘۙۧ۫ۛ۠۟۬ۚ۫ۢۜۖۚۦۘۖۗۗۨ۬ۨۘۙ۠ۦۚۛۖۚۚۨ";
                                                                                break;
                                                                            case 1618308259:
                                                                                str6 = "ۤۦۦۖۘۤۚۖ۬ۤ۬ۨ۠ۗۥۘۧۜۚۚۗۢۨۘۜۚۤۙ۠ۧۨۦۘۤۙۖۗۢۨۘۡۖۘۘ۫۟ۥ۟ۖۜۘ۫ۥۜ۟ۘۨۘۧ۟ۡۘ۬ۗ۫ۜۨ۫ۡۨۘۘۖۜۘۧۗ۬۟۫ۘۙۘۖۢۥۚۥۜۛۖۥۡۥۢۚ۬۫ۢۢۧۦۘۧۘۚۖۢۙۘ۟ۜ۟ۨۥۖۥۖۡۥۧۘۤۖۨۘۘۦۗۘۛۙۡۘۦۘۗۢۨۨ۟ۙ";
                                                                            case 1844614256:
                                                                                str6 = !z ? "۟ۙۨۘ۬۠ۡۘۖۗۥ۫۬ۜۙۢۢۦ۟ۥۗۜۡۘۗۨۘۨۨ۬۫ۧۚ۠ۧ۟ۦ۬ۤۡۜۨۤۧۧۨۖۘۛۦ۫ۚۖ۫ۦۥۖۘۤۨۘۡ۫۫ۘۨۧۘۙۦۜۢۘۛۢۨۧۘ۠ۚۗ۫۫۫۫ۦۗۘۜۥۘۧۡۛۧۖۡۘ" : "ۚۜۘۘ۟ۛۦۚۨۦۥ۟ۡۘۢۧۖۛۚۤۢۖۜۘۘۘۗ۬۟ۚۡ۫ۖۧۚۧ۫ۖۨۘۥۛۡ۫ۧۥۘۤۡ۫ۖۚۡۘۡۛۨۘۜۢۢ۬ۜ۫ۚۨۚۜۗۨۘ۟ۦ۟۫ۖ۫ۙۢۤ۬ۡۚ۠ۚۨۘ۬ۖۡۘ۬ۧۦۤۡۘۗۙ۫ۛ۬ۘۨۨۘۥۛۚۨۗۤۧ۫ۖۡۚۦۘۢ۠ۛۚۡۢ۟ۥۧۘۤۡۜۘ";
                                                                        }
                                                                    }
                                                                    break;
                                                                case 307526774:
                                                                    str5 = "ۗۧۥۗۧۖۧۗۖۨۗۗۨۨۜۘۗۛۡۘۘۦۗۧۛۛۛۥۘ۫ۜۜۖۢۧۚۚۦ۟ۡۜۤۖ۠ۜ۫ۗۗۧۦۘۤۧۛۥۛۡۖۖۧۘۦ۟ۨۧ۬ۚۘ۬۠ۘۨۡۘۥۢۧۨۚۦۘۙۜۥۘۨۙۚۢ۬۠ۜۧۖۘ";
                                                                case 1845948633:
                                                                    str4 = "ۖۨۡۦۚۦ۟ۤۖۨۗ۬ۛۦۥۡۖۘۛۘۤۡۧ۫۫ۢۥ۠ۦۤ۠ۨۡۗۗۛۘۥۘۙۜۜۗۜۖۘ۟ۘۤۥ۬ۨ۠ۘۖۘۥ۟۟ۦۛۨۘۨ۟۫ۖۘۘۨ۠ۡۘۙۥۖۙۙۡ۫۫ۤۧۧۜۨۙ۫ۢ۠ۡۚۖۥۙۡۢۘۚ۠ۥۙۖۘۚۧۦۘ۟ۗ۟۟ۜۗۜۖۜۥۘۥۖۚۨۛ۟";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                }
                                            }
                                            break;
                                        case 1629321363:
                                            str2 = "ۦۗۗۧۧ۟ۛ۠ۢ۠ۤۘۖۥ۟ۙۖ۬ۨۛۨۢۘۨۖۧۜۘۛ۠ۜۘۧۧۡۙۚۜۘۗۡۡ۫۠۟۬۠ۥۘۘۗۢ۠ۡۗ۬ۦۘ۟ۨۖۨۢۦۤۚۜۤۢ۟ۛۜۥۘۚۨۦۘۡۘ۫ۙۡۘۘۡۛۦۘۧۦۧۘ۫ۨ۟ۢۦۖۡۢ۟ۦۖۛ۬ۘۨۖۤۛۗۚۡۗۖۥۤۛۡۘ۫ۡۧۘ۠۠ۚ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 138797223:
                    String str7 = "ۙۦ۠۠۬ۘۘۧۥۗۤۡۖۚۤۙۘ۠ۥۘۧ۬ۙ۬ۥۧۘۨۤۢۘۥۥۜۛۢۤ۬ۢۧۧۙۥۢۡ۬ۤۘۘ۠۠ۡۖۧ۟ۡۘۧ۠۫ۖۘۧۥۛۗۘۧ۬۬ۖۘ۠۬ۘ۟ۙۦۘۡ۠۫ۤۢ۫ۨۢ۫ۨۦۙۜۧۘۚ۠ۨۘ۬ۙۜۘۚۤۜۘ۬ۚۤۘۡۦۘۥۧۚۗۖۦۢ۫ۢ۬ۘۨۨۥۗۙۛۛۧ۬ۖۘۖۚۚ۟ۥۖۘ۟ۛۘۗۨۘۘ";
                    while (true) {
                        switch (str7.hashCode() ^ 411038438) {
                            case -1524082555:
                                str = "ۨۖۜۘۡ۫ۦۨۘۛۥ۫ۦۘۙۢ۠۬ۢۙ۬۟ۥۘۦۘۜۘۚۖۨۤۚۦۘۗۢۨۗۥۦۗۚۦۘۛ۬۟۫ۥۨۘۨۛۡۨۗۥۥۡۥۘۙ۬ۖۘ۫ۛۛۨۧۥۘ۟۠ۘۗۖۙ۬۟ۨۘۙۧۖۛۤۗۜۜ۠۟ۡ۬ۤۤۦۘۙ۟۬ۥۘۛۚۡۦۘۦۚ۬ۦۙۥۘۢۘۢ";
                                continue;
                            case -1413462330:
                                str7 = "ۖۚ۠ۛۨ۠ۛۜ۬ۢۢۜۘ۬۟ۥۘۜۜۦۨۜۧۘۙ۟ۨۘۚ۬ۘ۟ۥۙۗۛۜۘۧۛ۟ۚۨۥۤۥۨۘۢ۬۬ۛۤۘۢۧۚۛۨۘۢۨۧۗۗۙ۬ۨۨۥۚۦۘۖۢ۠ۘ۬ۧۖۖۥ";
                            case 970133099:
                                String str8 = "۟ۚۚ۠۠ۤۧ۠ۤۘ۫ۘۘۨۥۚ۬۫ۨۘۜۚۨۖۡۙۘۨۜۖۗۦۥۢ۟ۧۤۙۗۜۡۘۘۢۦۘۗۨۜ۠ۥۨۘۧ۫ۜۖۚۘۘۡۢۖۘۘۢۥۘۜۦۜۘ۟ۘۦۘۖۢۖۨۗۜۘ۠۬۟ۖۙۤۦۢۥ۫ۤ۟ۚۜۗۗ۫ۚۘۚۡۦۛۨۖۧۘۜۘۗۢۥ";
                                while (true) {
                                    switch (str8.hashCode() ^ (-168117573)) {
                                        case -1334841476:
                                            str7 = "ۢۨۙۤۗۘۖۥۖۘۨۛۦۚۦۙۡۨ۠ۡۘۗۜۡ۬ۜۗۡۘۧ۬ۨۘۡۤ۬ۖ۟ۗۦۨۛ۫ۥۘۘۦۘۗۨۡۘۢۢۥۤۦ۬۠ۗۜۘۤۢۘۘۜۧۙۥۘۙ۟ۥۘۥۧۗۤ۠۫";
                                            break;
                                        case -79056266:
                                            String str9 = "۟ۨۡۘۗۡۗۡۜۜۘۘ۠ۖۘۗۢۜۘۨۖۖۖۙۥۢۛۖۘ۫ۖۙۛۡۤۦ۬ۘ۟ۛۥۘ۬ۜ۠ۨۦۥۘۗ۠۟۠ۜۤ۬ۚۥۘۡۙۜۢۖۘۦۗۘ۠ۖۨ۬ۚۦۡۥۢ۠ۥۧۦۘۥ";
                                            while (true) {
                                                switch (str9.hashCode() ^ 573019318) {
                                                    case -1058887324:
                                                        str8 = "ۢۧ۟ۨۗۖۜ۟ۥۘۛۜۗۧۢۨۘۜۚۥۘ۟ۢۘۚۗۦۘۙۡۖۘۜ۫ۗۘ۬ۥۘۚۧۜۙۖ۬۟۠ۚۤۖۜۘ۟ۛۘۙۚۘۛۗۨۘۡۜۛۦ۫ۙۘۦۥۘۚۘۡ۫ۥ۬۬ۥۦۡۗۖ";
                                                        break;
                                                    case -633325351:
                                                        String str10 = "ۚۙۧۙۡۦۘۥۤۦۚۖۢۢ۬ۘۥۛۙ۫ۗۙۛۡۘۚۤۘۘۥۛۗۙۗۥۨۚۡۘ۫ۨۥۘۗۤۘۘۦ۫ۡۘ۫ۡۢۤۚۤ۬ۦۦۚ۟ۨۘۧ۬ۘۦۘۗۗۨۘۦ۟ۡۘۛۙۜۘ۟ۡۜۘۡ۠ۖۘۘۘۚۜۗ۬ۡۖۙۡۚۜۘۨ۠ۨۘ۠۬ۗۗۦۗ۬ۢ۠ۦۜۘ";
                                                        while (true) {
                                                            switch (str10.hashCode() ^ 1354845042) {
                                                                case -1044820703:
                                                                    String str11 = "۠۟ۙۡۘۧۘ۬ۧ۟ۥ۬ۙ۬ۤ۟۫ۜ۟ۤۨۥ۬ۤۜۦۘۥ۟۟ۚۙۘۘۖ۫ۤۤۚۦۘۛۥۘۢ۟ۗۛۜۘۡۨۨۛۤۦۤ۬ۛۛۘۗۥۤۥۨۦۚۦۘۤۙۦۘ۟ۙۜ۠ۨۤ۠ۖۘ۬ۡۦۘ۠ۚۜۘۢ۫ۥۘۤۢۡۦۥۤ۬ۜۘۖ۫۫ۧۥۧۘۗۡۨۖۦۤ۠ۥ۫ۡ۠ۖۡ۬";
                                                                    while (true) {
                                                                        switch (str11.hashCode() ^ 637189245) {
                                                                            case 1044828051:
                                                                                str11 = "ۥۡۧۘ۟ۛۥۘۚ۬ۙ۟۫ۦ۟ۧ۟ۤۡۡۘۙۘۖۙۡۜۘۧۧ۫ۚ۠ۘۗ۬ۖۘۧۜۢۡۨۛ۟ۗۡۚۦۧۨ۫ۥۘۤ۠ۦۘ۠ۥۦۤۜ۠ۜۨ۟ۧۥ۟ۜ۫ۡۦۘۗ۬ۘۘۛۖۧۘۧۜۧۥ۠۟ۡ۟۟ۧۛۖۘۤۛۜۡ۟ۧۥۤۢۧۥۧۨۚۖۤۚ۫ۡۧۤ۬ۗ۫۫ۛ۫۠ۛۡۦ۬۫ۢ۬ۖۨ۠ۦۘۘۥۚۨ۠ۚۤ";
                                                                            case 1190314089:
                                                                                str11 = i > 0 ? "ۦۢۗۤۖۦ۟ۘۤ۫ۛۖۛۨۨۖۧۨۘۗۦۨۡۢۢۢ۟ۖۘۧۖۖ۟ۡۜۘۙۛ۟۬ۙ۟ۥۦۢOۤۚۥۘۧ۫ۖۥۗ۬۟ۨۙۖۡۢۖۛۦ۟ۛۤۥۛ۟۠ۛۚ۟ۤ۟ۛ۬ۨۙۚۥۛ۬ۢۥۜ۟ۖۖۜۘۘۥۘۖۨ۠ۨۘۛ۟۟ۙۗۨ" : "ۥۨ۫ۛۙ۫ۧۜۨ۬۬ۡۙۖۥۘ۟ۜ۫ۢۥۘۘۛۥ۫ۡۛۘۘ۟ۖۢۜ۠۟ۗۛۡۤۖۥۢۖۡۘۧۡ۫ۛۙ۫ۨۘۦۤۜۗۢۦۘۜۜۧۛ۬ۖۘۘۤۥۘۦ۫ۦۘ۟۬ۜۘۘۤۨۛۧۚ۫ۦۘۡۢۦۢۥۥۙۢۥۨ۫ۨۤ۫ۦۘۛ۟۫ۢۧ۟۬ۜۨۚۥۦۤ۠ۥۘۨۖۘ۫ۥ۠";
                                                                            case 1617072766:
                                                                                str10 = "ۛ۠ۦۡۛ۬۟ۘۖۘ۠۬ۦۘ۫ۧۜۗۗۦۘۧۖ۫ۗۦۘۢۖۡۘۛۤۜۛۢۥۘۚۜۡۜۢۜۘۦۜۘ۫۫ۗۜۖۡۘۡۢۘۙ۟ۘۘ۬۟ۥۘۡۧ۠ۢۚۚۗۘ۠۠ۙۚ۟ۨۙۤۖۘۗۧۦۘۢۨۡۘ۫۫ۘۗۚ۫ۖۦ۟";
                                                                                break;
                                                                            case 1991536602:
                                                                                str10 = "ۤۙۦۘۤۤۡۘۦ۟۫۫ۡۦۘۢۚۢۚۘۖۘ۫ۢۤۦۘۢۦۚۨۥ۬ۜۘۗۧۥۘۨۛۗۡۥۖۘۤ۫ۙۖۥۧۖۙۢۜ۫ۢۥۥۙ۫ۨۨۤۨۤۛۦۦۖۛ۫ۤ۬۠۟۟ۙۛۜۗۚ۠ۡۦۦۨۦۖ۠ۢ۬ۘۘۤۦۦ";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case -834591423:
                                                                    str9 = "ۗ۬ۢ۫ۘۥۘۙۧۦۙۡ۟ۤۧۚۜ۫ۖۘۖۨۛۜۤۚ۠ۢۖۘۢۚۢۘۗۙۜۛۖۘۧ۠ۥۖۡۖ۟ۘۗ۬ۖۘ۠۠ۦۛ۠ۘۘۨۘۘۘۢ۠۫ۡۗۘۘۢۧۖۧۥۖۘۙ۟۟ۚۢۧۦۜۚۨۥ۟۠۠ۧۖ۫ۢۨۜۥۘۧۧۖ۬۫ۗ۬ۤۗۥۜۜۘۘۧ۫ۧۘۤۦۛۥۜۡۖۘۗۢۜ۬ۘۛ";
                                                                    break;
                                                                case 1184719228:
                                                                    str10 = "ۜ۠ۤۧۦۖۘ۫ۡۜۙۡ۠ۙۚۨۘۗۚ۬ۗۘۖۗ۟ۜۘۘۤۤ۠ۜۦۛۡۛۤ۟ۖۙۥۛ۟ۘ۬ۤۛۖۛ۫ۖۘۤۙۧ۟ۨ۫ۖۜۨ۬ۘۛۦ۬ۜ۬۟۬۠ۙۘۚۙۦۤۘۘۘۚۦۤ۫ۥۛۛۛۚۧۘۥ۫ۘ۠";
                                                                case 1467417157:
                                                                    str9 = "ۢۨۛۖۘۦۘ۬ۖۛۖۢۜۘۙۦ۠ۢۖۢۚ۫ۙ۟۬ۘۘۚۙۥۛ۠ۦۘۗ۫ۨۘۤۘۙۗۜ۬ۚۚۜۘۙۥۡۘۦۦۢۤ۠ۥۘۗۚۢ۟ۨۙۛۤۜ۟ۧۜۡۥۘۛۙۘۘۢ۫۟ۚۢۜۘۜۡۖ۠۟۟ۛۚۥۧ۠ۖ۬۬ۤۡۛ۫ۚۖ۟ۜۘ۠۠ۦۧۗۘۥۚۖۘۢۗۤۚۦۢ۬ۜۜۥ۫ۢۙۢ۬ۥۙۜۘۜۙۖۘۘ۫ۜ۠ۜ۬";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 1010974854:
                                                        str8 = "ۘ۠ۗۢۖۡۢۘ۠ۘۖۘۚۡۘ۬ۖۗ۬ۗۨۚۡۖ۬ۜ۫ۥۗۜۥۙۨۘۨۖ۫ۨۥۧۡۢۡ۫ۦۛۡۧۘۘ۟۟ۨۗۥۚۨۢۗ۟ۛۢ۬ۖۨ۬ۜۘۘ۬ۡۘۨۡۨۚۚ";
                                                        break;
                                                    case 1746270601:
                                                        str9 = "ۛۢۜ۟ۥۥۘۙ۬ۘۘۤۖۛۚۗۨۘۜۢۦۘۖۧۥۘۘۘ۫ۘۙۦ۬ۛ۠ۡۜۡ۬ۤۖۘ۬ۢۘۘۧۖۧ۬ۨۦۦۢ۫۟ۘ۫۟ۜۘۥۨۤۚۗۥۜۜۘۘۘۦۚۢۡۚۚ۫۫ۨۤۖۧۘ۠۠۫ۜۘ۠ۖۜ۫۬ۤۥۢۡۘۢۜ۫ۗۡۤۦۛۧۖ۟ۨۘۘۛۜ";
                                                }
                                            }
                                            break;
                                        case 854296496:
                                            str7 = "ۚۡۛۚۦۖ۫ۡ۫ۨۘۘۘۘۚۛۙۜۡۘۙۡ۠ۤ۬ۜۘۜۖۡۘۙۤۗ۫ۜۖۗۖۨۥۖۤۡۥۧۘۡۚۨۘۛ۟ۛۘ۟۬ۘۘۤۨۖۨۨۚۚ۠۬ۥۙۦۦۗۥۘۛۥۨۘ۟ۧۖۘۘ۬ۛۜۢۜ۠ۢ۟ۨۧۙ۟ۙۦۘۙۛۢۦۨۥۘۖۙۚۧۗۤۤۗۦ";
                                            break;
                                        case 1768466414:
                                            str8 = "ۙۤ۬ۧۜۡۘۨۚۡۘۨۢۘۘۢۗ۬ۙۗۘۤۦۘۢ۫ۨۘۢۤۢۜۡۤۦۥۖۧ۠ۜۘ۟ۦۙۗۡۨۘۤۙ۬ۙۨۤۘ۟ۛۜۖۦۘۦۨۨۘۚۘ۠ۚۖۧۘۗۦۧۘ۬ۜۜ۟۟ۘۜ۫ۡۘ۠۬۫۬۫ۘۘۧۧۖۨۧۦۚۧۧۘۢۖۤ۫۟ۜۗۦۘۥۨ۠ۖۗۙ";
                                    }
                                }
                                break;
                            case 1867952139:
                                break;
                        }
                    }
                    break;
                case 818221968:
                    str = "ۖۜۘۘۗۤ۬ۚۡۜۗۥۗ۠ۛ۠ۙۨۙ۠ۡۜۘۛۗۗۤۙ۬ۛۧۨۘۘۖۚۜۙۘۘ۫۫ۡۘ۬۬ۖۡ۬۬ۨۤ۫۫ۖۖۘۗۡۡۘۤ۟ۨۙۜۧۡ۬ۘ۫ۡۘۗۧ۟ۚۨۨۗۡۜۘۢۤۧۛۖۜۜۗۦۢ۠۠ۛ۠ۖۦۢۤۗۚۥۘۘ۟ۗۖۘۛۖ۫ۧۡۘۘۗۜۘۥۚۨۘۦۥۨۡ۠ۚۡۚۡۘۡ۠ۤۚۚۛۗ۬ۦۘۥۚۧ";
                    continue;
                case 1479163214:
                    i = getResources().getIdentifier(Deobfuscator$$app.getString(-3440722585118924617L), Deobfuscator$$app.getString(-3440722490629644105L), Deobfuscator$$app.getString(-3440722189981933385L));
                    str = "ۖۨ۠ۤۥۛۘۖۢ۟ۡ۟ۙۢۛ۟۟ۧ۠ۥۘۚۥۦ۫ۜ۟۠۠ۦۘ۫۠ۖۘ۬ۘۚۡۧۤ۠ۨۗۧۨۤۖ۬ۜۜۖۤۨۘۘۨۡۙۢۦ۫ۙۦ۫ۡۨۦۘ۟ۜ۫ۢ۟ۦۜۗۨ";
                    continue;
                case 1728055315:
                    z = ViewConfiguration.get(this).hasPermanentMenuKey();
                    str = "۟۠ۛۛۗۤۛۧۗ۟۠۫۠ۤۤ۠ۚۘۚ۟۬ۜ۬ۨۘۤ۠ۘۙۧۥۢ۬۟۠ۖۜۘۛۦۚۨۥۘۘۖ۬۫۟۠ۚۡۢ۫ۥۛۧۡۥۙ۟ۢۤۙۤۘۨ۫ۤ۬ۢۜۘ۠ۥۘۘ۠ۦۢۘۚۘۨ۠ۧۨۗۘۘۖۡۜۘۥۖۙۤۖ۠ۤۗۜۘ۟ۡۤۖۙ۠۟ۜۜۘۖ۬ۤۧۖ۫ۛۡۛۚ۫ۤۛۗۦ۠ۖۙۗۥۨۖۖۘۜۤۨ۟ۜۨ";
                    continue;
            }
            str = "ۨۗۤۛۧ۟ۗۛۥۖۚ۬ۘۘ۬۠ۖۚۨ۠۫ۖۙ۬ۚۘۦ۠ۘۢۦۗ۟ۛۖۘۨۜۗۥۢۘۚ۫ۘۘ۫ۚۨۘ۠ۡۙ۬ۥۧۘۥ۠۬ۦۧۨۧۖ۟۠۟ۖۘۦۖۧۘۧۘۜۘۜۦۖۘ";
        }
    }

    private native boolean getReady();

    public FPrefs getPref() {
        String str = "ۡۥ۠ۦۥۤۚۥۖۨۘۥۘۜۤ۬ۙ۠ۤۘۗۜۘۛ۬ۜۘۢۘۥۘ۫ۦۥۘۥۖۤۖۙ۠ۦۧۧۥۘ۠۠ۥۙۦۦۦۘۡۡۨۘۦ۫ۚۛۧۡۘۘۙۚ۫۬ۜۘۙۙۡۘۢ۠ۦۡۨۛۜ۠ۥۘۘۦۘۘۘۤۗۢۤۛۨۘ۠ۖۦۜۥۚۦۛۘۘۜۜ۟۠ۙۧۤۦ۫ۦۦۖۛۛ۠ۘۘۨۘۚۧۚۥ۬ۥۤۖۙ۟۬ۖۖۡۡۦۥۜۘۙۜۙ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 457) ^ 29) ^ 489) ^ 515) ^ 902) ^ 383) ^ 372) ^ 89) ^ 200) ^ 219) ^ 737) ^ 830) ^ 831) ^ 301) ^ 391) ^ 103) ^ 767) ^ 517) ^ 552) ^ 540) ^ 914) ^ 32) ^ 691) ^ 128) ^ 145) ^ 455) ^ 23) ^ 480) ^ 412) ^ 841) ^ 994) ^ (-770831705)) {
                case -1757757779:
                    return FPrefs.with(this);
                case -888718592:
                    str = "ۧۗۚۚۧۛۙۘۜۥ۬ۘۜ۬ۦۘۢۧۖۘۘۙۦۥۡۙۥۧۦۧۘۜۘۖۦۙۜۘۨۖ۟ۘۦۧۧ۠ۡۗۖۘۨۖۙۚۖ۠ۙۧۨ۠ۜ۠ۨ۬ۧۥۥۘۢۚۤۙۛۦۚ۟ۢ";
                    break;
            }
        }
    }

    @Override // android.app.Service
    public IBinder onBind(Intent intent) {
        String str = "ۜۢ۠ۥ۬ۙۧۜۡۢۛۗۘۤۚۖ۬ۘۧۗ۟ۖۜۥ۠ۢۨۘۚ۫ۡ۟ۛۢۦۚۜۘۨۤۡۜۘ۫۬۫ۧۧۡ۠ۢۦ۟۬۟ۧۧۡۘۛۖۥۦۜۦۦۚۜۘۚۚۘ۬ۗۗۨ۟ۤۢ۠ۨۘ۬ۤۡۧ۫ۖۡۖۚۖۗۥۤۢۨۘ۠۠ۖۜۚۡۗۗۜۘۛ۟ۜۘۥۤۘۘۙۡۦۨۦۧۘۨۦۢ۠ۧۡ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 988) ^ PointerIconCompat.TYPE_COPY) ^ 819) ^ 279) ^ 520) ^ 223) ^ 45) ^ 744) ^ 841) ^ 844) ^ 498) ^ PointerIconCompat.TYPE_ZOOM_IN) ^ 52) ^ 504) ^ 343) ^ 39) ^ 552) ^ 423) ^ 689) ^ 595) ^ 327) ^ 375) ^ 228) ^ 731) ^ 160) ^ 955) ^ 488) ^ 439) ^ 350) ^ 342) ^ 319) ^ (-2061832090)) {
                case -845871087:
                    str = "ۙۨۨۤۖۧۘۗۦۚۖۖۜۘ۠۬ۨۘۚۤۦۖۧۙۥۨ۫۬ۨۘۧۢۦۘۤ۠ۙۥۗۡۙۘۗۢۡۘ۬ۜۚۨۛۗ۬ۢۦۘۨۗۡۨۜۖۘۧۤ۠ۛۤۦۘۛۦۜۘۦۨۧۨۤۦۦ۟ۢۖ۟ۚ۠ۦۚ۟ۙۤۛۤۚۚ۠۠۟ۤۧۦۘ۠ۗۨۘۘۜۥۘۤۛۜۦ۠ۜۘۧۛۨۘۤ۬ۘۚۛۘۢۨۦ";
                    break;
                case 415994164:
                    str = "ۨۚۤۗ۬ۡۖۚۙۡۖۜۘۤۗ۬ۚۛۢۚۥۛۡ۠ۜۘۧ۫ۘ۫ۛ۫ۚۢۦۦۦۘۘ۬ۤۥۜ۟ۜۘ۠ۢ۠ۥۥ۟ۘۜۢۛۧۜۛۘۤۗۡۢ۬ۨۡۥۡۚۖۚ۬ۛۧۥۤۛۡۘۙۨۖ۫ۖۜۛۤۥ۟ۢ۫ۜۥۘۚۦۜۖ۠ۖۘۡۙ۠ۥۛۗ۫ۨۨۙۤۨۜ۬ۗۗۨۨۘ۟ۗۙۨۤۙ";
                    break;
                case 496996645:
                    return null;
            }
        }
    }

    @Override // android.app.Service
    public void onCreate() {
        String str = "ۨۘۦۘۗۤۜۗۨۥۢۨ۠ۖۨۢ۬ۘۦۘ۟ۘۜۘۖۜۘ۠۟۬ۖۨۗۥۢۗ۫ۖۘۡۡۥۦۘۨ۬۠ۡۘ۠ۡۥۘ۫۠ۢۥۗۢۛۘۥۢ۟ۥۘۢ۬ۥ۫ۙ۫۠ۘ۠ۚۗۡۙۦۙ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 285) ^ 700) ^ 374) ^ 480) ^ 643) ^ 104) ^ 760) ^ 500) ^ 654) ^ 347) ^ 835) ^ 614) ^ 682) ^ 910) ^ 43) ^ 185) ^ 808) ^ 25) ^ 987) ^ 920) ^ 227) ^ 367) ^ 972) ^ 490) ^ 614) ^ 190) ^ 859) ^ 103) ^ 514) ^ 340) ^ 993) ^ 885980166) {
                case -2124110179:
                    this.windowManager = (WindowManager) ctx.getSystemService(Deobfuscator$$app.getString(-3440722387550429001L));
                    str = "ۢ۠ۢ۠۟ۡۨۗۨۘۚ۠ۥ۠ۤۨۖۡۘۥۡۡۜۗۦۧۜ۟۟ۙۨۘۛۘۗۨۗۦۘۖۨۖۘۚۖۦۚۤ۬ۗ۬۟ۤۚۦۡۘۦۜۦۤۧۗۗۙۢۖ۫۠ۧۢۙۢ۫ۖۘ۠ۙۜۦۤۡۡۜۜۦۘ۠ۗۥۥۗۗۨۘ";
                    break;
                case -1533070086:
                    this.overlayView = new ESPView(ctx);
                    str = "ۧ۟ۘۧۘۙۜۖۘۢۜۛۘۢۦۘۚۘۜۘ۫ۘۧۘۘۦۜۘ۬ۥۦۘۗۗۧۡۚ۬ۛۥۗۘۤۡ۬۫ۖۛۤۙۢۦ۠ۤۦۦۘۦۨۙۖۙۘۘۦۡۘۢۥۡۘۥۨۧ۬ۖ۬ۢ۬ۦۙۤۦۘۡۗۨۘ۠ۡ۬ۜۤۘۦۛۖۘۥ۬۬ۜ۠ۖ۬ۚۗۛۜۦۙۗۥۘۤۨۖۘۡ۬ۡۘۜ۫ۨۧۦۧۡ۠ۥۤ۬ۢ۠ۜۗۦ۬ۚۧۤ۬ۨ۠ۢۗۥۥۘ";
                    break;
                case -504761334:
                    ctx = this;
                    str = "ۦۨۦۘۡۖۜۧۛ۠ۜۥۦۘۙۤۨۘۧ۬ۡۘۜۢۡۘ۟ۥۖۘ۫ۖ۟ۗۚۘۘۖۜۥۙۖ۠ۢ۬ۤۘۚ۬۠ۦ۠۬ۥۨۘۘۚۧۜۘۘۚۛۨۛ۟ۚۜ۫ۦۘ۬ۖۖ۬ۙ۫ۙۦۜۘ۠۟ۦۘۖۖۘۘ۬۫ۥۘۤۥۖۘۤ۟۠ۥۡۦۘۖۡۢ۠ۙۘۘۥۦۦۘۗۘۥۤۤ۬۫ۛۥۚۧۗۡۢ۬ۡۧۘ۫ۡۛ";
                    break;
                case 229388725:
                    return;
                case 1071374133:
                    super.onCreate();
                    str = "ۗۤۥۚ۠ۘ۫ۨۧۘ۟ۥۧۖ۬۠ۢ۫ۨۥۡ۫ۜۢۛۛۖۦۜۥۧۤ۫ۤۜ۬ۜۘۚۗ۫ۙۚۚۗۥۛۡۖۗۧۗۤۥۡۖۘۛۡۢ۬ۦۧۘۨۘۗۛۤ۫ۖۛۦ۫ۦۨۧۥۦۘۜ۬ۡۘۚ۬ۛۥۜ۫ۚۜۤ۠ۨۨ۬ۜۡۘۚۤۘۙ۫ۧ۬۬ۚۥۤۦۙ۫ۥ۬ۦۧۖۤۥۤۤۡ۫ۡۤ";
                    break;
                case 1164937648:
                    DrawCanvas();
                    str = "ۡۤ۫۟۠۬ۦۗۗۢ۠ۗۧ۠۠۟ۘۦۘۚۖۜۥۥۛۙۦۡۡ۬ۜۚۜ۟ۖۖۜۡۘ۫ۙ۫ۥۘۚۨۘۢۤۦۦۥۖۘۡۜۚۙۘۦۘۥ۟ۜۘۤۖ۠ۚ۟ۨۗۢۗۘۦۘ۠۠ۡ۟ۚ۠ۡۤۤ۟ۨۘۨۢۜۘۦۙۙۛۖ۫ۧۜۨۜۢۨۘ۟ۖۡۘ۫ۦ۟ۖۘۢۘۜۙۖۗۢۗۨۙ۠۫ۨۘ";
                    break;
                case 1330001786:
                    Start();
                    str = "۬ۖۥۘۗۨۚۢ۫۟ۨ۠ۡۘۛۥۧۘۥۘۡۘۚۥۨ۠ۦۧۘۧۖۦۤ۬ۨۥۨۦۖۖۦۘۦ۟ۦۘۦۗۡۜۛۥۤ۠ۘۖۚۛ۟ۙۚ۫ۢ۟۠ۙۖۘۦۙۛۜۧۨۜ۬ۨۘ۟ۗۜۘۙۡۘۢۘۥۛۡۜۘۤۜۛۨ۟ۚۨۥۧۨۙۘۘۛۨۡۘۜۦۧۘۨۧۤۦۤۘۦ۫ۨۛۢۤۤۘۜۥۗۘ۫ۢۖۖۗۘۚ۫ۗۡۚۢۨۚۛ";
                    break;
                case 1404583437:
                    str = "۠ۛۖۘۖۗۛۧۜۦۘۡۘۗۛۛۗۜۥۦۚۢۤۗۘ۟ۙۜۘۘۖۢۥۚۤۜ۫۟ۖۘۢۧۘۘۗۦ۬ۡ۠ۡۘۜۗۢۧۚۡ۟ۡۨۘ۟ۘۖۘۤۜۖۘۙۛۦۢۜ۟ۦۖ۠ۡۢۚ۬ۙۦۘۛۦۨۘۙ۬ۘۤۛۥ۠ۧۙۡۙۡۘ";
                    break;
            }
        }
    }

    @Override // android.app.Service
    public void onDestroy() {
        String str = "ۖ۟۟۟ۢۦۜۤۜۘ۠ۡۖ۬ۢۧۘۙ۫ۨۧۛۥۜۙۡۖۡۙۘۦۡۥۘۚۚۜۚۜۘۗۨۛۧۙۖۡۡۜۖۨۗۡ۟ۨۘۙۧۤ۠۬ۖۛ۫ۘۘۨۥۥۛۛۛۡ۟۫ۙۚۧۡۜۘۨ۟۫ۨۚۡ۬ۛۜۘ۫ۗۜۘ";
        ESPView eSPView = null;
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 757) ^ 378) ^ 6) ^ 705) ^ 264) ^ 78) ^ 921) ^ 447) ^ 797) ^ 445) ^ 139) ^ 273) ^ 734) ^ 913) ^ 406) ^ 536) ^ 811) ^ 562) ^ 299) ^ 581) ^ 646) ^ 553) ^ 737) ^ 496) ^ 781) ^ 546) ^ 991) ^ 107) ^ 394) ^ 76) ^ 518) ^ 673034883) {
                case -1799734574:
                    super.onDestroy();
                    str = "۟۫۫ۥ۬ۗ۟ۡۧۗۖۧۡ۟ۨۛۗۡۧۤۨ۠ۡۦۘۧۙۛۨۖۘۘۥۡۥۚ۟ۛۨۘۚۚۘۘۥۦۨۦ۬ۥۨۖۘۢ۠ۘۘۢۚۧۙۨ۠ۙۖۢۨۤۛۘۥۤۜۜۡۘ۟۠۟";
                    break;
                case -628817246:
                    eSPView = this.overlayView;
                    str = "ۗۗۥۨۗۜۘۦ۬ۦۘۗۧ۫۬ۛۛ۬۟ۜۜۖۛ۫ۘۗ۟ۥۖۘ۬ۦۨ۬۠ۨ۟ۛۢۨۦۖۘ۬ۡۘۙۤۗۢۘۧۙ۟ۨ۫ۡۨۘۜ۫ۜ۠ۥۘۛۜۜۦۤۚۘۘ۬ۥ۫ۘۦۦۘۡۗۚ۠ۨ۠ۗۚۚۨ۠ۘۖۖۢ";
                    break;
                case 124002267:
                    String str2 = "ۨۦۦۘۦ۟ۘۘۜۧۦۘۜ۬ۦۘ۬ۘۧۘۥۨۡۘۗ۠۬ۤۛ۠ۢۦۜۘۡ۫ۥۥۡۜۤۖۙۦۖۙۥۜ۬۫ۥۡۖۘۖ۠ۥۦۛ۠ۗۚۧ۠ۚۗ۟۬ۖۥۙۧۨۡۧۖۡۘۙۚۜ۬۠۠ۨۥ۠ۦ۠ۖۘۧۙۡۘۥۚ۬ۙۘ۫ۧ۫ۜۙۘۦۢۧ۬ۘ۫ۤۧۜۤۡۦۥۘۦۗۦ۟ۗۗ۠۫ۙ۠ۜۙ۫۬ۥۚۧۘۡۘ";
                    while (true) {
                        switch (str2.hashCode() ^ 896663960) {
                            case -1334650497:
                                str2 = "ۗۧ۟ۛ۟ۨۘۛ۫ۨۘۨۜ۬ۖ۫ۖۘۨۦۨۘ۠ۛۤ۫۫ۗۤۤۦۜۥۥۨۘۧۙۖۘ۟۟ۜۨۧۗۙۢۥۘۡۥۧۦ۟ۖۘۙۖۧۘۖۗۜ۟۟ۚۤ۬ۗۜۡۧۧۗۡۤۘۗۢ۫ۛ";
                            case -1114593499:
                                str = "ۦۧۤۡۗۛۚ۠ۢ۟ۖۜ۠ۙۥۧۨۤۜ۫ۙ۠ۜ۟ۧۚ۬۠ۛ۠ۡۢۢ۬ۚۗۘۥۧۘ۠ۧۡۜۙۘ۬ۛۗۥۚۛ۠۠ۤۘۥۙۙۛۡۘۥۢۛۦۡۤۚ۠۫ۚۘۛۙ۟ۖ";
                                continue;
                            case -323259725:
                                String str3 = "۫ۢۜۘۧۘۜۛ۠۠ۤۧۗۙۗۥۤ۫ۡۙۦ۠ۥ۫ۛۜ۟۠ۜ۟ۙ۫ۜۧۗۘۨۡۨۘۙۗۘۘۥ۬۫ۗ۫ۨۜۖۚ۫ۦۜۦۥۥۘۢۦ۫ۖ۫ۦۘۥۘ۬۟ۥۘ۫۬ۜۘۢۙ۟۟ۢۜۖۧۗ۬۠ۚۥۥۚۤۙۨۘۛۙۨۘ۫ۗۙۤۡۗۡۥۘۜ۬ۥۘ۟ۙۦۘۥۡ۫ۤۙۜ۫ۥ۟۫ۖ۫۬ۖۧ۫ۡۤۙ۬ۢۦ۟۠ۢۨۜۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ 568875405) {
                                        case 983311295:
                                            str2 = "ۤۖۜۗۙۜۛ۟ۡۘۧ۫۠۟ۦۘ۟ۖۦۘۚۨۦۘۗ۠ۚۗۤ۠ۤ۬ۘۘۚۖۙۡۗ۫۟ۤۡۘۘۖۤۙۦۧۘۥۘۨۙۚۗۥۚ۠ۧ۬ۥۘۜ۠۟ۧۗ۠ۨۛ۠ۥۛۘۘۢۚۥۘۡۛۥۘ۬ۛ۠ۘ۫ۡۘۚۡ۬ۡۘۦۧۨۢ";
                                            break;
                                        case 1046652514:
                                            str2 = "ۛۦۜ۬ۗۖۘ۬ۢۖ۠ۥۥۘۡۘ۬ۙۚۖۘۘ۫ۦۧۙ۬ۙۚۥۢۢۥۦ۫ۥۘۙۚۤۛۚۡۘۗۤۦۘۦۨۘۘ۫ۗۜۜۖ۟ۗۡۘۘۖۜۥۦۜۘۨۚۧۡۧۡۘۦۤۜۘۚۖۦۚۥۘۘ";
                                            break;
                                        case 1602080543:
                                            str3 = "ۘۡۦۘۥۥۧ۬۫ۗ۬ۤ۟ۜۧۗ۟ۘۨۛۥۡۙۦۗۚۢۗۚۚۥۘۨۡۖۘۤۗ۟ۜۥۘۢۡۧۚۡۙۡ۫ۡۚ۫ۘۘۛۛۥۤۙۖۘ۠ۘۖۙۨۥۚۧۧ۬ۢۛۛ۫۠ۛۘۗۢ۟۠ۧۡۗۛۦۧۘۗۥۜۘ۟ۤۙۦۘۙۨ۠ۜ۠ۡۡۘ۟ۢۗۡ۠ۦۘ۠ۢۨۚۤۥۢۦۢۘۖۦۘۧۜۧۘۤۤۙۧۚۘۘۤۛۤۗۗۡۤ۠ۜۘ";
                                        case 2115598743:
                                            String str4 = "۟۫ۚۥۙۘۘۛۚۨۘۤۨۧۜۗۤۙۗۙۖۙۥۘ۟ۥۨۘۙ۟ۖۘۡۦۜۘ۠ۚۜ۟ۢۖۥۗۚۢۥۡۨۗۚۙۢۤ۟ۛۚ۠ۧۡۢۧۗۛۘ۫ۚۥۥۘۦۘۜۘ۟ۤۥۘۖۤۖۖۧۥۧ۟ۗ۠ۜۘ۫ۨۨ۟۟ۘۛۧۥۦ۟۠ۖ۬ۛۧۧۦۜۙۦۘۙ۬ۥۛۖۙ۬ۢۢۘۗ۫ۘۖۥۘ۬۬ۧ۠ۗۘۘۛۚۖۘۙۨۖۘ۟۠ۗۖۡۢ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 453255633) {
                                                    case -1256112763:
                                                        String str5 = "ۡۙۥۘۙۖۖۛۥۡۘۦۙۘۚۦۢۚۖۘ۠ۡۨۤۛۜۘ۟ۘۜۘۙۡۡۘۗ۬ۥ۬ۗۛ۠ۜۧۘۧۚ۠ۦۖۙۜۧۖ۬ۙ۠ۥۚۨۦۚۡۖۢۙۢۥۖۚۚۛۘۛۨۜۗۖۘۨۛۙ۠ۚۡۘۡ۬۠۠ۢۘ۬ۦۥۘۜ۟ۚ۬ۗ۟ۧۘۙۦۛۗ۬۠ۢۨۧ۫۠ۜ۠ۘۡۡۘۨۛۘۡۜۘۘۙۙۥۘ۬ۦ۟۫ۨۡۢۙۖۘۜۧۨۡۨۢ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ 1558547071) {
                                                                case -1844191157:
                                                                    str4 = "۟ۨۗ۫ۜۘۥۨۨۤۥ۠۫ۨۘۖۜۨۘۨ۫ۧۧ۬ۢۙۢۙۦ۬۠ۚۨۛۤۖۡۥۘۜ۫ۥۘۦ۫ۖۖۘۨۦۧۘ۬ۚۘۘۘۦ۠ۖۢۘ۠۫ۥۘۜۦۘ۟۬ۡۘۙۖۦۘ۬ۧۛۙۤ۟ۧۨۧۘ۠ۚ۬ۙۛۛۡ۬ۙ";
                                                                    break;
                                                                case -1415193982:
                                                                    str5 = "ۥۤۙۤ۬ۗ۠ۘۡۥۨۘۘۚۡۙۥۨۧ۟ۜۨۡ۟۟۫ۚۡۚۧ۟ۤۤۜۦۤۡۡۧۘۘ۬ۜۖۘۛۚۘۘۢ۬ۙۥۖۤۚۦۛۙ۫ۚۦ۟ۙۡۡۜۧۡۘۚۧۤۢۧۦۘۨ۬ۖۘ۬ۚۧ۫ۡۜۦۨۖۧ۬ۡۘۘۖ۠ۜ۟ۦۘۦۙ۠ۚ۫۬ۦۘۥۘۚۦۥ";
                                                                case -1110837398:
                                                                    String str6 = "ۦۢۨۘۨۖۧۘۡۨۧۡۛۘۘۥ۬ۤۨ۬ۜۚۡۡۨۦۙۢ۬۟ۖۥ۬ۥ۬ۢۦۢۖۤۥۦۘۤۛۥۘۛ۠۫ۡۘۡۨۤ۟ۦۥۧۗۨۗۡۙۤۗۘۨۘ۟ۡۜۘۛۡۖۘۡۤۧۖۚۦۢۡۙۦۙۥۘۤۗۙۖۦۙۚۤۧۖۙۘۧۙۜۘۤ۟ۦۡۧۘۚ۠ۡۙۛۥۘۤۚۖۗ۫۠ۦ۬ۥۘۤۧۥۧۛۦۗۤۡۘ۠ۥۖۛۡۧۘۤ۟ۡۘ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ (-1134763362)) {
                                                                            case -658142737:
                                                                                str6 = "ۜۧۡۘۚۘ۫ۦۧ۠ۦۜۨۘ۠ۛۙ۠ۘ۬ۦۗۛۥۨۧ۫۟ۡۘۚۛ۟۟ۦۥۘۥۜۥۨۧۖۡۗۡۙۘۤۙۛۡۗۥۜۘۜ۠۬۫ۥۜ۫ۢۨۗۡۘۖۜۦۘۘۡۜۡۧۡۘ۠ۗۙ۟ۨۧۘۗۦۜ۠۟ۚ۠ۤۖ۠۠ۙۨۛۘۦ۟ۡۜۨۦ۫۠ۡۨ۬ۘۗۗۡ۟ۧۡۘۥ۟ۢ۠ۛۗۘۡۘۘ";
                                                                            case 990815184:
                                                                                str6 = eSPView != null ? "ۙ۫ۧۡۚۖ۬ۤ۠ۢۜۖۘ۟ۚۘۘۛۚۖۡۘۖۘۦ۬ۡۛۥۧۚۢ۬۬ۡۤۦۢ۟ۜۘۤۦۘۖۤۘۘۥۥۡۘۗۧۘۙۘۧۜۧۥۘۙۘۘۘ۠ۚۡۘۢۦۘ۟ۜ۫۫ۨ۟ۧۖۡۘۤ۟ۢ۟۟۬ۨۚۨۘۖۢۚۖ۠ۢۘۥۘۧ۟ۛ۬ۧۙۦ۬ۖۘۧۙۘۘ" : "ۧۤۚۢۧۤ۟ۢۚۥۡۦۘۤ۫ۗۦۡۜۤۤۡۘۖۧۙۙۢۡۘۖۨۜۘۡۦ۟ۙ۠ۧۧ۬ۚۢۚۢۤۤۢۜۨ۬ۛ۫ۗۢۙۗ۬ۥۤۥۘۗۡۖۘۦۙۖۘ۠ۢۥۘ۟ۤۥۛۦۢۘۧۚۢۧۖ۠ۜۥۘۡۖۘۖ۠ۘۦۖۘۤ۫ۘۘۘۖۖۤۛۦۘۥۛۢۢۢۖۚ۬ۘۘۥ۟ۨۘۙۚۤۖۜۘۧ۠ۚۗ۟ۘۤۛۜۘۜۛۖ";
                                                                            case 1101697342:
                                                                                str5 = "ۗۖ۟۬۬ۘۜۛۡ۟۫ۧۗۘۛۙۧۥۜۢۛ۫ۛۜ۬ۤۜۦۘۢ۠۟ۤۜۘۨ۫ۙۘۡۚ۬ۙۖۛۙ۫ۥۧۜ۟ۥۨۜۚ۬ۦۛۡۜۥۦۘۗۢۖۢۦۗ۫ۛۖۢۙۢۤۨۘۚۢۚۘۨۗۧۖۧۨۧۜۢۧۥۧ۫ۥۦۛۤۧۨۘ۠ۤۗۜۨۜۘۚۥۘۡ۫ۚۨۖۧۘۚۚۗ";
                                                                                break;
                                                                            case 1849058863:
                                                                                str5 = "ۥ۠۠۠ۜ۠ۦۦۛۘۗۧۨۨۥۢۥ۬ۥۚۗۙ۫ۧۡۖۘ۟۠ۖۙۨۜۘۘۘۜۘۚۗۦۘۖ۠ۛۤۡۡۘۧۧۦۜۚۥ۬ۢۦۘ۠ۦۗۦۢۨۜۖۗۖۖ۬۠ۨ۫ۢۛۢۧۘۥۢۛۦ۟۟ۚۥۘۘۨۥۚ۠ۦۤۥۤ۫ۡۘۢۢۡۚۢۘ۟۟۫۬ۛۨۘ۟ۢۚۛۛۥ۠ۙۧۛۨۘۘ";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case -118906663:
                                                                    str4 = "۠ۜۡۘ۟۠ۥۘ۫ۚۖۢۙۛۢۨۡۜۘۘۛۥۦۜۤ۠ۧۧ۠ۧۙۧۢۢ۟ۛ۟ۦۘۢۡۥ۟۫۠ۨۡۧۗۜۧۘۗۥۙۢ۫ۖۘۤ۫ۦ۠ۙۦۘ۫ۖ۠ۜ۫ۡۘۚۙ۫ۜۦۨۛۗ۬ۧۗۛۘۗۡ۟ۧۡۘۥ۫ۚۨۡۖ";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case -6863108:
                                                        str4 = "۟ۡۖۘ۠ۘۨۦۚۧۢۤۦۘۚۜۢۡ۟ۘۧۗۥ۫ۧۗۧۗۡ۫ۗ۠ۨۘۦۥۢۧۘۛۤۧۗۡۡۨۡۘۜۖۘۛۗ۟ۦۡۖۗۢ۟ۢۦۦۖۜۘۢۤۚۛۜ۠ۘۦ۟۠ۗۥۘۥۢۥۘۧ۠۬ۨۡۤۛ۬ۨۘۛۘۛۦ۬ۡۛۦۘۘۨۜۜۖۥۘۥۨۨ۠ۛ۬ۗ۬۫۟ۧۙۗ۫۠ۤۙۨۘ۠ۗۡۡ۠۫۬ۛۖۨ۠ۙۨ۫";
                                                    case 616687457:
                                                        str3 = "ۜۨ۫ۧۤۙۡۖۗ۠ۚۜۘۦۛۥۜۗۤۙۨۘۧۧۤۥۨۢ۟ۢ۟۬ۚۘۖۙۡۘۡ۟ۨۖۤۚۚۨۡۛۦۘ۠ۙۖ۬ۤۨۛۛۧ۟۬۫ۖۜ۫ۦۦۧۘۡۨۖۘ۟ۨۙۢۗۖ";
                                                        break;
                                                    case 1329799552:
                                                        str3 = "ۧۡۥۘۗۡۖۘۦ۟۬ۡۜۘۗ۫ۥۘۨۢ۫ۘۛۖۘ۠ۗۡۘۧۚۘۛۙۦۢۜۦۘۨۦۥۧۜۧۘ۠ۧۦۢ۠ۢۧۙۡۜۡۖۜۗۜۘ۫۬۬ۜۡۗ۠ۙۗۜۧۥۘ۠۟ۨۘۦۢۤۢ۟ۡۨ۟ۘۘۢۙۙۜۤ۟ۡۙۖ۫ۡۘۢۖ۠ۗۜۨۘۙۗۨۘۤۛ۟۫ۤۦۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case -104489180:
                                str = "ۢۘۨۘۦۙۖۚۨۚۨۡۨۘۦۦۨۘ۠۬ۗۨۧۖۖۙۨۘۜۢ۫ۦۛۦ۟ۨ۠۟۫ۛۙ۠ۦۘۤ۬ۘۖۘ۠ۜ۫ۚۛۗۤۚۨۥۗ۟ۖۥ۫ۦۢۧۛۡۖ۠۫ۚ۫۠۫ۜۘ۠ۖۢۗۥۧۘۜۘۛۗۧۜۦۖۛۘۖ";
                                continue;
                        }
                    }
                    break;
                case 349041378:
                    return;
                case 552690136:
                    str = "۠ۦۢۢۤۡۘۙۖۡۘۜ۬ۦۘۥ۫ۘۚۜۙۙ۬ۜۘۨۜۥۜ۠ۨۘ۠ۨۘۖۡۘۘۧۦ۠۟ۙ۫ۛۧۨۙۧۥۖ۬ۥۘۨۨۘۧۧۜۤ۫۫ۛۦۧۘۙۘۥۘۨۥ۟ۖۛۜۢۙۥۘۜۛ۠ۡۜۦۘۥ۠ۚۦۜ۟۠ۡۘۘۜ۬ۘۘۥۦۢۥ۫ۤۨۙۖۘۜۤۙ۠ۚۡ۫ۙ۬۠۬۟ۙۘۘ۟ۤ۟ۛ۠ۖ";
                    break;
                case 925737526:
                    this.overlayView = null;
                    str = "ۦۧۤۡۗۛۚ۠ۢ۟ۖۜ۠ۙۥۧۨۤۜ۫ۙ۠ۜ۟ۧۚ۬۠ۛ۠ۡۢۢ۬ۚۗۘۥۧۘ۠ۧۡۜۙۘ۬ۛۗۥۚۛ۠۠ۤۘۥۙۙۛۡۘۥۢۛۦۡۤۚ۠۫ۚۘۛۙ۟ۖ";
                    break;
                case 1492040725:
                    Close();
                    str = "ۜ۠ۖۗۛۗۧۘۛ۫۫ۗۦۘۘۘۦۖۜۘ۫ۨۨۘۘ۬ۛۛۧۜۘۘۛۡ۫ۥۦۙۗۦۘۡۚۚۘ۠ۦۘ۟۬ۜۘۢۡۜۖۦۘۘۦۦ۠ۧۧۜۢۢۛۘۦۦۤۜۙۖۤۖۤۨ۬۬ۡۙ۠ۥۙ۠۠ۜۘۖۗۥۤۦۡۘۢۖۘۥۨۦۘۜۧ۬ۙۡۘۥۢۡۘۘۙۦۘ۬ۖ۬ۗۚۚ۬ۙ۫ۢۙۗۥۗۦۘۖۧۨۘۗۜۥۚ۬۫ۖۚۚۨ۫ۛ";
                    break;
                case 1496528135:
                    this.windowManager.removeView(eSPView);
                    str = "ۢۖۖۘۤۢۤۙۚۙۛۜۘۘ۬ۨۡۘ۠ۥۧۘۖۗۙۨ۠ۡۥۘۨۘ۬۫ۛ۟ۘۡۖۘۖۗۛۜۘۛ۫۫ۨۚۘۘۨۚۘۤۚۜۘۨۛۙۤۥۨۧۛ۬ۛۦۘۨۡۨۜۗ۟ۦ۫ۙۛۜۖۘۛۖۜۘۜ۬ۜۘ۠۠ۘۙۤۡۘۦۘ۬ۡۖ۫۫۟ۗۘ۫ۜۦ۠ۥۜۥ۫ۘ۬ۛ۬۠ۨۘۛۗۡۘۙ۠ۘۘۛۚۖۘۥ۬ۖۘۛۚۜۖۗۖۖۢۖۘۗ۠ۡ";
                    break;
            }
        }
    }
}
