package kentos.loader.floating;

import android.app.Service;
import android.content.Intent;
import android.os.Build;
import android.os.IBinder;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.view.WindowManager;
import android.widget.ImageView;
import android.widget.RelativeLayout;
import androidx.core.view.InputDeviceCompat;
import androidx.core.view.PointerIconCompat;
import androidx.recyclerview.widget.ItemTouchHelper;
import kentos.loader.C0931R;
import okhttp3.internal.http.StatusLine;
import org.lsposed.lsparanoid.Deobfuscator$$app;
import top.niunaijun.blackbox.utils.FileUtils;
/* loaded from: classes2.dex */
public class ToggleBullet extends Service {
    private boolean checkStatus;
    private View mainView;
    private RelativeLayout miniFloatView;
    private WindowManager.LayoutParams paramsView;
    private WindowManager windowManager;

    static {
        String str = "ۗۡۨۙۘۨ۫۬ۘۘۙۗ۬ۖۛ۫ۚۤۜۘۥۗۜۜۡۤۛۥۘۤۙ۫ۛۥۚۛۦۦۙ۠ۜۘ۫ۖۘۜ۠ۥۘۧۙۖۘۜۡۜ۬ۘۖۥۦۨۘۤ۟ۨۤۧۗۤۘۦۙۢۛ۬۫ۥۢۦ۟ۤۙۦۛ۟۟ۗۗ۬ۢۙۖ۠ۜۡۨ۟ۨۗۦۤۡۙ۟۠۫۠ۨۚۨ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 498) ^ 174) ^ 665) ^ 428) ^ 872) ^ 826) ^ 87) ^ 423) ^ 557) ^ 237) ^ 938) ^ 507) ^ 291) ^ 162) ^ 917) ^ 671) ^ 171) ^ 987) ^ 98) ^ 244) ^ 212) ^ 124) ^ 404) ^ 998) ^ 941) ^ 36) ^ 94) ^ 536) ^ 323) ^ 268) ^ 783) ^ 1666079408) {
                case -914627891:
                    System.loadLibrary(Deobfuscator$$app.getString(-3440744820164616009L));
                    str = "ۗۛۜۘۖ۠ۦۥۥۤۥۦۥۘۨۧۜۤۘۘۛۙ۟۫ۗۛۧۦۗۘ۫۟۫ۤۜۘۢۗ۠ۜۖۛ۫ۗ۟ۛۧۡۤۨۛۨۗۘۘۤ۬ۚۡۤۚۚۖۡۨۗۙۧ۫ۥۦۦۥۘ۬ۜۜۜۤ۫";
                    break;
                case -676289889:
                    return;
            }
        }
    }

    private void InitShowMainView() {
        String str = "ۚۜۡۥۧ۟ۢۡۥۘ۬۟ۖۥۦۧۖ۫ۙ۟ۛۢۡۚۦۘۨۧۙۦۡۗ۠ۢۡۘۨۢۢ۠ۨۗۘۖۡۢۤ۠ۧۡۥۡۘ۬۠ۘۘۖۨ۟ۡۡۧۘ۬۫ۨ۟ۦۖۘۙۛۜ۟ۥۦۘۚۤۜۚ۫ۦۧ۟ۜۘۡۨۦۥ۬ۚۖۚ۬";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 69) ^ 796) ^ 944) ^ 626) ^ 903) ^ PointerIconCompat.TYPE_TEXT) ^ 414) ^ 585) ^ 751) ^ 582) ^ 896) ^ ItemTouchHelper.Callback.DEFAULT_SWIPE_ANIMATION_DURATION) ^ 512) ^ 794) ^ 968) ^ 722) ^ 252) ^ 414) ^ 339) ^ 642) ^ 117) ^ InputDeviceCompat.SOURCE_DPAD) ^ 54) ^ 358) ^ 835) ^ 389) ^ 334) ^ 420) ^ 507) ^ 655) ^ 772) ^ 1731795637) {
                case -1647197321:
                    ((RelativeLayout) this.mainView.findViewById(C0931R.C0934id.layout_icon_control_aim)).setOnTouchListener(new View.OnTouchListener(this, (ImageView) this.mainView.findViewById(C0931R.C0934id.imageview_aim)) { // from class: kentos.loader.floating.ToggleBullet.1
                        private float initialTouchX;
                        private float initialTouchY;
                        private int initialX;
                        private int initialY;
                        final ToggleBullet this$0;
                        final ImageView val$myImageView;

                        {
                            this.this$0 = this;
                            this.val$myImageView = r2;
                        }

                        /*  JADX ERROR: JadxRuntimeException in pass: BlockProcessor
                            jadx.core.utils.exceptions.JadxRuntimeException: CFG modification limit reached, blocks count: 408
                            	at jadx.core.dex.visitors.blocks.BlockProcessor.processBlocksTree(BlockProcessor.java:59)
                            	at jadx.core.dex.visitors.blocks.BlockProcessor.visit(BlockProcessor.java:39)
                            */
                        @Override // android.view.View.OnTouchListener
                        public boolean onTouch(android.view.View r10, android.view.MotionEvent r11) {
                            /*
                                Method dump skipped, instructions count: 1384
                                To view this dump add '--comments-level debug' option
                            */
                            throw new UnsupportedOperationException("Method not decompiled: kentos.loader.floating.ToggleBullet.View$OnTouchListenerC09461.onTouch(android.view.View, android.view.MotionEvent):boolean");
                        }
                    });
                    str = "ۥۜۥ۬۫ۢۡۨۡۧ۬ۥۖۡ۠ۤۤۦ۫ۜۡۘ۟ۢۜۘۚۨ۫ۖۤۢۢۙۤۙۤۦۖ۠ۤ۬ۤۗۡۛۡۡۤۥۘ۠ۘۤ۬ۥۨۘۘۘۢۚۛۥۦۦۛۘۛۡۖۜ۟ۡ۠ۡۘۧۛۗۜۥۨ۫ۜ۠۟ۥۧ۫ۛۚۜۡ۟ۚۙ۟۟ۨۧۘۙۧۙۗۗۥ۠۬ۘۖۜۘۧ۬ۦۘۘ۬۟ۨۚۥۘ۫ۛ۟";
                    break;
                case -1492641621:
                    return;
                case -1111551506:
                    str = "ۖ۠ۡۨۘۡۨ۬ۗ۠ۡۢۜۖ۠ۙۙ۟ۧۛۖۘۥۥۢ۫ۗۦۜۚۛۖ۫ۜۚۢۙۘۧۜۜۦۗۘۧۦۢۘۘ۬ۦۨ۫ۥ۬۟ۨۗۗۜۨۘۢۖۙۡ۠ۡۤ۫ۨۗ۟ۖۗ۫ۜ";
                    break;
                case 184096884:
                    this.miniFloatView = (RelativeLayout) this.mainView.findViewById(C0931R.C0934id.miniFloatMenu);
                    str = "ۙۨۤۤ۟ۚ۫۟ۖۘۨۘۖۘۚۖۧ۠۠ۥۘۚ۠ۡۘۢ۬ۨۘۖۗۦۖۦۧۨۧۡۘۥۜۦۡ۠۫ۖۢۨۘ۫ۦۘ۟ۥ۬۫ۢۘ۫ۙۜۘۥۦ۬ۤۚ۟ۦ۬ۖۤۜۘۙۙۖ۫ۨۖۙ۠ۙۥۘۘ۬ۗۖۙۗۙۡۡۤۚۗۙۤۡۘ۬ۘۘۥۡ۟ۛۤۤۥۗۜۘ";
                    break;
            }
        }
    }

    private void ShowMainView() {
        String str = "۬ۨۛ۫ۧۜۘۧۚ۬ۚۘۖۘۘۙۨ۬۠ۜ۬ۘۘۖ۠ۢۧۡ۠ۜۥۙۨۨۘ۫ۛۜ۬ۢۥۤۖۨۘۨۨۗۚ۫ۦۢۚۦۘۦۚۖ۬ۡۧۘۡۖۖۘۥ۟ۘۥۨۘۚۤۘۥۥۛۘۥۙۧۖۥ۫ۜۘۨۦ۫ۖ۫ۤ۫ۜۦۡۥۥۗۜۘۦۤۨۘۜۡۡ۟ۧۤۚۧۦۥۦۖۘۥۤۨۘۖۖۤ";
        WindowManager windowManager = null;
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 445) ^ 795) ^ 635) ^ 735) ^ 148) ^ 193) ^ 135) ^ 281) ^ 122) ^ 434) ^ 860) ^ 255) ^ 546) ^ 989) ^ 902) ^ 314) ^ 294) ^ 115) ^ 476) ^ 135) ^ 940) ^ 870) ^ 766) ^ 886) ^ 97) ^ 128) ^ 8) ^ 686) ^ 628) ^ 756) ^ 570) ^ (-317273268)) {
                case -992655989:
                    InitShowMainView();
                    str = "ۧ۫ۤۤۤۢۜۜۗۜۨ۫ۜۥۜۥۙۧۘۤ۟ۛۧ۫ۛۚۡۘۖۡۡۘ۫۬ۜۘ۬ۧ۟۠ۧۦۘۗۛ۠ۡۥۦ۠ۦ۫ۗۖۜۘۨۥۗۚۢۙۗ۟ۦۧۦۗۖۘۨۘۜۗۨۘۛ۟ۨۦۙۖۡۥۘۘۚۤۚۥۡۗۦۗۜۛۨۘۗ۠ۘۘۗ۟ۧ۬ۛۜۘۗۗۛۗۦۘ۟ۗ۟ۥۥۘۘۡۜۜ۬ۚۢۥۨۡۘ۠۬ۥۘۖۦۥۘۙ۬ۤۦ۠۠۠ۙۤ";
                    break;
                case -185670248:
                    windowManager.addView(this.mainView, this.paramsView);
                    str = "ۨۨ۟ۧۛ۬۫۬ۛۥۦۘۘۤۘۥۦۨۘۚۗۤۡۦۦۡۡۖۜۖۘۘ۬ۦۘۢ۫ۡۘۨۜۘۘۗۘۘۢ۫ۙۡۦۦ۫ۙۧ۬ۜۙۗۨۚۢ۫۟ۧۡۜۦۜۧۘۚۥۧۦۖۥۗۜۗۚۖۘۘۗۘۗۤۛۨۘۤۤۦۘۡۙۛۤۘ۫ۖ۠ۙۤۥۦۖ۟ۜ۬۫ۙۡۙ۬ۡۢ۫۫ۖ۟ۜۤۦۛۡۥۗۚۚ۬ۜۡۖ۬۬ۢۡۥ";
                    break;
                case -145846229:
                    str = "ۗۜۙ۫ۢۨۘۚۗ۠ۖ۫ۜۡ۫ۧۙ۬ۘۘۨ۟ۨۘ۠ۧۦۘۖۚ۟ۛۙۢ۫ۜ۟ۨ۬ۢۚۖ۫ۤۘۘۛۧ۟ۜۥۜۗۧۖۨۙۜۗۚۦۘۨ۬ۘ۟ۖۛ۬ۥۥۜۗۤۛۚۘ۟ۦۗ۟ۗۡۦۙۚۜۢۦۦۦۦۘ۬ۜۨ۫ۡۨۢۨۥۥۡۚۥۜۖۙۚ۠ۦۢۨۘۜ۟ۡۘۡۧۦۗۖ۬ۖۦۘ";
                    windowManager = (WindowManager) getSystemService(Deobfuscator$$app.getString(-3440744850229387081L));
                    break;
                case 279874419:
                    this.paramsView = getParaams();
                    str = "ۘ۬ۘۨۢۘۨ۠۫ۥۤۤۚۢۛۙۥۗۘۜۥۥ۬ۗۧۙۤۖۧۥۘ۫ۗ۫ۖۖۧۘۗۖۧ۠ۥ۬ۗ۟۟۫۟ۙ۫۬ۢۦۗۜۡۙۨۗۢ۬ۤ۫ۘۜۢۖۘۦۜ۟ۦۘۨۥۨۥۘۜۚۧۜ۟ۥۘۘۜۜ۬ۡۖۚۙ۬۬ۦۛۢۤۦۘۜۤۧۦۘۥۤۨۘ";
                    break;
                case 638102330:
                    str = "ۦۢۛۜ۟۟۫۫ۙ۫ۚۖۥ۫ۨۛۦۨۘ۫ۛۘۘ۬ۥۧۘ۟ۦۖۘۢۧ۬۬ۖۗۘۘۛۦۚۘ۬ۗ۬۠ۙۘ۟ۙۦۘۢۧۙۚۥۦۛۨۧۘۙۙۖۥ۟ۗۚۡۖۚ۠ۚۖۡۥۚۨ۟ۨۤۨۢۨۡۘۡۘ۬ۜۧۧۜۦۛۦۦۗ۠ۖ۠ۧ۠ۦۘۗ۟ۘۘ۠ۥۜۛۙۥۘۜۢۨۘۢۜۦۘۙۡۥۘۗۗۢ";
                    break;
                case 793732198:
                    this.mainView = LayoutInflater.from(this).inflate(C0931R.layout.toggle_aimbullet, (ViewGroup) null);
                    str = "۠ۨۚۥۧۨۘۡۢۚۗۡۥ۬ۤۘۚۨ۬ۡۥۘۢۛۖۜۛۥۘۜ۫ۖۘۡۚۤۙۤۥۘ۬ۦۡ۬ۛۨۘۘۜۢ۫ۨ۫ۧۗۡۜ۬ۥۘۧۚۢۢۡۧۘ۫ۨۖۘۤۤ۠ۛۛۥ۬ۖۢۤ۫ۥۧۘۢ۠ۦۤ۬ۨۗۤ۬ۗۢ";
                    break;
                case 1212629591:
                    return;
                case 2047407897:
                    this.windowManager = windowManager;
                    str = "ۖۙۤۨ۠ۥۘۧ۫ۧۗۛ۟ۨ۫ۘۘۗۜۡۘۧۧۧ۠ۦۦۨۢۙۗۜ۠ۖۘۘ۠ۨ۠ۘۖۘۦۡۚۜۛۥۢ۠ۤۚ۬ۚۚۜۦۜۢۡۘۜۗۥۘۖۚۤۤۗۦۛۦۡ۬ۚۘۗۥۜۘۖۥ۬ۡۘۦۤۛ۬ۚۦۦۘۢۙۘۘۗ۠ۥ۟۠ۢ۬ۡۧۜ۬ۥۘۥۜ۬ۡۨۤۛۖۜۨۛۧۦۙۨۡۘۖۘ";
                    break;
            }
        }
    }

    static /* synthetic */ WindowManager.LayoutParams access$000(ToggleBullet toggleBullet) {
        String str = "ۡۛۚ۠ۛۡۚ۬ۛۖۚۤۚ۬ۦۙ۫ۡۘ۟ۡۜۘ۠ۙ۬ۨۨۢۛۥۡۘۜۦۜۘۗۚۘ۠ۜۙۜ۠ۛۚۡۘ۠ۘۚ۫ۜۦۘۙ۫ۦۘۘۖۚۥۨ۫۟ۦ۫ۛۖۢۜۘۥۗۚۨۨۙۥ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 350) ^ 548) ^ 337) ^ 542) ^ 779) ^ 568) ^ 417) ^ 720) ^ 585) ^ 659) ^ 676) ^ 509) ^ 289) ^ 880) ^ 728) ^ 71) ^ 672) ^ 822) ^ 418) ^ 334) ^ 958) ^ 743) ^ 143) ^ 656) ^ 965) ^ 163) ^ 850) ^ 552) ^ 209) ^ 925) ^ 550) ^ (-1821642666)) {
                case -1708161482:
                    return toggleBullet.paramsView;
                case 382006832:
                    str = "ۙۨ۠ۜۤۜۙۘۙ۫ۛۗ۠ۨۤۥۖۡ۫ۤ۠ۡ۫ۦۘ۫ۡۤۥ۬ۘۘۚ۬۟ۚۨۨۘۥ۠ۧۘ۬ۙۢۦۜۘۡۢۛۧۘۖۙ۟ۜۘۦۖۡۦۘۨۦۦ۠ۚ۠ۖۢۗۛۨۚۢۘ۟ۚۦۨۖۘۖۤۢۗۛ۬ۗ۟ۥۗۖۛ";
                    break;
            }
        }
    }

    static /* synthetic */ RelativeLayout access$100(ToggleBullet toggleBullet) {
        String str = "ۡۢۜۗۜۥۘۚ۠ۡۡ۠ۥۨۨ۠ۖ۬ۧۦۧۧۨۘۤۗۧۡۨ۠ۦۘۗۘۖۨۜۥۢۘۧ۟ۚۖۢ۟۫ۛۙۦۘ۟۬ۧ۟۬ۨۘ۬ۦۧۘ۫ۘۖۘۦۤۙ۫ۦۘ۟ۡۥۘۧۧۖۙۘۦ۠ۚ۠۬۫ۘۦ۠ۦۢۡۘۦۦۗۢۥۢۛۦۜۜۖ۬ۚۦۨ۠ۙۖ۫ۤۢۖۦۜۘۙۡۘۨ۫ۘۘۚۡۗۥ۟ۨۦۥۘۦ۫ۨۙۧۢۡۧۨ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 940) ^ 486) ^ 689) ^ 719) ^ 729) ^ 352) ^ 484) ^ 947) ^ 914) ^ 858) ^ 419) ^ 541) ^ 622) ^ 792) ^ 518) ^ 787) ^ 525) ^ 895) ^ 11) ^ 343) ^ 790) ^ 85) ^ 363) ^ 913) ^ 84) ^ 490) ^ 847) ^ 206) ^ 832) ^ 924) ^ 311) ^ (-1284145812)) {
                case -460132355:
                    str = "ۚۢۚ۟۟ۡۘۘۖۨۘۦۤۥۜۗۖ۫ۤ۠ۥۤۚۖۤۙ۟ۡۖۛۖۧ۟ۙۖ۠ۘۦۥۥۧۥۨۤ۠ۖۡۤۘۤۨۘۦۨۢۥ۬ۛۦۥۨۘۗۚۢ۟ۢۙ۬ۛۗۗ۬ۘۘۜۧ۬";
                    break;
                case 1824045347:
                    return toggleBullet.miniFloatView;
            }
        }
    }

    static /* synthetic */ boolean access$200(ToggleBullet toggleBullet) {
        String str = "ۨ۠ۥ۫ۜۙۢۗۛۚۖۗ۫ۜۧۜۖۘۘۧۜۘۗۤۗۤۥ۟۫ۜ۫ۖ۫۟ۦۤۜۘ۫ۡۡۗۛۙۜ۠ۙۜۚۡۤ۫ۜۘۤۦۘۨۜۘۘۜۗۘ۠ۛۚۤۚۡۤۚ۟ۥۥۢۙۖۤۧۚۡۦۨۖۖۘ۟ۦۧۘۦۧۛۚۘۡۜۦۖۘۥۙۛ۠۠ۥۘ۠ۚ۠ۖۧۚۦۥۦۙۥۛۧۘ۠ۦۤۧ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 860) ^ 909) ^ 833) ^ 581) ^ 226) ^ 44) ^ 761) ^ 194) ^ 490) ^ 804) ^ 61) ^ 585) ^ 60) ^ 399) ^ 726) ^ 864) ^ 987) ^ 715) ^ 360) ^ 24) ^ 127) ^ 946) ^ 204) ^ 229) ^ 247) ^ 273) ^ 866) ^ 541) ^ 784) ^ 30) ^ 673) ^ (-724051072)) {
                case -1405225830:
                    str = "ۛۛۤ۬ۢۘ۟ۧ۟ۗۖۜۜۡۘۥۛۨۗۘۨۤۗ۫ۙۙۜ۟ۘۛۚۗۗۘۦۖۜۡۘۘۖۤۦۘۦۛۖۖۧۦۚۖۘۧۧۚۡۡۦۘۙۗۘۘۧۧۚۢۜۧۘ۬۠۫۠۠ۧۦۖۗ";
                    break;
                case 911225900:
                    return toggleBullet.checkStatus;
            }
        }
    }

    static /* synthetic */ boolean access$202(ToggleBullet toggleBullet, boolean z) {
        String str = "ۦۖۖۨۙۜۗۗۜ۬ۗۥۥۘۘۥۛۘۘۖۖۘ۫۠ۦۘۨ۬ۜ۬ۢۙۖۧۘۨۛۖۘۡۨۥۘ۬ۜۢۘۙۘۘۗۘۢۙۨۗۦۖۜۘ۠ۦۛۥ۠ۖۘۜۨۥۘۥۛۢۧۢۡ۫ۙۗۤ۬ۘۜۤۛۖۨ۟ۗۘۖ۬ۛۢ۬ۖۥۘ۬ۡۘ۠ۦۘۘۗۛ۬ۧۦ۟۬۟ۘۘۨۥ۟ۘۦۘۚۘۚۛۤۡۧۨ۬";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 822) ^ 932) ^ 826) ^ 963) ^ 7) ^ 196) ^ 399) ^ 949) ^ 63) ^ 442) ^ 14) ^ 899) ^ 966) ^ 906) ^ 381) ^ 294) ^ 99) ^ 521) ^ 136) ^ 351) ^ 706) ^ 665) ^ 527) ^ 445) ^ 223) ^ 958) ^ 872) ^ 475) ^ 80) ^ 58) ^ 120) ^ (-627953841)) {
                case -1354432927:
                    str = "ۚۤۥۡۜۘۛۡۦۘۛ۫ۨۦۖۦۘۤۤۢ۬ۗۘ۠ۗۘۘۗ۫ۜۘۜ۠ۨۘ۟ۘ۫ۢۖۢۘۘۘۧۛۥۦۚۛۗۚۨۥۗۨۘۡۗۚ۠ۚۗ۬ۘۡۘ۬۬ۗۘۡۡۘۜ۠ۡۘۢۛ۬ۛۧۚ";
                    break;
                case 702088750:
                    str = "۫ۧۘۢۗۥۥۘۦۤۧۚ۠ۙ۬۫ۖۡۘ۠ۙۦۘ۬ۚۗ۫ۙۖۘۖۦۘۘۥۙۘۘۘ۟۫ۙۦۜۘۥۤۛۘۤ۬ۡ۟۫ۨۡۤۘۗۡۧۨۜ۠۬ۡۦۜۖ۬ۤۚۡۚۧۛ۫ۤۧۖۘۖۧ۠ۖ۠ۛ۫ۖۡ۟ۡ";
                    break;
                case 803567296:
                    toggleBullet.checkStatus = z;
                    str = "۟ۧۦ۠ۥۦ۬۠ۨۘۧ۟ۢۛۧۨۖ۟ۘ۬ۨ۫ۖ۟ۢ۫ۙۖۘۘۤۙۙۚۢۤۢۖ۬ۦ۫۠ۡۘۥۚۨۘۡۖۛۦ۫ۖۘۤۛۖۖ۠ۚۖۤۨۘ۠ۢۡۘۗۦۦۘ۬ۖۜ۫۬ۜۤۛۜ۠۫ۜۘۢ۠ۨۘۥ۠ۜ۠ۨ۬۟ۥۘۦ۫ۖۘۨۜۡۘۘۘۦۘ۟ۖۗۨۦۤ";
                    break;
                case 1736024041:
                    return z;
            }
        }
    }

    static /* synthetic */ View access$300(ToggleBullet toggleBullet) {
        String str = "۠ۙۦۘ۫ۦۢۗ۟ۧۦۧۤۥۨۙۢۙۢۖ۠ۜ۫۠۠ۗۜۦۘۡۛۢۖۡۡۘۚۜۦۘۙۨۘۚۙ۠ۥ۫ۥۤۚ۬ۗۢ۟ۢۡۡۛۡۤۨۥۘۘۦۨۘۜۜۘۡ۫۫ۦۥۗۥۤ۟ۘۖۘ۟ۨۛۤۦ۠ۡۢۙۜۙ۟ۚۘۘۛۥۘۚۡۚ۟ۧۙۥ۠";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 207) ^ 712) ^ 721) ^ 206) ^ 472) ^ 40) ^ 610) ^ 701) ^ 758) ^ 157) ^ 504) ^ 767) ^ 177) ^ 488) ^ 185) ^ 712) ^ 597) ^ 988) ^ 186) ^ 492) ^ 583) ^ 472) ^ 854) ^ 807) ^ 124) ^ 174) ^ 334) ^ 657) ^ 368) ^ 517) ^ 719) ^ (-421846547)) {
                case -923431805:
                    str = "ۨ۬ۦۛۖۧۘۢۙۘ۠ۘۘۡۛۛۜ۠ۤۤۢۜۘۖۡۥۡۗۖۘ۫ۥۥۘۦۡۨ۬ۨۘۢۦ۟ۢۚ۟۫ۘۧۘۡ۬ۧ۠ۢۥۘ۬ۨ۠ۚۘۘۘۢۨۘۘۧۙۗۘ۫ۥۘ۠ۙ۬ۧۢ۠ۜۚۜۘ";
                    break;
                case 901052790:
                    return toggleBullet.mainView;
            }
        }
    }

    static /* synthetic */ WindowManager access$400(ToggleBullet toggleBullet) {
        String str = "ۢۤۛۘ۠ۥۘۖ۠ۨۨۧۘۛۦۧ۫ۙۘۘۥۖۘۨۡۡۦۚۜۘۙۧۨۡۜۙۡۖۙۡۥ۟ۜۧۘۘۘ۠ۘۘۦۢۘ۠ۥۦۨۚۘۘۗ۠ۢۦۖۚۢ۬۠۬ۗۦۡ۬ۢۖۛۜۘ۠ۜۖۜۢۦۡ۫ۖۘۛ۬ۢۚ۫ۦۜۦۥۨ۬ۖ۬ۦۛۗۧۖ۟ۚۦ۠ۦۧۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 450) ^ 870) ^ 225) ^ 769) ^ 568) ^ 884) ^ 469) ^ 422) ^ 614) ^ 54) ^ 802) ^ 157) ^ 831) ^ 594) ^ 46) ^ 974) ^ 144) ^ 167) ^ 930) ^ 391) ^ 595) ^ 321) ^ 816) ^ 741) ^ 621) ^ 162) ^ 958) ^ 547) ^ 188) ^ 325) ^ 866) ^ 1485578105) {
                case -418400957:
                    str = "ۡۧۘۘۦۧۦ۟۠ۗۖ۟ۢۨ۬۠ۛۨۧۘ۫۫ۙۗۧۗ۫ۨۡۧۘ۫۬ۢ۠ۦۖۘ۬ۥۖۘۗۦۦۘۤۚۥۘ۬ۡۦۘۢۥۧۘ۟ۖۜۨ۠ۙۨۦۦۜۡۥۡ۬ۘ۟۬۠۟۬ۛۦۤۡۢۨۚ۠ۨۥۘۨۡۖۙۛ۬ۜۦۦۘۗۙۨۘۧۜۥۘ۟ۗۦۘ۫ۜ۬ۘ۬ۥ";
                    break;
                case 1577434645:
                    return toggleBullet.windowManager;
            }
        }
    }

    private static int getLayoutType() {
        String str = "ۥۚۡۘۨۧۖۘ۫ۛۘۘ۠ۦۧۤۤۦۘۢۡۘۘۛۤۖۡۧۗۚۧۚۗۡۦۧ۟ۢۙۜۧۘۡۖ۬ۙۛ۠ۛۧۢۦۡۛۤ۬ۡۛۡۘۜۤ۬ۚۢۥۘۢۢۡۘۖۥۤۤۗ۟۟ۚ۠ۗۡۚۧۧ۟ۢۖۘۖۨۥۚۙۦۘ۬ۘۗ۬ۢۤۗۡۛۥۧۗۚۦۡۘۥۧ";
        int i = 0;
        int i2 = 0;
        int i3 = 0;
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 295) ^ 89) ^ 552) ^ 893) ^ 708) ^ FileUtils.FileMode.MODE_755) ^ 469) ^ 426) ^ 938) ^ 42) ^ InputDeviceCompat.SOURCE_KEYBOARD) ^ 712) ^ 428) ^ 152) ^ 719) ^ 203) ^ 883) ^ PointerIconCompat.TYPE_VERTICAL_TEXT) ^ 627) ^ 526) ^ 881) ^ 19) ^ 401) ^ 676) ^ StatusLine.HTTP_PERM_REDIRECT) ^ 6) ^ 370) ^ 479) ^ 510) ^ 363) ^ 473) ^ 1436491446) {
                case -1534918748:
                    str = "ۦۙۘۘۚ۟۫ۨۦۖۨۢۜۘۧۢۛ۟ۜۘۘ۠ۛۦۘۥۜۜۖ۫ۧۚۨ۟ۖۢۘۧۜۨۧۙ۫ۧۦۘۚۦ۠ۖۤۦ۫ۘۢ۬۬ۚۥۢ۠ۥۧۜۜۨۘۨ۫ۢ۫۫ۘۘ۟ۚۥۨۘۥۘۖۚ۬۠۠ۖۘۚۦۡۤۡۢۡ۠ۨۘ";
                    i2 = i;
                    break;
                case -1390460934:
                    String str2 = "ۥ۫ۜۧۙۖۘۤۥۖ۠ۘۥۘۖۚۜۘۚۧۦۘ۠ۥۜۙۙۜۡۡۖۘۘۧۡۘۧۖۤ۫۟۠۬ۧۧۢۗۢۦۢۜۘۨۧ۫ۜۦۦۘۥۚۨۘ۫ۛۘۘۚۛۘۘ۬۟۬ۛۨ۠ۥۖۥۘۢ۫ۢۚ۫ۜۘۙۤ۠ۖۘۡۥۚۦۘۖۡۚۘ۬ۢ";
                    while (true) {
                        switch (str2.hashCode() ^ (-726475155)) {
                            case -1690396537:
                                str2 = "ۜۨۧ۬ۘۖۘۜۘ۬ۜ۠ۘۘۧ۟ۛۘۨ۟ۚ۠ۘۗۜۛ۟ۗۥۙۙۤ۟۬ۘۛ۫ۡۘۢۢۙ۠ۢۥۘ۟ۥۨۖۥۚ۬ۛۥۡۢۦ۠۬۠ۨۘۤۙ۟ۨۗ۠ۦۤ۠ۚ۠ۨۤۧۖۤ۟ۙۙۨۙ۬ۘۦۘۘۥۥ۠ۧ۠ۚۨۘۙ۠ۙۘۘۧۙ۠ۗۤۘۜ۠ۘۘ۫ۖۨۘۡۛۜۛۨۙۢۜۘۖۛۡۘۢۛۖۘۥۛۧۤۦۛۢ۫ۥۦ۠ۘۘ";
                            case -373679539:
                                str = "ۚۘۨۘۤ۟ۡ۬ۦۥۘۤۥۥۘۦۡ۬ۢۙۡۘۤۦۜۨۦۖۘۢۘۙۧۢۘ۫ۧ۠ۗۤۚۛۤ۬ۗۙ۬ۛۦۜۥۘ۬ۗ۟ۜۜ۬ۖۗۖۗ۫ۥۦۖۦۘۢ۠ۚۦۖۥۤۥۚۨۡۨ";
                                continue;
                            case -278977280:
                                str = "۠ۨ۠ۚۖۢ۬ۤۥۘۖۗۦۛۨۜۘ۫۟ۧ۠ۗۤۚ۠ۘۘۥۤۧۜ۬ۦۘۥۤ۟ۙۧ۠ۙۜۧۘۖۚۤۢۛۜۘۥ۟ۜۘۗۚ۬۬۫ۛ۬ۗ۬ۡۢۧۦۗۤ۟ۦۡ۫ۚ۫ۦۚۤۚ۫ۙۙ۠ۘۘۗۨۧۥۦۥۘۚۗۘۧ۠ۘۗۖۗۜۖۡۘ۠ۨۧۡۛۗۖۤۢ";
                                continue;
                            case 792120513:
                                String str3 = "ۚ۠ۦۡ۬ۧ۫ۚۥۘۥۢۙۖۜۚۖ۫ۘۘۖۥۛ۟ۜۖۙۨۥۥۨۜ۟ۤۡ۫ۥۛ۫۟۫ۢۗۜۘۧۧۡۥۖۧۖۥۢۚۗۛۘۖۘ۫ۤۡۙۜۘۘۜۡۙۘۡۚۢۘۖۙۦۦۤۜۦۨۘۡۘۥ۫ۧ۠ۗۧ۠ۚۖۘۦۨۧۘ۬۬ۨ۬ۗۤۢۘۘۗۘۧ";
                                while (true) {
                                    switch (str3.hashCode() ^ 107216523) {
                                        case -1644478328:
                                            str2 = "ۢۨۖۘ۬ۛۙۥۚۡۘ۬ۡۚۡۘ۬۫ۖۜۘۤ۟ۤۗ۠ۗۙۗۗۛۙۥۨۜۛۧۡۘۙۚۡۢ۫۬ۥۖۘۚۘۚۤۛۜۘۘۖۧۘۦۤۙ۫ۙۨۘۗۜۡۧ۬ۚۜۤۢۡۗ۠ۘۨۖۘۘ۠ۨۘۥۥۖ۟ۜۡۘۛ۟ۜۦۨۘ۬ۛۘۘۗۨ۠ۚۜ۫ۙۙۡۥ۠ۘۘۜۖۢۤۥۜۘۦ۬ۧۢۦ۟ۨۙ۬";
                                            break;
                                        case -1128024750:
                                            String str4 = "ۜۖۥۘۘۖۚۚۨۨۥ۠ۜۜۛۙۨۜ۬ۖۛ۫۫ۧۜۘۤ۫ۜۘۚۢۜۥۧۨ۠ۚ۫ۨۧۜۘۛۤۗۨۘۗۗۥۙۖۘۧۙۢ۠ۥۡۘۢۤۜۘۤۚ۟ۜ۬ۥۘۤۢۖۘۥۖۜۚ۟ۜۘۤۧۦۘۥ۠ۡۗۚۖ۠ۡۧۘ۟ۚۡۙۘ۟ۡۤۜ۬ۘۧۙۜۤۖۨۚۧ۫ۜۚۘۚۗۦۨۘۜۡۚۤۢۤۧۜۡۘۖۡۘۚۗۧۤ۬ۙۢ۠ۡۘ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 1312719618) {
                                                    case -1957335119:
                                                        str3 = "ۖۜۥۘۡ۬ۥۙۘۧۘۡ۟ۥۘۤۡۛۧۚۙ۬۬ۜۘۨۛۚۡۛۡۘۖ۠ۜۘۤۢۚۧۥۥۘۤۖۚۘ۫ۨۘۥۦۗۚۨۚۙۥ۟ۘۖۧۘۖۡۗۡ۠ۤۙۗۗۖ۠ۖۘۙ۠۟۠ۘۖۘۜۧ";
                                                        break;
                                                    case -1535934814:
                                                        str3 = "ۤۦۗۘۗۧۧۢۘۙ۠ۢۡۦ۬ۖۥۧۘۤۚۚۚۦۨۧۦۡۘۗۙۛۥۦۗۢۙ۟ۡ۟ۗ۟ۥ۬ۢۚۥۥۢۙۜۜۛ۟ۚۙ۠ۜۧۛ۠ۚۘۗۘۙۘۙۤۗۗۤۢۧۧۛۙۗۜۥ۠ۡ۫ۨۙۡۘ۟ۙۨۨ۟ۜۘ۟ۘۘۘۖۤۚۗ۫ۦۘ۬۫ۨۘۛۨ۟ۙۡۧۘۥۗۨ۬۠۟ۘۖۚۨ";
                                                        break;
                                                    case -345654394:
                                                        str4 = "ۜۘۖۦۘۨۜۛۛ۬ۘ۫ۢ۟ۘۘ۫ۡۖۤ۬ۜۚۥۨۘۜۥۨۘ۟۬ۘۢ۟ۙۘ۫ۧۦۡۨۘ۠ۥۖۘۘۚۖۘۦۖ۟ۖۨۘۚۜ۫ۖۗۥۛۦۡ۟ۖۛۨۢۗۜۧۡ۬۬ۨۡ۫۫ۡۖ۬ۛۦۘۛۖۨۘ۫ۙۗ۟ۗۡۡۛ۫ۘۧۡۘ۬ۙ۠ۙۗ۠ۙۤ۠ۗۢۤ۫ۛۦۛۡۢ۠ۖ۠ۧۘ";
                                                    case 815871821:
                                                        String str5 = "ۧۛ۟ۢۘۗۥۚۨ۬ۦۨۛۜۦ۫ۗۦۘۧۥۤۦۗۖۘۗۧۨۘۙۡۧۘۨۧۥۘۘۡۨۘۨ۠ۨۘۘۨۖۘ۠ۤۚۘ۫ۚۡۙ۠ۥۨۥ۫ۛۢ۬ۗۤۨۗ۠۫ۧ۫ۛۧۢۙۘۡۖۦ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ 2062314853) {
                                                                case -1141457846:
                                                                    str5 = "ۨۤۖۤۨۨۘ۬ۙۨۘۗۖ۬۠ۘۘۜۦۥۘۢۢۤ۟۬۫ۘۘۡۘۚۡۥۘ۫ۨۡۘۥ۠ۛۦۜۦۘۦۨ۟ۢۢۙۨۥ۫ۚ۫ۧۨۨۢۦۤۤۡۢۤۥۦۘ۠ۜۚۘۤۤۜۚۖۜ۠۠ۡ۠۬۬ۦۥۦۛۖۨۧۦۘ۠ۦۨۛۖ۬ۙۖۜ۫ۗۨۘۥ۫ۙۘۘۘۤ۟ۤۦۦۨۘ۫ۢۜۦۥۘۤۛ۫۠ۗۨۦۜۡۦۡۡۘۙۚۛۤۦۜۘ";
                                                                case 538370725:
                                                                    str4 = "ۥ۬ۜۙۦۙۖۦۚۚۦۙۨۥۦ۟۬۠ۤۡۜۘۙۤۨ۫۫ۘۤۗۥۘۖۧۨۦۜ۟ۡ۟۬ۧۜۧ۫ۨۨۘۖۘ۫۬ۜۛۨۙۚۨۘۢۙ۟ۨۛۜ۫ۨ۫ۨۘۡۤۚۜۧۜ۬ۤۖۖ۫ۙ۟ۡۚ۫ۘۡۥۘۖۨۙۥۘ";
                                                                    break;
                                                                case 787318676:
                                                                    String str6 = "ۡۤۜ۫ۡۘۨۡۘۘ۫ۡۘۛ۠ۛ۟۟ۤ۬ۡۨ۠۫۟۬ۖۖۘۢۤۤۖ۫ۢۗۜۘۘ۟۠ۤۢ۟ۨۘۗۧ۫ۥۦۜۦۦۖۘۚۙۥۨۤ۬ۡۗۦۢۚۥ۫ۢۥۚۘۘۨۗۨۘ۫ۧۦۘۜۖۨۘۢۤ۠ۘۧۥۢۗ۫ۧۤۙ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ (-2068332546)) {
                                                                            case -1394553551:
                                                                                str6 = Build.VERSION.SDK_INT >= 26 ? "ۘۘۦۦۙ۠۬ۚۘۘۢۘۧۘۡ۟ۧۦۖۙۦۛۖۘۤۢۜ۫ۚۘ۠ۘۘۙۥۡۢۖۘ۫۟ۛۢۡۧۘۖۗۖۤۙۙۨ۠ۗۗ۬ۙۢۤۛۖۚۤۙ۬ۨ۫ۗ۬۬ۥۦۡۛۛ۬ۖۘ" : "ۖۧۡۘۨۜۘۨۛۦۘۥۗۜۨ۫۬۬۠ۦ۬۫ۘۘۥۜۘۘۥۛ۫۬ۚۤۗۜۧۘۨۡۥۘ۫ۦۨۨ۟۠ۛۡۦۘۥۤ۟ۜۦۘۘۨۘۚۡ۫ۜۙۧ۫ۨۘۨۗۚ۬ۜ۟ۘۘۛۤۗۚۦۢۙۘۤۥۖۖۡۘ۫ۤ۬ۚۤۦۘۚ۫۫ۙ۫ۖۘۛۤۙۚ۠ۨۘ۬ۢۙۡ۫ۛ۟ۢۥۘۙۗ۟۫ۥۘۤۗ۠";
                                                                            case -694048432:
                                                                                str6 = "ۖ۟ۢۦۚۜۨۗۧۨۤۖۥۦۗۧ۠۠ۜۜۘۥۡ۬۟ۗۥۜۙ۬۬ۡۖۤۜۡۘۘۡۦۧۘۦۘۤۖۡۘۡۘۘۢ۬ۙۤۚۚ۫۬ۡۦۜۤۦ۫ۛۜ۟ۚۜۦۥۥ۠ۢ۫ۘۘ";
                                                                            case -368051695:
                                                                                str5 = "ۜۡۡ۬ۧۥۘۗۢۦۚۥۦۘۤۢۤۜۜۖۧۙ۫۫ۢۘ۟ۤۘۘۦۦۜۙۚۘۘۛ۠ۜۘۥۘۜۘۚۦۨۘۧۥۖ۬ۙۢ۫۫ۜۘۨۡۗ۟ۛۛۢۡ۬ۗۜ۟ۦۨۧۘۤۡۡۘ۫۟ۨۜۡۜ";
                                                                                break;
                                                                            case 1858390844:
                                                                                str5 = "ۧۗۥۘۛ۫ۜۘۥ۟ۨۘۜ۟ۡ۠ۗۖۗ۟ۥۘۘۨ۫ۢۙۚۥۙۚۡۗۘۥۛ۟ۥۨۘ۬ۤ۬ۧ۟ۘۙۖۚ۬ۧۦۛۗ۬۟ۢۤۢۙۖۖۙۨۘۘۚ۬۬ۙۘۡۡۢۗۖۘۜۥۗۘ۬ۖۘۖ۫ۦۘۦۥ۫ۗ۠ۦۘ۟ۦۧ۟ۨۘۡۘ۬ۢ۫ۜۘۘۛۨۘ۠۫۟";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case 2143214697:
                                                                    str4 = "ۚ۠ۗۗۧۧۢۛۥۙۗۨۘۤ۬ۦۘۚۜ۟ۡ۬ۧۢۜۜۘۤۧۜۤۨۦۘۖۖۡۧۙۛۦۧۛۛۢۦۡۢۖۘۘۜۡۧ۬ۨۘۤۧۤۥۜۧۦۜ۟ۗۧۚۘۛ۫ۢۖۘۡۥۥۧۢۦۤۢ۠۬ۨۜۢۙۢۜۚۡۢ";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                }
                                            }
                                            break;
                                        case -1026508017:
                                            str2 = "۠ۜۘۘۙۧۘ۟ۥۗۤۚۙۜۦۡۘۥۡۡۘۚۛۘ۫۬ۛۙ۠ۘۘۥۖۖۢۧۤۙۚۧۖۨۘۧ۟ۙ۬۬ۘ۟۫ۡۘۙۜۦۘۢ۠ۦۘۗۚۜۜۥۚۡۨ۠ۢ۟ۖ۠ۖۜۜۘ۬ۦۘۘ";
                                            break;
                                        case 859313132:
                                            str3 = "ۗ۟ۨۙ۠ۦۘۘ۫ۡۧۛۦۘ۫ۨۤۛ۟ۦۤۤۖ۫ۚۘۘۨۨۙۙۨۘۨ۬ۦۘۙۢۗ۬ۜۘۘۙۢۘۧۛۗۤۤۥۥۗۡ۫ۙۙۥۧۖۘ۠ۙ۠ۚۥۦۘ۟ۜۦۘۧۙ۬ۖۥۗۧۧۜ";
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case -1234814046:
                    return i2;
                case -1088503102:
                    i3 = 2038;
                    str = "ۘۧ۠ۜ۬ۘۘ۠۟ۚۛ۟ۜۘۨۘۖۢۖۖۘۢۧۚۨۥۜ۬ۥۘۡۥۖۛ۬ۘۘۗۨۧۘۤ۬ۗۨۜۧۘۡ۬ۛۥۧۦۚۨۨۡ۫ۥۥۡۡۧۗۖۘۗۙۡۘ۟ۥۤۡ۬ۥۘۥۘۧۘ۫ۡۡۢ۟ۤۤۗۙۖۛۥۘۦ۬ۦۚ۟ۨۧۤۡۘۡۖۨۘ۠ۡۖۘۖ۬ۙۥ۠ۦۘ";
                    break;
                case 449768114:
                    i = 2002;
                    str = "ۦۧۖۜۥۧۗۙۥۘۥۖۡۘ۠ۨۦۧۡۥۧۙۤ۬ۧۨۜۜۛۥۗۦۗۘۨۘ۟ۛۡۘۛۤۤۗۜ۫ۚۜۡ۫ۜۥۙۘۘۘۨۥۚۢۙۡۨۨ۟ۢ۫۠ۨۧۡۘۨۚۦ۠ۛۤۚ۠ۨۘۢۛ۬۫ۥ۫ۗۤۘۘۥۥۦۘ";
                    break;
                case 636514815:
                    str = "ۧۦۗۜ۠ۡۘۤۧۜ۫ۡۥۘ۬ۨۥۢۜۡۘۨۘۜۘۗ۫ۛۧۙۨۙ۫ۡۘۚۡۧۧۨۡۘۗۦۗۢۜۙۙۙ۫۟ۘۘۖۘ۠ۢۦۨۙۨۦۜۛۗۗۗۡۘ۟ۤ۫ۛۙۨۧۢ۬۠ۚۥۘ";
                    i2 = i3;
                    break;
                case 652287782:
                    str = "۟ۡۖۜۗ۫ۨۖۨۨۛۘۘۖۥۢۗۜۧۘۖ۬ۙۚۘۡۘۜۡۛۨۜۦۘۧۧۢۡ۫ۡۘۘۤۥۙۗۖ۟ۨۦۧۗۜۗۦۧۨۖۤۦۖۨۘۡۢۡۘۤۨۘۦۤۙ۫ۤ۬۠ۥ۫ۥۙۘۚۥۥۘۛۛ۟ۥۥۡۥ۟۠ۨۧۡ۠ۙۦ۟ۨۖۘۗۦۡۤۢۨۘۖۛۙۛۧۚ۟ۧۦۥۧۗ۬ۦۨۘۢۥۜ";
                    break;
                case 2026639041:
                    str = "ۦۙۘۘۚ۟۫ۨۦۖۨۢۜۘۧۢۛ۟ۜۘۘ۠ۛۦۘۥۜۜۖ۫ۧۚۨ۟ۖۢۘۧۜۨۧۙ۫ۧۦۘۚۦ۠ۖۤۦ۫ۘۢ۬۬ۚۥۢ۠ۥۧۜۜۨۘۨ۫ۢ۫۫ۘۘ۟ۚۥۨۘۥۘۖۚ۬۠۠ۖۘۚۦۡۤۡۢۡ۠ۨۘ";
                    break;
            }
        }
    }

    private WindowManager.LayoutParams getParaams() {
        WindowManager.LayoutParams layoutParams = null;
        String str = "ۢۜۗۚۙۨۘ۟ۜۡ۟۠ۦۚۥۘۙۗ۟ۤۛۤ۫ۨۡۡۘۛ۠ۛۚ۫ۘۛۖۘۘۛۥۖۢۧۡۘۨۜۖۙۥۡۘۚۖۜۛۦۘۘۧۡۦۘۤۜۖۤۙۥۤ۬۠ۙۡۧ۠ۚۡۦ۟ۗۜ۠ۨۚ۫ۜۙۤۜۘۤ۠ۢ۫ۢۨ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 598) ^ 936) ^ 2) ^ 933) ^ 414) ^ 814) ^ 710) ^ 601) ^ 762) ^ 870) ^ 969) ^ 63) ^ 424) ^ 760) ^ 220) ^ 120) ^ 763) ^ 426) ^ 463) ^ 775) ^ 374) ^ 467) ^ 700) ^ 14) ^ 405) ^ 127) ^ 645) ^ 706) ^ 592) ^ 685) ^ 823) ^ 1010807365) {
                case -1143553972:
                    str = "۟ۛۥۜ۠ۚۨۛۥۘۖۡۛۗ۫ۖۚ۟ۨ۬ۢۘۘۛۤۧ۫ۨۧۘ۟ۢ۫ۨۢۨۘۘۘۡۖۢۥۘۜۜۖۘۢۘۥۘۜۚۦۘۨۤۗۤۘۤ۟۟ۘۘۚۜ۠ۢۨۨۦۨۨۘۢ۠ۛۚۧۧ۫ۗۜۥ۬۟ۡۙۜۜۥۖۨۘۨۘۡۛۢ۬ۜۢ۟۬ۢۘ۬ۦۛۢۧ۠۟ۡۥۦۖۜۡۘۘۡ۬ۘۘۢۧ۬ۢۜۜۙۢۖۘۚۙۨۥۜۥۖ۫ۧۡۤۧ";
                    break;
                case -682503557:
                    str = "ۘۥۨۨۢۙۙۙ۟۬ۗۤۛۖۗۗۡۘۥۦۖ۬ۘۙۤ۠ۚۥۘۜۖۜۛۙۘۙۛ۬ۘۥۢ۫ۦۙۧۚۖۥۘۘۚۜۧۚۥۥۛۙۚۦۦۧ۠ۧۚۚۛ۫ۖۖ۟ۚۡۨۦۧۘ۬۬ۙۖۖۥۗۤ۫ۤۜۖۘۘۧ";
                    layoutParams = new WindowManager.LayoutParams(-2, -2, getLayoutType(), 8, -3);
                    break;
                case -429107883:
                    layoutParams.gravity = 17;
                    str = "ۨۖۤۤۡۜۦۘۖ۫ۘۛۡۖۨۘۚۥۜۘۗۡۘۘۛۘۘۘۘۤۘۘۙ۬ۨۗۨۨۢۗۛۢ۠۠ۙۢۦۘۧۜۡۖۘۡۙۡۘۖ۫ۛ۟ۛۥۥۘۘۚۙۘۘۙ۫ۦۘۧۜۘۘۨۗۦۦ۟ۤۡۛ۫۠ۨ۬۟ۘ۫ۢۘۘ۫ۧۦ";
                    break;
                case -402424753:
                    layoutParams.x = 0;
                    str = "ۘۥۖۘۘۚ۟ۘ۬ۘۘۨۧۡۘۙ۠ۜۚۜ۬ۨ۟ۘۘۙۡۥۙۡۧۨ۬ۜۧۘۙۛ۫ۘۘ۟ۢۜۨۥۛۦ۟ۘۗۥۜۖۨۡۘۜۡ۠ۢۖۡۦۛۜۗۜۧ۠ۙۨۜ۟۫۟ۗۨۘۤۡۢۤ۠ۡۚۡ۠ۚۤۡۛۚۜۘۘۗۧۛۗ۠ۢۖۘۗۜۨۘ۟ۜ۠ۧۗۘ";
                    break;
                case 515095211:
                    return layoutParams;
                case 1554169692:
                    layoutParams.y = 0;
                    str = "ۧۜۨۗۜۖۘۨۛۗ۠ۖۧۚۖۥۘۦۙۨۘۚۤۥۢۢ۠ۖ۠۬ۢۘ۫ۦۚۢۥۘۙ۠ۨۘۘۜۜۗۗ۟۬۟ۖۘۘۧۨۜۤۤ۬ۘۢۢۦۡۨۛۜۘۖۘ۟ۥ۟ۤۧ۬ۥۙۜۚۙۦۢۖۨۥۘۚۙۗۧ۟ۖۘۥ۠ۜۘ";
                    break;
            }
        }
    }

    public native void ToggleBullet(boolean z);

    @Override // android.app.Service
    public IBinder onBind(Intent intent) {
        String str = "۟ۜۜ۟ۙۘۨۚ۬ۢۡۡۘ۟ۦۦۗ۫۬۬ۜۥۘۤۗۧۚۛ۬ۥ۟ۗۛۦۨۘۦۗۥۘ۠ۚۘۘ۫ۤ۬ۦۥۨۘۛۨۘۘۡۚۨۚۗ۫ۛۘۡۘ۬ۡۜۘۙۙۘۘ۫ۙۜۤۜۘ۠ۛۨۘۦۧۛ۬ۖۜۘۤۨۢۨ۬ۦۘۦۤ۟ۥ۠";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 975) ^ 466) ^ 621) ^ 378) ^ 640) ^ 938) ^ 530) ^ 736) ^ 738) ^ 448) ^ 503) ^ 796) ^ 661) ^ StatusLine.HTTP_TEMP_REDIRECT) ^ 76) ^ 68) ^ 917) ^ 280) ^ 839) ^ 649) ^ 979) ^ 651) ^ 138) ^ 535) ^ 131) ^ 999) ^ 664) ^ 759) ^ 858) ^ 439) ^ 626) ^ (-620782744)) {
                case 682388325:
                    str = "ۤۥۖۘۧۤ۟ۗ۬ۡۧۖ۟ۖۥۙۢۡۖۦ۠ۤ۬ۜۧۨۗۚ۫۠ۗۡۗۤۛۜۤ۠ۨۙ۬ۛۚۛ۟ۙۥۨۘۚۡۥ۫ۤۡۘۡۦ۠ۤۦۜۖۡۧۘۛ۠۫ۤۡ۟۫ۙ۟ۜۛۘ۟۬ۜۚ۬ۙ۟ۜۜۡۤۙۧۚۙۜۗۦۘۖۙۛۢۛۥۥۦ۠ۗۧۖۘۖۡ۠ۦۥۗ۬۟ۢۢۡۡ۫ۙۧۚ۬ۚ۟ۡۡۤۚۡۘۜ۬ۖۙۥۥ";
                    break;
                case 913166456:
                    str = "۫ۦۤۤۤۡۘۗۧ۫۬۠ۦۧ۫ۘ۠۟ۦۤۙ۠ۢۙۦۘۧۡۗۛۤۛۘۧۛ۬ۛۛ۠ۡۛۖۘ۟۫ۦۘۙۖۡۦۧۨۤۗۥۤۦۙۙۛۧۖۢ۫۠ۥۨۚۘۢۦۡۧۘۘۡ";
                    break;
                case 1796653468:
                    return null;
            }
        }
    }

    @Override // android.app.Service
    public void onCreate() {
        String str = "۠ۥۧۘ۬ۘ۫ۜ۫ۙۜۜۡۖ۟ۖۘۗۤۛۗۜۚۘۘۢۘۘۡۘۧ۬ۦۘۖ۬ۢۧۘۤۦ۟ۜۙۥۡۖۙۥۤۖۘۥۡۘۛۡۦۘۚۨۘۚۙۥۘ۟ۨ۟ۤۘۜۤۧۛۨۡۜۘۧۨۘۦ۬ۛۥۚۖۘۦۧۨۙۗۖۘۧ۫ۥۙ۫۠ۛۛۤۢۡ۠ۙ۫ۖ۠ۥۚۖۚۡۘۧۖۗ۟ۧ۠ۧۜۜ۫ۢۤ۠ۢۨ۟ۢۚ۠ۡۨۢۢۦۚۧۜۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 854) ^ 722) ^ 591) ^ 822) ^ 27) ^ 227) ^ 178) ^ 722) ^ 967) ^ 962) ^ 80) ^ 496) ^ 280) ^ 906) ^ 773) ^ 498) ^ 716) ^ 261) ^ 619) ^ 471) ^ 490) ^ 34) ^ 949) ^ 434) ^ 174) ^ 311) ^ 429) ^ 532) ^ 849) ^ 265) ^ 284) ^ (-187171297)) {
                case -1628535197:
                    return;
                case -863870744:
                    super.onCreate();
                    str = "ۥۦۦۜ۟۬ۢۥۘۛۥۚۨۦۨۘۜ۟ۗۨۖۖۘۜۥۛۢۖۚۨۛۥۜۛۡۘۤ۬ۦۧۥۜۡۘۜۨۦۘ۠ۗۘۙۤ۠ۖۥ۟ۥۘۖۢۥۡۡۥۘۜۚ۫۬ۦ۟ۘۦۦۘ۬ۡ۫۫۟ۨۖۜ۫ۚۘۙۦۖۧۤۛۨۢۡۢۤۥۨۧ۬ۥۙۖۘۢۥ۠ۘ۠ۛۙۗ۠ۨۥۘۢۖۖۧۘۦۘ";
                    break;
                case -76212538:
                    ShowMainView();
                    str = "۫ۚۘۘۚۛۗۨۥۧۦ۟۠ۖۘۜۥۤ۟ۧۜۘۦۨۨۘۨ۟ۜۘۢ۠۠۟۬ۦۤۛ۫ۥۨۡۘۦۧۥۘۘۦۨۛۛۚ۟ۙۘۢۚۗ۫ۚۦۘۡۘ۟ۡ۟ۖۘۗۛۜۤۜۜۙۛ۫۠ۡۤ۠ۧۘ۫ۘۜۧۨۧۘۛۥۖۘۤۤۥۖ۬ۡۘ۬ۛۨۥ۠ۙۗۤۛۘۛۙ۬ۛۨۘۢ۫ۗۚۥۢۘۛ۟ۜ۫ۦ";
                    break;
                case 1461727515:
                    str = "ۙۢۖۘۖ۠ۘۘۚۚۥۘۤ۬ۗ۬ۤۤۙۥۨۘۧۜۦۘۚ۫۟ۚۙۘۘۚۨۜۘۤۘۧۘۛۜۢۧ۟ۖۡۨۘۦۨۘۘۖۖۗۘۧۥۘۧ۬ۜۘۤۤۢ۫ۙۡۘۘۢۗۡۚۖۘۧۘ۠ۡۛۦۤ۟۫ۘۨۤۢ۫ۢۦ۠۬ۜۦۦۢۤۗ";
                    break;
            }
        }
    }

    @Override // android.app.Service
    public void onDestroy() {
        View view = null;
        String str = "ۖۙۜۥۦۘ۠۠۫ۚۥۖۗ۫ۘۙۜۡۘ۬ۢ۠ۥۦۧۚۦ۬ۖۦ۫ۨۢۧۛۡ۫ۡۤۧۧۗۤۗ۫ۨۘ۬ۤۘۘۛۚۧۚۤۘۘۗۚۢۙۢۙۥۡۘۘۦۨۘۨۤۖۘ۟ۚ۬ۙ۟ۧۘ۠ۡۘۗۚۦۦۥۖۘۘۢۛۗۤ۟ۨ۟ۢۛۛۗۡۚۧۥۘۨۚۚ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ InputDeviceCompat.SOURCE_DPAD) ^ 56) ^ 886) ^ 212) ^ 417) ^ 356) ^ 52) ^ 380) ^ 812) ^ 283) ^ 650) ^ 523) ^ 607) ^ 233) ^ 238) ^ 45) ^ 724) ^ 802) ^ 535) ^ 518) ^ 537) ^ 935) ^ 967) ^ 458) ^ 919) ^ 317) ^ 929) ^ 370) ^ 931) ^ 623) ^ 165) ^ 1201482068) {
                case -2110716969:
                    String str2 = "ۛۢۛۚۚۘۤۦۨۘۧۦ۠ۤ۬ۜۘ۟۬ۥۘۡ۫ۖ۬ۦۨۘ۬ۦۨۖۥۚۜۨۨۦۚ۬۟۟ۖۜۨۧۘۚۥۜۘۗۛ۬ۘۖۚۥ۫ۡۘۛۙ۬ۜ۬ۤ۠ۘۗۦۨۘۜۗ۬۟۫ۡۥۤۜۘۨۢۖۘۚ۬ۥۦۛۧۖۨۜۛۘۨۘ";
                    while (true) {
                        switch (str2.hashCode() ^ 1819922923) {
                            case -465644731:
                                str = "۫ۡۜ۟ۢۜۘۥۡۥ۠۫ۜۘۥۦۧۘۜۜۥۘۖۙۤۧۙۚۗ۠ۦ۬ۖ۠ۥۧۗۙۤۡۘۚۛ۫ۖۜۥۤۥ۠ۜۨ۬ۚۜۤ۬۟ۢ۠ۧۡۛۙۧۨۚۦۘۛۘۘۨۚۖۘۘۚۡ۠ۥ۫";
                                continue;
                            case -451566955:
                                str2 = "ۥۥ۟ۤۖۥۥۤۖۘ۬ۗۜۘ۫ۛۤۜۚۡۙۥۘۜۘۥۥۙۤۜۘۘۘۙۖ۬ۛۢۙۡۘۧۘۥ۫ۜۘۧۧۘۘۡ۟ۘۢۨۤۛۨۨ۠ۨۢۗۤۜۛۗ۬۬ۥۧۘۤۛۧ۠ۦ۟ۧ۫ۢۗۨۖۜۜ۬ۦۛۘ۠۟ۡۘ۫۠ۧ";
                            case -236136611:
                                str = "۬ۘۤۚ۠ۗ۫ۥ۟۠۠ۦۘۤۧۙ۟ۖ۟۠ۛۡۘۨۜۦۗ۠ۥۘۙۙۨۧۘۥۘۛ۬ۜۨ۬ۨۦۥۜۦۘۗۡۤۧۙۤۨۜۗۚۛۡۘۤۥۖۘۜۗۜۢۤۥۘ۫ۧ۬ۙ۟ۜ۠ۙۤۙۨۧۖۧۘۖۙۗۘۧۜۘۥۧۢ۬ۛۦۢۜۘ۬ۤۥۖۙۡۘۙۛ۟ۧۡۘۥۗۧۡ۟ۦۘۦۗۤ۠ۙۙ";
                                continue;
                            case 327467038:
                                String str3 = "ۙۙۦۘ۬۫ۜۘۡۘۢ۠ۡۙۙۖۢ۫ۜۖۘۨۖۨ۬ۦۦۤ۠۬ۤ۬ۘ۬ۧۨۚۖ۬ۙۗۦۦۥۜۘۗۧۨۤۖۡۘۦۨۖۘۛۧۜۚۡۥۛ۬ۗۧۘۡۘ۟ۚۡۘۗۤۦۘۗۜۘۨ۟۠ۥۘۡۜ۠۠ۛۛۥۘۜ۟ۦۘۦۙۥۘۢۖۜ۟ۧۦۘۥ۟ۜۘۥ۫ۜۦۖۦۘۗۚ۠ۚۢ۟ۦۦۨ۬ۨۘۘۙ۠ۖۛۚۙۨۙۜۤ۟۟ۥۜۚۡۢ";
                                while (true) {
                                    switch (str3.hashCode() ^ 1761527666) {
                                        case -1605742487:
                                            str2 = "ۛ۟ۡۤۡۦۘۦۖۦۘۡۦۧۘۜ۟ۥۗۗۖۘۘۙۙۖۡۧۦۚ۠ۗۡۤۘۙۙۛۚۥۡۦۙ۟ۖۥۨ۬ۖۛۦ۠ۜ۫ۙۛۢۡۘۡ۬ۜۘۦۡ۬ۨۨ۠ۡ۟ۜۘۚۘۘۧۜۡۨۨۦۘۙۤۚۘۛۥۘ۟ۖۥۘۚۦ۬۫۠ۚۜ۠ۜۘۛۛ۟ۢ۠ۦۚۛ۬ۧۨۜ";
                                            break;
                                        case -484033364:
                                            str2 = "ۖ۟ۙ۠ۤ۬۠ۡۘۨۙۡۨۤۨۘۢۤۗۖۛۗ۟ۨۜۘ۫ۤۘۗۜۧۘۡ۟ۢۥ۫ۜ۟ۜۖۘۤ۫ۧۦۨ۫ۧۗ۬ۛۤۚ۠ۦۤ۫۫ۘۡۙۤ۬ۛۧۘ۫ۨۘۜۥۙ۬۠ۙۨۤۡۘۨ۠۫ۤۥۛۙۚۜۘۗۢ۫ۢۨ۠ۘ۫ۗۦ۟۠ۢۥۡ۟ۜۗۙۤ";
                                            break;
                                        case -416607562:
                                            String str4 = "ۖۦۨۦۗۘۘ۠ۜۚ۟۬ۧ۟ۦ۟۬ۡ۟ۧ۠ۨۜۛ۬ۡۨۚ۠۬ۘۘۦۨۦۘ۟ۢۘۘ۬ۤۖۥۜ۬ۢۛۧۛۘ۠۬ۡۖۨۜ۠۬ۖۡۦۚۗۛ۫ۤ۬ۚۚ۫ۚۨۤۗۦۘۡۙۧۜۘۛۤۜۘ۠ۗۛۚۤۚ۫ۘ۟۬ۘۘۙ۬ۘۘ۠ۖۜۢ۬ۤۜۦۙۘۨ۫۟ۤۘۘۤ۬ۨۧۢۘۘ۠ۗۖۛۦۦۚۨۘۜۖۥۢۢ۬ۨۗ";
                                            while (true) {
                                                switch (str4.hashCode() ^ 1074875178) {
                                                    case -1991583215:
                                                        str4 = "ۦۙۦۘۗۥۥۧ۟ۧ۫ۨۗۘۢ۫ۛۤۥۘۜۛۜۘۚۢۖۦۥۨۘۥۧۙ۬ۛۜۜۘۨۘۘۢۚۜ۬ۧۘۘۚۗۨۘۥۘۘۦۚۘۘۢ۟۠ۧۧۛۡ۟ۙۚۤۨۛۜۘۘۘۙ۟ۢۥۚۚۢۨۛ۠ۡۧ۬ۧۧۥۖۘۢۥۗ";
                                                    case -1154945467:
                                                        String str5 = "۠ۜۡ۬ۗۜۘۖ۟ۜۢۦۡ۫ۛ۫ۚۚۤۦۤۗۖۧۘۚۙۧۤۢۗۗۨۜۘ۫ۥ۠ۗۜۖۘ۬ۦۜۘۗ۬ۜ۠ۜۡ۬ۖۥۘۧۖۜۙۦۧۘۚۡۜۖۘۨۜۡۦۖۨۙ۫۠ۦۘ۟۫ۜۘۡۢۢۘۦۚۚۦۘۢۤۦۜۙۡ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ (-1669254920)) {
                                                                case -2063815644:
                                                                    str4 = "ۛۨۡۨۢۤۧۘ۫ۡۜۙۥۨۗۢۡۤ۬ۘۡۖۙۧ۟۬۠۬ۗۧۙۗۤۡۗۢۜۛ۟۬ۖۢ۠ۜۘۤۜ۟۬ۖۜۘۘۦۦۘۢۢۙۡۜۤ۟۟ۜۢ۟ۙۚۘۘۘۥ۠۟ۘۙۙۜۜۗۡۗۗۖۛۥۦۘ۟";
                                                                    break;
                                                                case -2050957702:
                                                                    str4 = "ۚۘۧۘۨۚۥۚۙۡۡۛ۟ۡ۟ۨ۫ۘۜۘ۠ۗۙۢۖۜۘۤۖ۫ۚ۫ۢۙۚۡۘۨۢۢۨۨۦۘۖۘۡۘۥۚۡۘۤۨۜۘۖۧۜۤۧۨۨۜۘۘ۟ۖۧۥ۬۫ۛۢۤۤ۬ۥۘ۠ۨ۟ۚۗۦۘۖۛۜۘۜۥ۟ۡۧۘۘۡ۫۬ۢۥۘۢۛۥۘ۬ۥۦۘ۠ۢ۫ۦۗۡۘۖۗۧ۟ۙۨۜۘ۠ۨۜۡۧۦۘۖۛۥۘ";
                                                                    break;
                                                                case 907750260:
                                                                    str5 = "۫ۛ۟ۙۜۜۗۚ۬۠۫۫ۥ۫ۧۘۢۥۡۨۙ۠ۖۘۦ۟ۖۧۚۖۘۢۚ۬۬ۦۧۤۜۗۙۘۥۖ۫ۨ۟ۥۗۜۛۗ۫ۜۛ۟۫ۧۘۜۘۡۜۘۖۧۦ۠ۘۛۨۥۘۨۚۨۘ";
                                                                case 1439103451:
                                                                    String str6 = "ۜۙۡ۠ۘۜۘۙۜۘۖۙۧۡۙ۫ۛۖۘۛ۬ۢۘۧۨۖۢ۟۬ۢۗۤۥ۠۠۠۟ۥۦۘۤ۫۫ۘۥۘۘ۬ۜۜۘۥۦۧۘۖۗۥۗۥۙ۠۫ۘۘۤۥۜۘۥۥۜۥۥۦۘۡۢۙۢۥۥۧۘۥۘۤۘۘۥۘۧۤۨۘۛۖ۟";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ 741089878) {
                                                                            case 457922285:
                                                                                str5 = "ۢۛۡۘۚۤ۠ۗۛۚۜۤۖۢۦۖۚۡۛ۟ۘۛ۬ۤۜۘۛۧۘۘۖۧۘۚۘۘ۟ۥۨۨۚ۠ۗۨۖ۟ۨۨۘ۬ۜۘۘۦۡ۟ۗۦۡۘۦۘۥۤ۫ۘۡۥۤۗ۬ۗۜۧۧۥۙۢ۟ۜ";
                                                                                break;
                                                                            case 1552871695:
                                                                                str6 = "ۤ۟ۥۘ۟ۘ۫۟ۡۘۖۨۚ۬ۚۦۘۧۤۨۘۗ۬ۡۦ۟ۛۢۦۧۙ۬ۧ۠ۖۜۙۛۨۡۛۛۖۨۖۤۦ۠ۘۡۘۙۥۘۘۛۜۦ۫ۗۙۛۧۙۛۨ۠ۗۘۥۘۜۜۘۘۚۥۚ۫۬ۨۘۦۦ۟ۗۨۖۘۚ۟ۜۡۧۖۢۧۗ";
                                                                            case 1609161408:
                                                                                str5 = "ۢۗ۟ۡۥۤۜ۟ۡۘ۟ۤۨۗۡۘۨ۟۟ۘۨۘۥۙۨۘۜۘۖۖ۠ۜۘۗۗۧ۬۟۬ۗۘۖۚۤۢۖۛۨۢۛۦۡۙۨۘۦۢۨۘۨ۬ۡۜۘۧۘۨ۠۫ۦ۠ۙ۬ۜۤۙۨۢۡۡۡۘ۬ۖۙۙۘۧۜۜۛۖۧۨۘ۫ۨۚۜۖۜۘۨۡ۟ۗۗۜۘۘ۬ۡۚۡۖۘ";
                                                                                break;
                                                                            case 1696946488:
                                                                                str6 = view != null ? "ۙۤۧ۬ۜ۫۫۟ۖۗۚۚۙۧۘۘۦۗۢۨۨۥ۟۟ۘ۫ۘۦۖۖۦۖۡۜۘ۟ۘۜۘۗۧۘۚۧۜۘۙۧ۫ۦۚۖۚ۟۫۬ۜۦۘۧۦ۬ۨۜۛۥۗۦ۬ۨ۟ۘۜۘۙۖۛۜ۠۠ۙۦۢۧۥۜۖۤۥۨۛۖۜۦۘ۬ۛۤۙۡ۬ۚ۬ۧۖۡۦۦۗۗ۫۠ۤۤۤۛۘۦۛۢۜۛۢۤۜ۫ۥۥۚۡ۠ۢۗ۠۠ۚۥۢۗ" : "ۘۦۚۥۢۨۚۚ۠ۨۦۗ۫ۜ۬ۤۦ۬۟ۥۛ۬۠ۜۘ۬ۗۛۙۨۡۘ۠۟۬ۧۥۘۚۧۦۘۖۦۜۘۖ۟ۤۨ۟ۢۢۛۨ۟ۨۨۗۚۥۘۗ۬۠ۢۛ۬ۜۢۛۤ۬ۚۨۨۘۚۡۘۘۙۙۘۦۨۗۘۨۗۧۙۦۘ۠ۗۖۘۙۛ۬ۦۢۨۘ۟۟ۛۛۨ۬ۙ۠ۨۘۘۥۚۖۜۘ۬۟ۥۘۙۛ۫۬۟ۜۛۚۜۜۙۘۘۙۙۡۘۜۡۡۜۨۖ";
                                                                        }
                                                                    }
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case -20813823:
                                                        str3 = "ۗ۟ۛۥۡ۟ۘ۟۠ۖۘۡۗۦۘۙۦۗۙۧ۠ۨۛۡ۠ۚۖ۟ۗ۠ۜۖۜۚ۟ۡۘۧۡۤۘ۟ۘۧۨۨۘ۫ۨۜۗۨۘۧۨۧۘ۬ۥۖۦۖۗۗۛۖۗۥۘۨۤۜۧۧۛۗۚ۬";
                                                        break;
                                                    case 160786446:
                                                        str3 = "۬ۥۘۥۥ۬ۨ۟ۥ۬۠ۘۛ۠۬۟ۤ۫ۨۨ۬۟ۛۖ۬ۗۦۘۡۦ۫ۙۗۖۘۗۢۦۢۗۧۨۨۗۚۧۖۘ۫۠ۥۧ۬ۜۘۘۤۙۛۚۤۗ۠ۗ۫ۗۙۧۘ۟۟ۦۖۘۛۡۦۘ۠ۢۨۥۥۨۗۧۤۚۗۘۘۖۖۜ۠ۦۨۘ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case 913638514:
                                            str3 = "ۤۡۙۜۜۡۨۧ۫ۘۧۡۘۘۧ۬ۥۦ۬ۦ۫ۖۧۖۖۘۧۡۤۧۥۨۘ۟ۧۡۢۥ۬ۥۙۥۙ۟ۙۗۡۜۘۚۙۡۘۛۖۧۖۚۢۚۗۨۘ۠ۨۖۥۗۧ۠ۚ۬ۛ۫ۜۘۗۜۧۨۡۨۘ۫ۙۦۨۚۛۦۧۦۘ۟ۡۥۘۜۙۜۘ۬ۤۚۦۜۨۨ۟ۧۦۖۙۚ۬۬ۚۖ۬ۜۙۜۡ۟ۖۘۡۛۗۨۛۖۘۦۢۧ۬ۖۘۨۧۨۘۥۥۛۥۙۡۘ";
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case -1635107652:
                    return;
                case -613395556:
                    str = "ۢۘۧۥۦۡۘۘۡۛ۠ۢۢۧۦۢۡۖۙ۟ۜۡۘۜۧۨۨ۫۬ۢ۟ۗۡۨۗۧۘ۫۠ۨۤۦۛۘۛ۟ۨ۫ۤۛ۠ۛۢۛۨۘ۬ۨۘۘۙۤۨۘۡۢۧۡۡۜۚ۬ۙۦۚ۠۟۠ۗ۫ۧۜۧ۫ۙۚۧۢۧۨۢ۠ۛۨۚ۬ۙۢۚۘ۬ۤۗۚ۫ۘ۠ۢ";
                    break;
                case -205396162:
                    view = this.mainView;
                    str = "ۙ۟۟ۡۥۡۛۧۜۧۢۦ۫۬ۜۚۢۥۘ۠۫ۜۘۛۖۢۡۛۤۗۜ۠ۡ۬۠ۗۙۦۘۥۘ۬۬ۢۥۤۗۡۧۥ۟ۦۘۘۥۧۥۘۥۘۨۘ۠ۡۖۡۡۨ۫۠ۚ۟ۘۢۖ۫ۧۥ۫۫ۨۤۘۘۘۜۘ۠ۢۨۘۙ۟ۚۛۡۤ۬ۜۚۙۜۗۢۙ۬ۖۚۥۘۥۖۨۘۡ۬ۨۘۜ۫ۦۨۧ۠ۨ۠ۛۤۛۨ";
                    break;
                case -46019675:
                    super.onDestroy();
                    str = "ۘۗ۠۫ۨۨۖۡۤۢۤۖۘ۟ۢۙۡۜۡۘۛ۟ۗۜۥۘ۫ۡۜۘۜ۫ۘۥۜۘ۟۟۬ۙۥۧۜۥۦ۫ۨ۬ۖۥۛۡۙۥۘۡۢۜ۬ۥۘۤۦ۠ۥۢۜ۬ۚ۠ۨۢۦۖۜۨۘۙ۬ۙۨ۫ۢۚۜ۫ۖۜۖ۬ۨۘۗ";
                    break;
                case 346459397:
                    this.windowManager.removeView(view);
                    str = "۫ۡۜ۟ۢۜۘۥۡۥ۠۫ۜۘۥۦۧۘۜۜۥۘۖۙۤۧۙۚۗ۠ۦ۬ۖ۠ۥۧۗۙۤۡۘۚۛ۫ۖۜۥۤۥ۠ۜۨ۬ۚۜۤ۬۟ۢ۠ۧۡۛۙۧۨۚۦۘۛۘۘۨۚۖۘۘۚۡ۠ۥ۫";
                    break;
                case 1824499133:
                    ToggleBullet(false);
                    str = "ۦۘ۠ۖ۫ۜۘۥۨۜۨ۠ۤ۫ۜۖۘۜۚۥۜۦۜۘۤۗۙۖۥۜ۠ۦۘۨۙ۟۠ۛۨۤ۠۟۬۬۫۬۬ۧۛۗۗۥۨۦۢۜۡۘۜۦۛۚۥۨۘۦۗۘۖ۠ۢۡۦۛۛۗۡۛۡۗۜۗۥۘ۟ۥۤۜ۫ۜۦۛۥۗۥۖۜۨۘۗۚۜ۠ۨۗۧۖۘۙۢۛ";
                    break;
                case 2011293134:
                    this.checkStatus = false;
                    str = "ۦۦۡۚۛۡۢۙۡۡ۠ۡۛۧۡۗ۫ۙۦۙۘۨ۫ۢۜۖۧۛ۬ۛۤۖۡۧۧۙ۫ۘۜ۟ۗۘۘ۠ۛۡۘۥ۫ۨ۬ۨۥ۬ۚۛۧ۟ۚۗۦ۟ۥۛ۬ۢۙۨۘ۟ۙۨۢ۟ۦۚۜۘۖۖۛۜ۫ۥۘۘ۟ۦۘۗ۟ۗۢۢۗ۫ۛۧۜۚ۫ۦۥۧۘۜ۫ۜ۠ۗۡۘ";
                    break;
            }
        }
    }
}
