package kentos.loader.floating;

import android.app.Service;
import android.content.Intent;
import android.os.Build;
import android.os.IBinder;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.view.WindowManager;
import android.widget.ImageView;
import android.widget.RelativeLayout;
import androidx.core.view.PointerIconCompat;
import com.google.android.material.internal.ViewUtils;
import kentos.loader.C0931R;
import okhttp3.internal.http.StatusLine;
import org.lsposed.lsparanoid.Deobfuscator$$app;
import top.niunaijun.blackbox.utils.FileUtils;
/* loaded from: classes2.dex */
public class ToggleAim extends Service {
    private boolean checkStatus;
    private View mainView;
    private RelativeLayout miniFloatView;
    private WindowManager.LayoutParams paramsView;
    private WindowManager windowManager;

    static {
        String str = "ۘۜۗ۠ۡۦ۫ۘۤۢ۬ۦۨۥۘ۠ۥۡۘۙۢۤۜ۠ۜۘ۟ۥۡۘۘ۫ۨۘۢ۬ۖ۠ۡۘ۫ۜۙۛۘ۟ۤ۫۠ۦۥۢ۠ۜۙۗۧۜۘۨۨۚ۫۟ۤۥۗۘۥۥ۫ۢۜ۠ۢۘۘۨۚۦۘ۟ۤۡۤۥۘۘ۠ۥ۠ۥۗۗ۬۟۫ۦۧۘۘۥ۫ۜۦۨۘۢۖۨۘ۫ۙۦ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 159) ^ ViewUtils.EDGE_TO_EDGE_FLAGS) ^ 806) ^ 881) ^ 545) ^ 84) ^ 36) ^ 724) ^ 247) ^ 614) ^ 174) ^ 666) ^ 701) ^ 906) ^ 879) ^ 814) ^ 689) ^ 431) ^ 268) ^ 517) ^ 905) ^ 428) ^ 363) ^ 881) ^ 26) ^ 129) ^ 918) ^ 81) ^ 642) ^ 539) ^ 506) ^ (-1130812788)) {
                case 843491870:
                    return;
                case 1901469133:
                    System.loadLibrary(Deobfuscator$$app.getString(-3440744880294158153L));
                    str = "۫ۤۜۘۚۡۢۡۚۜۤۥۘۘ۟۬ۖۘۦۢۛۖۡ۫ۙۙۥ۟ۧۗۚۥۛۖۡۙۡۘۧۜۦۘۖۨۘۖۧۜۖۢۗۤۦۜۘۥۤۧۨ۬ۘۙۙۛۘ۫ۤۛۧۡۘۙۗۢۜ۬ۘۢ۬۟ۤۜۘۘۚۥۤ۠ۤۚۡۨ۬ۖۜۗ۬۟ۖۨ۟۟ۨۗۦۘۥۜۖ۫ۨۤۧۙ۟ۖ۟ۛۦۤ۟ۢۨۥۥ۟ۘ۟۟ۡ۠ۦۤۧۦۘۧۖ۠ۗۙۢ";
                    break;
            }
        }
    }

    private void InitShowMainView() {
        String str = "ۡ۫ۢۚۡۡۘۨۜۜۧۘۘۜۘ۬ۦۢۤۦۘۚ۬ۖۘۤۙۨۘۢ۬ۧۤۗۢ۫ۡۗۛۨۘۦ۬ۥۨ۬ۛ۟ۡۤۥۗۚۥۢۘۘۚۚۢۧ۠ۤۧۙۨۘ۬۬ۛۖۧۚۤۡ۟ۦۙۜۛۨۤۗۖۘۨۙۜۘۘۛۜۗۤۙۧۘۘ۬۠ۥۧۨۖ۟ۥۡۦۤۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 758) ^ 507) ^ 852) ^ 441) ^ 415) ^ 979) ^ 355) ^ 662) ^ 855) ^ 856) ^ 760) ^ 741) ^ 659) ^ 596) ^ 8) ^ 697) ^ 81) ^ 323) ^ 371) ^ 610) ^ 236) ^ 36) ^ 647) ^ 327) ^ 390) ^ 8) ^ 621) ^ 833) ^ 505) ^ 18) ^ 378) ^ 1057344848) {
                case -838688161:
                    ((RelativeLayout) this.mainView.findViewById(C0931R.C0934id.layout_icon_control_aim)).setOnTouchListener(new View.OnTouchListener(this, (ImageView) this.mainView.findViewById(C0931R.C0934id.imageview_aim)) { // from class: kentos.loader.floating.ToggleAim.1
                        private float initialTouchX;
                        private float initialTouchY;
                        private int initialX;
                        private int initialY;
                        final ToggleAim this$0;
                        final ImageView val$myImageView;

                        {
                            this.this$0 = this;
                            this.val$myImageView = r2;
                        }

                        /*  JADX ERROR: JadxRuntimeException in pass: BlockProcessor
                            jadx.core.utils.exceptions.JadxRuntimeException: CFG modification limit reached, blocks count: 408
                            	at jadx.core.dex.visitors.blocks.BlockProcessor.processBlocksTree(BlockProcessor.java:59)
                            	at jadx.core.dex.visitors.blocks.BlockProcessor.visit(BlockProcessor.java:39)
                            */
                        @Override // android.view.View.OnTouchListener
                        public boolean onTouch(android.view.View r10, android.view.MotionEvent r11) {
                            /*
                                Method dump skipped, instructions count: 1384
                                To view this dump add '--comments-level debug' option
                            */
                            throw new UnsupportedOperationException("Method not decompiled: kentos.loader.floating.ToggleAim.View$OnTouchListenerC09451.onTouch(android.view.View, android.view.MotionEvent):boolean");
                        }
                    });
                    str = "۠ۖۚۥۜۛۛ۬ۗۘۗۛۙۘۘ۠ۢۘۘۢۤ۠ۗۧۘۨۘۡۘۘۥۖۘۚۡۜۧۤۡۘۖۦۘ۫ۘۗ۟ۛۘۡ۬ۡۘۖۙۡۘ۟ۢۜۘۧۚۖۦۘۖۘ۠ۖ۫ۦۨۘۨۤۜۘ۬ۖۘۘۚۤۖۘۚۧۦۘۘۧۥۘۥ۟ۙ۟ۧۛۘۡۧۗ۟ۦۘۦۙۜۘ۬ۥۨۘۧ۫ۖۘۦۙۖۛۦۖۘۘۥۜۘۧۥۧۖۖۢۚ۟ۘ";
                    break;
                case -227613428:
                    str = "ۦۙۙۛۦۜۘۤۢۢۧ۟ۦۖۥۡۘۗۜۖۘ۟ۢۚۜۜۤ۠ۖۤۚۤۜۘۗۚۗ۬ۘۦۜۚۖۘ۟ۘ۫۠ۜۜۘ۫۬ۤۡ۬ۨ۫۟ۛۘ۠ۨۤۛۥۤۡۤ۠ۜۛ۬ۤ۫۠ۛۢۤۜۘۘۡۜۘ۠ۤ۫۬۠ۦۘۛۥۦۙۚۜۥۡۡۥ۫ۗۡ۠۠ۥۘۚۧۥۗ";
                    break;
                case 708935448:
                    return;
                case 1962429743:
                    this.miniFloatView = (RelativeLayout) this.mainView.findViewById(C0931R.C0934id.miniFloatMenu);
                    str = "ۡۦۥۛ۠۬۟ۙ۬ۘۜۥۘۧۗۨۘۦۙۢۡ۟ۜۢۢۚ۬۫ۦۘۛ۫ۡۘۤۙۦ۫۠۫ۖۚۜۘۙۗۦۘۖ۟۬ۡ۟ۘۙۗۖۜ۠ۗۚ۟ۚۦۛۤۨۧ۬۬ۚۡۗۦ۟۫ۤۥۘۘۤۘۘ۠۫۠ۡۦۡۘ۟ۘۙۡۨۜ۠ۢۖۚۧ۫ۜۘ۟ۤۥۛۖۗ۠ۚ۬";
                    break;
            }
        }
    }

    private void ShowMainView() {
        String str = "ۢ۬ۗۢ۠ۨۦۤۢۘ۫ۨ۫۠ۖۘۙۤۛۗ۟ۡۖۖۘ۬۟ۦۖۦۜۘۛۦ۠ۤ۫۟ۜۖۧ۫ۤۡۢ۟۟ۛۡۚۛۤ۫ۗۙۙ۬ۢۘۙۙ۫۠ۙ۫۟ۨۘۛۙۚۗۙۤۗۙۡۘۦۜۜO۟ۘۧۘۜ۬ۨۖۖۙۘۡۚۡۡۗ۟ۖ۫ۦ۬ۜۤ۠ۨ۠ۤۥۖۛۨۗۜۡ۫ۚۡۥۜۘۦۧۛۨ۟۠ۚ۫ۖ۠ۘ۫ۜۗۜۘ";
        WindowManager windowManager = null;
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 620) ^ 531) ^ 355) ^ 127) ^ 907) ^ 304) ^ 327) ^ 99) ^ 921) ^ 676) ^ 380) ^ StatusLine.HTTP_TEMP_REDIRECT) ^ 504) ^ 114) ^ 474) ^ 606) ^ 482) ^ 193) ^ 932) ^ 751) ^ 246) ^ 597) ^ 625) ^ 335) ^ 714) ^ 765) ^ 560) ^ 184) ^ 919) ^ 540) ^ 371) ^ 1243041661) {
                case -1479312812:
                    windowManager.addView(this.mainView, this.paramsView);
                    str = "ۥۢۖۘۢۘ۬۠ۨۧۜۧۘۚۜۗۜۧ۟ۗۧۖۘۧۘۥۘ۬ۖۘۨۤۖۘ۠ۢۘۘۗۤۖۦۖۜ۟ۖۘ۟۬۫ۤ۫ۥۘۜۚۜۘۚۥۘۘۚۨۜۘۧۡۧ۟ۧۤۘۜۛۜۡۦۘۘۥۧۢ۫۠۟ۙۖۘۗۦۖۘ۫ۤۦۘۚۘۧۖۙ۟ۙۙۘۥ۠ۨۘۙ۫۟۟ۗ۠ۙۛ۬";
                    break;
                case -1343876463:
                    this.windowManager = windowManager;
                    str = "۬ۢۖۚۡۢ۫ۗۡۘۖۧۤۚۢۗۗ۬۬ۨۜ۠ۤۢۡۘۚۗۡۤ۟ۜۘۛ۟ۥۙۛۗۖۥۛۥۤۗۡۘ۫ۤۜۖۨۜ۫ۜ۠ۧۙۜۘۦۗۥۘۢۚۘۘۥۥۥۙۛۨۘۨۖۘۛۜۘۘۢ۠ۢ۬ۖۥۘۚۧ۠ۧۡۜۜۜۗۜۗۨۘ۟۟ۥۘۨۨۡۘۥۘۢ";
                    break;
                case -1014476740:
                    this.paramsView = getParaams();
                    str = "ۗ۠۬ۚ۟ۗۙۛۘ۠ۢۙۚۡۤۚۡۜۘۡ۬ۛۧۛۘۘ۫ۤ۫ۚۤۘۜۨۢۡۤۘۘۛۜۡۛۙ۟۟ۚۨۘۛۢۤۡۜۦۙۥۖۘ۬ۧ۫ۘۘۘۖۢۘ۫ۘۖۘۤۚۛۛۜۛۛ۟ۛ۟ۢۨۘۘۢۘۘ۠ۚۥۛ۠ۖۘ۠ۘۥۧۗۘۖۤۡۚۛۢۦۗۧۘۥ۫ۜۡۖۙۤۡۡۧۦ۫ۧۧۗ۠ۜۜۜۘ۬ۢۙۖۚۨۘ۟ۛۥۘۨۤۦۘ";
                    break;
                case -748847196:
                    return;
                case -638605805:
                    this.mainView = LayoutInflater.from(this).inflate(C0931R.layout.toggle_aim, (ViewGroup) null);
                    str = "ۡۦۢۡۖۘۡۧۧۧۡۚۘۛۜۘ۟ۜۜ۬ۗۤۧۘۗۗۨۦ۬ۘۖۢۤۧ۠ۤۗۥۨ۫ۧۛۦ۬۟ۧ۬۫ۙۖۙۢ۠ۙ۟ۙ۠ۚۘۡۜۘ۫ۧۘۡۙۙۤۧۨۥۧۦۡۡۢۨۤۧۚۜۘۛ۫۫ۗ۟ۖۨۘۗۘۛۜۗۛۘۤۦ۟ۢۛ۫ۢۗۙ";
                    break;
                case -566171709:
                    str = "ۙۡۦۘۦۢۥۘۡۡۢۢۜ۠ۗۘۗۢ۟۟ۙۗۖۨۡۡۘ۫ۙۢۡ۫ۙۧ۟ۧۜۡۧۘۙۡۧۘۦۘ۫ۦۘۘ۟۟ۡۘۗۛۘۘۘ۬ۗۡ۫ۗۖۤۖۘۘۢۧۙۤ۫ۙۡۙۛۨۖۘۗۧۦۚۙۨۦۥۨۜۙۘۘۘ۠ۦۘۥۧۤ";
                    break;
                case 318414806:
                    str = "ۤۚۤۜ۬۬۟۫ۤۢۚۦۜۨ۫ۚۢۜۘۖۗۥۙۧۖۘ۠ۙ۠ۘۘۤ۬ۘۨۨۗۦۘۨۡۦۘۘۥۜۙۧۦۘۖ۠ۜۘۢۥۖۚۜۘۤۛۢ۟۬ۛ۬ۖۜۤ۫ۧۥ۠ۜۘۖ۬ۜ۬ۘ۬۟ۘۘۢۥۧۛ۬ۧۗۧ۠ۚۗۨۘۧۡ۠ۖ۟ۘۘ۟ۘۧۛۛۡۧۗ۠";
                    windowManager = (WindowManager) getSystemService(Deobfuscator$$app.getString(-3440744635481022281L));
                    break;
                case 1889761305:
                    InitShowMainView();
                    str = "ۙ۬ۗۨۗ۬ۛ۟ۡۢ۫ۧۛۛ۟ۛۜۧۘۗۤۗۥۛۙۙ۬ۚۜۖۡۘۚۗۥۖ۟ۡۘ۫ۧۚۘۙۧۥۖۨۘۛ۠ۗۛۙۗۥۥۜۦ۟ۜۗ۟ۘۘۖۜ۟ۙۨۜ۠ۡۥۘۚ۟ۨۘۚۙ۟ۧ۟ۙ۬ۗۙۗ۫ۥ۫ۗۢ۬ۡ";
                    break;
            }
        }
    }

    static /* synthetic */ WindowManager.LayoutParams access$000(ToggleAim toggleAim) {
        String str = "ۧۢۢ۠ۚ۫ۢۨۤۚ۫ۚۚۨۥۘۤۥۘ۫ۗۖۘۢۙۘۘ۬ۖۡۛۥۗ۟ۜۘۘۡۘۦۘ۫ۜۙۛۜۙۤۗۦۘۥۜۜۘۜۦ۟ۡۜۨۘۢۛ۬ۤۨۢ۟ۨۜۘۧۧۢۦ۠ۥۢۖۘۥۥۨ۠ۨۧۘۤۜۧۗۙۦۥۘ۟ۦ۬ۘۦ۠ۗۖ۫ۘۘۖ۠ۗۗۛ۬ۨۙۧۤ۠۬ۜۘۨۢۨۦۙۡۚۖۧۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 410) ^ 289) ^ 877) ^ 72) ^ 101) ^ 163) ^ 835) ^ 979) ^ 367) ^ 764) ^ 570) ^ 39) ^ 816) ^ 87) ^ 958) ^ 3) ^ 920) ^ PointerIconCompat.TYPE_VERTICAL_TEXT) ^ 412) ^ 499) ^ 377) ^ 587) ^ 176) ^ PointerIconCompat.TYPE_HORIZONTAL_DOUBLE_ARROW) ^ 356) ^ 387) ^ 246) ^ 144) ^ 69) ^ 581) ^ 782) ^ 458284163) {
                case -789365174:
                    return toggleAim.paramsView;
                case 373083691:
                    str = "ۨۤۢ۫ۤۥۘۛۘۧۘۚۙ۠ۛۡ۫ۜۜۧۤ۫۫ۥ۫ۜۡۨۘۡۖۥۘ۫ۚ۫ۗۥ۟۟ۗۧۗۦۘۦۡ۠ۡۦ۟ۜ۟ۖۘۡۢۘۘۢۗۨۘۦۡۜۘۢۛۘۘ۟ۖۘۦۙۜۢۚۡۘ۫ۘۦۘ۠ۦۘۦۨۖۥۛۦۘ۬ۖۢۘۧۥۘۨۨۘۘۢۖۙۘۗۘۨۢ۠ۘۥ";
                    break;
            }
        }
    }

    static /* synthetic */ RelativeLayout access$100(ToggleAim toggleAim) {
        String str = "۬۫ۦۨۢۘۘۧ۟ۨۘ۬ۨۡۤۤۤۧۙ۟ۜ۫۫۟ۥۦۦۢۧۚۜۗۖۧۖۘۥۥۢۨۢۦۘۤ۟ۧۗۜۨۘۧ۬ۢۤۙۘۘۦۚۘۧ۟ۥۘ۠ۖۦۛۨۙ۫ۙۡۨۖ۠ۗۦۘۘۥۡۢۙۢۦۘۘۡۦۗ۫ۙۚۡۡۘۥۥۡۡۥۛ۠ۘ۠۟ۗۖۡۨ۬ۙۦۘ۫۬ۜۘۢۤۥۦۜۙ۠ۚۗۖ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 90) ^ 986) ^ 495) ^ 394) ^ 66) ^ 6) ^ 40) ^ 1) ^ 573) ^ 320) ^ 631) ^ 463) ^ 262) ^ 858) ^ 947) ^ 584) ^ 420) ^ 80) ^ 379) ^ 345) ^ 485) ^ 42) ^ 769) ^ 315) ^ 926) ^ 392) ^ 612) ^ 517) ^ 495) ^ 639) ^ 256) ^ (-1267343313)) {
                case -2007943145:
                    return toggleAim.miniFloatView;
                case -1824191218:
                    str = "ۢۛۖۨۧ۫ۗ۠ۥۙۖۘۘۢۡۨۘۛۗۢۛۧۚۢۗۜۢ۟ۘۘ۠ۚ۠ۛۗۦۘۤۛۨۘۗۢۘ۠۫ۦۤۡۗۢۢۘۗ۠ۖۘ۟ۛ۟ۢۜۧۘۨۙۡۙۢۨۡۦۛۡۘۛۥۙۨۘۚ۫۠ۡۘۚۧۜۘۜۥۡۜۚۚۥۥۜۘۢۢۨۘۤ۫ۛۙۙۘۥۖۨۘۡ۫ۤ";
                    break;
            }
        }
    }

    static /* synthetic */ boolean access$200(ToggleAim toggleAim) {
        String str = "ۨۙۖۚۦۘۘۤۨۘۗ۟۟ۦۦۚ۬ۥۗۤۢۡۨۘۢۢۢۨۘۥۨۘۘۗۗۦۥۧۜۘۥۡۚۜۖۦۘۛۜۨۘ۬ۢۗ۠ۨۧۨۥ۟ۚۖ۠۬ۥۘۚ۟ۥۡ۠ۖۗۨ۠ۢۛ۠۠ۗۜۘۗۚۦۘۧۖۘۘۖۨۘۘۗۧۡۘۜ۬۠ۧۨ۠ۗۨۨۘۤ۟ۦۘۜۢ۬ۥۢۧ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 995) ^ 53) ^ 213) ^ 138) ^ 535) ^ 916) ^ 178) ^ 589) ^ 219) ^ 364) ^ 501) ^ 487) ^ 743) ^ 911) ^ 62) ^ 60) ^ 310) ^ 165) ^ 968) ^ 155) ^ 680) ^ 941) ^ 551) ^ 945) ^ 375) ^ 194) ^ 859) ^ 67) ^ 868) ^ 161) ^ 665) ^ 732652247) {
                case -1732841779:
                    return toggleAim.checkStatus;
                case -1143627167:
                    str = "ۧ۟ۗۡۨۚ۟ۦ۬۟ۢۛۥ۬ۘۨۦۨۖۨ۬ۜ۟ۚ۬ۛۥۗۚۡۘۧۘۥۘۢۧ۬۬ۢۜۗ۬ۤۘۨۦۙۧۦۘۗۘۘۛۖۜۘۙ۟ۜۘۥ۟ۗۢ۠ۖ۬ۡ۟۟ۘۗۧۖۙۡۧۚۨۜۧۘۡۡۢۘۨۦۗۨۚ۫۫ۦ";
                    break;
            }
        }
    }

    static /* synthetic */ boolean access$202(ToggleAim toggleAim, boolean z) {
        String str = "ۚۢۦۘۥۜۛۜ۟ۤۤۜ۫ۢۗۦۖ۫ۜۚۙۦۖۚۘۘۗۥۜۘۤۤۜۘۗۧۚۘۛۡۙۘۗۜۡۜۦۤۙ۫ۜۘۚ۫ۜۘۢۜۤۙ۠ۛۗ۫ۧۦۦۘ۠۠ۡۧۧۗۜ۠۫ۨ۫ۘۨۤۤ۟ۙۤۘۜۢۛۘۖۥ۟ۖۘۥۙۙ۬۠۠ۨ۠ۤۗۦۥ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 158) ^ 62) ^ 204) ^ 226) ^ 217) ^ 496) ^ 65) ^ 149) ^ 759) ^ 378) ^ 950) ^ 200) ^ FileUtils.FileMode.MODE_755) ^ 120) ^ 907) ^ 547) ^ 91) ^ PointerIconCompat.TYPE_WAIT) ^ 127) ^ 883) ^ 376) ^ 984) ^ 57) ^ 363) ^ 948) ^ 531) ^ 805) ^ 865) ^ 480) ^ 213) ^ 229) ^ 916157001) {
                case -1599042125:
                    str = "۠ۜۥۘۖ۬ۡۘۧۥۚ۠ۤ۟ۜۡۦۘۤۤۡۡ۫ۙۤۥ۠۫ۚ۬۬ۛۥۘۜۘۙۘ۟ۖۡۤۢۛۢۙۦۨۧۘۤۗۧۗۥۦۨۚ۠۬ۡ۬ۢ۟ۘۘ۫ۚۨۘۥۖۦۘۢۜۦ۠ۗۚۜۥۘۡۡۘ۫ۚ۟ۙۘۨۢۖۦۗۤۤۖۡۙ۠ۡۡ۫ۜۡ۠ۛۦۗۤ۬ۢۖۖ۠۬ۤۤۨۙۨۘۖ۬ۥۘ";
                    break;
                case -1222971268:
                    return z;
                case -982701178:
                    toggleAim.checkStatus = z;
                    str = "ۥۦۖۖۧۜۘۛۚ۬ۦۤۙ۟ۦۡ۬۬۟ۚۥ۟ۜ۠ۨۚۥۡۘۘۗۗۜۨ۫ۡۘۨۛۖۘۙ۟ۢۚۗۥۘۚۜۨۧۗۜۢۗۗۤ۠ۧ۬۫ۦ۟ۤ۬ۚۘۢۥ۟ۛ۠۠ۡۙ۬ۧۚۥۖۙۢۡۘۢ۟ۢ۠ۜۜۘ۟ۗۜۘۧۢ۠ۘۖۧۢۛۘ۫ۚۦۘۤۜۙۧۖ۠۫ۜۡۘ۟ۜۥۛۡ۠ۤۚۗ";
                    break;
                case -368706010:
                    str = "۬ۙۘۘۜۨ۟ۙۡۢۢۘۥۦۚۧۙۖۡ۟ۖۘۥۘ۟۠ۘۜۘۦۧ۟ۦۛۚۥ۟۟ۘۜ۬ۘۙۦۥۘۦۗۜۘۘ۟ۘۘۡۢۧۥۖۖۘۧۙۨۚۘۤۦۢۥۢۙۙۨۙۘۚۘ۬۟ۢ۟۟ۘۖۘ۬۠ۧ۫ۦۗ۟ۡ۫ۤۗۨۚۥۜۥۨۥۚۡۚۜۖۢۙۤۖۘۘۤۜۚۖۥۘۧۛۖ۟ۨۦۘۨۤۖۘۤ۟ۖ۫۠ۘۘۢۤۡۘۥۦۜۘ";
                    break;
            }
        }
    }

    static /* synthetic */ View access$300(ToggleAim toggleAim) {
        String str = "ۧ۠ۧ۬ۧۜۨۙ۟ۛۘۢۥۨۦۗۖۗۘۙۘۦۙ۠۟ۚۦ۠ۥۜ۟۬ۧۦۗ۬ۥۚۦۥ۟ۖۧۛۦۚۨۦۘ۟ۡۤ۬ۧۨۜۙۦۘۢۥۥۘۨ۠ۛۦۘۦۘۡۥۥۤ۫۠ۢ۫ۡۜۜۘۚ۟۫ۗۙ۟۬۫ۧۛ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 787) ^ 401) ^ 142) ^ 274) ^ 920) ^ 11) ^ 774) ^ 491) ^ 770) ^ 495) ^ 781) ^ 816) ^ 591) ^ 970) ^ 525) ^ 492) ^ 299) ^ 61) ^ 77) ^ 318) ^ 748) ^ 358) ^ 731) ^ 110) ^ 911) ^ 365) ^ 243) ^ 234) ^ 787) ^ 49) ^ 630) ^ 902385890) {
                case -1732723721:
                    str = "ۛۦۨۘۢۜۨۘۤ۠ۘۘۜۜۨۘۧۗ۬ۖۧۨۡ۬ۘ۬ۨ۫۟ۢۖۛۖۘۖۚۘۘ۟ۚۜۘ۟ۥ۟۬ۚۤۨۢۥۘ۫ۙ۬ۙۘۧۢ۟ۤۚۙۖۨۥۖ۠ۢۧۛۥۦۘۧ۟ۨۘ۬ۢۥۛۖۦۧۙۧۘۗۙ۫ۨۨۘۙۗۖۚۢۦۘ۟ۜۦۘۥۥۖۚۢۡۤۚۛ۬ۥۙ";
                    break;
                case 618870473:
                    return toggleAim.mainView;
            }
        }
    }

    static /* synthetic */ WindowManager access$400(ToggleAim toggleAim) {
        String str = "ۚۡۧۘۘ۬ۨۘۥۥۘۘۗۥۦۖۨۨۘۜۜۜۘ۟ۤۖ۟۟ۢۖۧۡۘ۠۟ۥۘۜۥۡ۟۫ۥۘۜ۫ۘۙۢۙۢۗۦۘۢۧۛۤۢۦۘۢ۟۠ۖۘۥۘ۬۬ۜۘۨۖۡۜۙ۬ۘۦۚۧۦۘۨۗۡۤۧۖۡ۟ۡۙۚۜۘۡۥۡۘۚۙۤ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 481) ^ 457) ^ 735) ^ 703) ^ 360) ^ 299) ^ 480) ^ 764) ^ 531) ^ 43) ^ 275) ^ 943) ^ 767) ^ 969) ^ 788) ^ PointerIconCompat.TYPE_ZOOM_OUT) ^ 911) ^ 106) ^ 453) ^ 216) ^ 899) ^ 309) ^ 328) ^ 823) ^ 769) ^ 868) ^ 450) ^ StatusLine.HTTP_MISDIRECTED_REQUEST) ^ 697) ^ 475) ^ 375) ^ (-1741787402)) {
                case -2078331912:
                    str = "ۤۜ۟ۥ۫۟ۖ۠ۥۘ۫ۚ۟ۖۚۨۘۖ۠ۤۤۜ۟ۡۚۥۥۢۧ۫ۧۡۘ۬ۗۨۘ۫ۗۥۚۚۧ۬ۤۧ۬ۢۗۚۢۘۖۦۘۘۦ۫ۙۧ۟ۖۘ۫ۛۡۘ۫ۥۦۘۧۙۖۚ۬ۙۖۚۨۛۘ";
                    break;
                case 865359253:
                    return toggleAim.windowManager;
            }
        }
    }

    private static int getLayoutType() {
        String str = "ۘۗۥۨۚۧۚ۬ۡ۬ۛۡۘۢۢۡۖۘۧۘۨۨۛۢۘۧۘۦۧۥۤۘۚ۬۬ۥۜۘۜۤۦۧۙۤۧۘۡۘۙ۠ۥۤۖۦۘ۟ۗۖۘۢۦۥۘۨ۠ۘۨۜ۠ۙۢۖۥۧۗۨ۟ۦۚۜ۬ۦۤۛ۫ۦ۫ۜ۠۟ۨۢۖۧۦۢۛۦۥۜۜۘۤۡۡۘۤۤۧ۟ۢۥۤۘۦۜۖۧ۬ۖۖۘ۬ۤۛۙ۠ۖۡۘۘۘۜۧۨۨۛۤ۠ۚۦۘۡۗۜۘ";
        int i = 0;
        int i2 = 0;
        int i3 = 0;
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 908) ^ 274) ^ 65) ^ 88) ^ 701) ^ 968) ^ 27) ^ 894) ^ 423) ^ 240) ^ 634) ^ 905) ^ 163) ^ 960) ^ 234) ^ 330) ^ 697) ^ 427) ^ 815) ^ 149) ^ 21) ^ 608) ^ 370) ^ 847) ^ 402) ^ 793) ^ 840) ^ 790) ^ 534) ^ 907) ^ 384) ^ (-315856696)) {
                case -1844974158:
                    i = 2002;
                    str = "۬ۚۜ۬ۥۘۘ۠ۙۧۖۙۡۦۚۜۖۦۗۖۨۘۘ۫ۡ۫ۥۖ۫ۖۘۘۧۢۥ۠ۚۚ۬ۧۘۘ۬۟ۖۘ۫ۦۡ۬ۛۢ۠ۛۧۢۦ۬ۜۨ۬ۘۡۧ۠ۨۦۤۤۥۘۦ۬ۥۖۦۛۨۙۙۧۛ۠ۛ۟ۜۘ۟ۨۡۘ۫ۘ۫ۖۤۤۥۚۡ۫ۜۘۢۧۧ۟ۗۗۨ۟ۤۡ۠ۚۡۧۥۥۗۛۘۡ۟ۘۡۥ۠۬ۖۤۗۤ۬ۜۘۖ۬۫۬ۨ۫";
                    break;
                case -1675031411:
                    String str2 = "ۖۢ۫ۖۥۨۘۚۖۘ۟ۗۥ۫ۥۦۘۧۚ۠ۥۛۡۙۤۧ۟ۧۛۧۦۥۡ۠ۥۘ۬ۢۥۥۚۥۢۛۙۢۛ۬۬۬ۡۘۙ۬ۦ۟ۖۦۘ۠ۜۘ۠ۛۖۡۥۡۘۙۥۗۘۜ۬۠ۢۘۤۙ۟ۜۙۨ۫۬ۦۘۗ۬ۘۡ۠ۛۜۘۘۢۤۚۦ۟ۜۘۦ۠ۜۧۧۜۜۜۙۗۗ۟ۗۨۗ۫ۘۨۛۧۚۘۚۗ۟ۦۘ۬۫ۛۚۡ۟ۥۛۘۧۨۨ";
                    while (true) {
                        switch (str2.hashCode() ^ 1161784785) {
                            case -912763366:
                                str2 = "ۚۦۥۘۗۙۘۘۨۙۡۘ۠۫ۨۡ۫ۙۚۡۘ۠ۖۢۗۖۧۖۜۧۧ۟ۜۚۢۙۙۘۘۙۘۚۜۢۨۚۜ۟۟ۛۡۘۙۢ۫ۨۤۖۜۥۘۗۤۦۧۢۚۢ۫ۦۧۨۧ۬ۦ۬ۜۚۛۦۨۦۘ۟ۙۗ۠ۖ۟ۖۧۥۘۥۛ۟ۧۖ۠ۥۤۢ۠ۜۚۡۛۢ۠ۖ";
                            case 509949043:
                                String str3 = "۬ۡ۟ۗۚ۫ۡۡ۫ۤ۟۟۠ۢۙ۟ۛۤۜۢۨۘۜۛۜ۠ۙۨ۬ۧۤۡۛۘۘۗ۠ۛۦۜۥۛ۟۬ۜۙۧۦۥۖۘۘ۬ۜۧۚۖۘ۬ۥ۫ۛۗۖۘ۬ۧۨۨۘۦۛۛ۠ۤ۟ۛۦۧۦۜۛ۟ۨۢۛ۫ۖۨ۟ۤ۫ۡۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ 544317940) {
                                        case -1351264261:
                                            str3 = "ۚۘ۬ۢۤ۟ۗۚۜۘ۬ۡۦۘ۟ۥ۬ۢۧۘۘ۠ۤۛۦۦۥۘۘۤۖۘ۟ۖۦۘۖۡۧۦ۬ۘ۬ۡۖۘۦۨۨۧ۫۠ۢ۟۫ۙۙۦۘۦۥۧۤۚۤ۬ۧۙۛ۟ۢۤۧ۠ۦۖۡۖۦۜۘۚۤۥۘ";
                                        case -1280994681:
                                            str2 = "ۜۤۡۡۘۦ۬ۗۖۜۡۢۡۦ۟۫ۚۛۢۤۖ۠ۨۢۜۡۛۡ۬ۗۢۛۘۘۛ۠ۧۙۙۖۧ۬ۡۘۙ۟ۛۨۥۡ۫ۨۛۚۡۦۘۖۤۦۘۡۢۖۘ۠ۗۥۘۡۢۤۧۨۗۜۜۘۘۡۧۚ۬۬ۡۜۨۨ۫ۜۛ۬ۙۨۘۗۦۦۘ۬ۨۦۜ۬ۘۖۖۡۘۥۤۘۗ۫۬";
                                            break;
                                        case -1202842015:
                                            str2 = "۫ۢۖۘۖۖۘۘۙۛۦۚۖۢۜۡۖۘ۠ۘ۟ۢۗۦۘۛۖۘۘۦۜۦۘۧ۫ۘۖۙۢۨ۠ۡۘۦۗۨۘۗۤۨۦۨ۟ۘۧۢۨۛۖۘ۟۠ۢۙ۠ۖۛۙ۬ۧۗ۫ۧۘۘۥۡ۫ۤۥۥۙۖ۫ۢ۬۫۠ۗۨ۫ۦۢۖۚۡۘۦۖۤ";
                                            break;
                                        case 1177699555:
                                            String str4 = "ۧۙۦۖۚۥۘۗ۬ۛۡۜۡۘۛۛۦۘۘۛۖۨ۬ۥۘ۫ۜۥ۫ۜۚۙۦۜۛۢۙۘۧۡۛۧ۟ۦۘۛۛۨۡۙۨۘۥۡۨۥۦۦۘۨۡۤۗۗۡۘۧ۠ۥۖۨۘۘۘۗۙ۫ۧ۬۬ۡۦۘ۫ۥۧۘۧ۫ۦۘ۟ۚۗۙۙۧ۟۟ۖ";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-224394079)) {
                                                    case 247062061:
                                                        String str5 = "ۤ۫ۜ۫ۢۥۗۛۖ۬ۚۧ۫ۘ۫ۢ۟ۛۛۦۨۘۧۦۦ۫ۢۥۦۥۦۗۦۨۤۗۢۚۤۡۘ۬ۢ۟ۡۦۛ۟ۛۥۚۗۨ۠ۡۨۘۖ۬ۢۙۡۡۡۤ۫ۨۖۜ۟ۢ۠۫۫ۖ۬ۙ۠ۢۦۘۘۤۛۢۜۧۘۢۛۦۥۘۛ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ (-1770486224)) {
                                                                case -1347066916:
                                                                    String str6 = "ۢۧ۠۟ۦۘۘۛ۬۠ۤۛۜۘۢۛۥۦ۬ۡۗۖۘۘۙۛۛ۫ۡۚۗ۫ۜۘۡۙۦ۟ۤۘۘۤۤ۠ۦۛۡۘۛۢۤۙ۬ۢۢۖۨۛۘۨۖۥۛ۟ۦۘۧۨۦۚۡۧۘۤۘۘۖ۫ۘۘۦۥۘ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ (-1944229773)) {
                                                                            case -1552556325:
                                                                                str5 = "۫۟ۜۡۤۡۛۥۘۜۖۗۦۥ۬ۥ۟۠ۧۘ۫ۙۤۜۥۦۦۘۚۢۜۘ۟ۘۦۙۛۘۨۡ۬۬ۙۦۜۤ۠ۗ۬ۘ۫ۨۤۡۖ۫۟۟ۗۖۨۙ۬۫ۥۘۥۢۢ۫ۛۗۤۨۗۦۤۗۤۖۥۢۢۤۥۛۦۛۛۡۘۚۗۧۖۛ۠ۨ۟ۜۘۖ۟ۗۧۦۖۖۨۖ۟ۦۜۥۙۜ۬ۨۜۘۙ۟ۦۙۥۖ";
                                                                                break;
                                                                            case -329791333:
                                                                                str5 = "ۜۦۜ۠ۗ۠۟ۜۘۥۥۜ۬ۡۛۤۙۧ۟۫ۡۨۜۧۘۨۨۥۛۢۨۦۡۘۘۘۗۛ۫۬ۤۜ۟ۙ۟ۦۦۘۚۚۘۚۡۗۖۙۥۚۘۧۨۨ۬ۥ۬۫ۢۧۚ۟ۦۢۨۥۚۜۛۥۘۘ۟ۛۚۜ۫ۤۡۧ۫ۖۦۜۤۤۡ۬ۦۡۛ۠ۛۛۖۘۡ۟ۗۥ۟ۨ";
                                                                                break;
                                                                            case 737842665:
                                                                                str6 = "ۧۨۗۧۥۗ۬۟ۥۘۚۧۜۘۢۖۖۜۙۥۘۤۧۦۘۦۗۤۧۜ۫ۘۙۦ۫۫۬ۧۦۗۘۤۤ۬ۡ۬ۙۘۜۗۧۚۤۚۡۘۗ۬ۗۘۥۙ۫ۗ۠ۚۗ۟ۦۨ۬ۨۡۢ۠ۘ۫۬ۛۨۘ۫ۘۙۙۥۘۘۜۙۧ۬۫ۤۥۛۧۜۦۨۖۧۦۧ۬ۥۜۗۖۘ۟ۨۖ۬۟ۛۧ۠ۗۜ۫۟ۛ۫ۥۧۗۡ";
                                                                            case 1316187742:
                                                                                str6 = Build.VERSION.SDK_INT >= 26 ? "ۨ۬ۚۘۘ۫ۢۛۜ۠ۢۙۘۢۦۜۢۜۘۘ۠ۜ۬ۙۥۛۘۙۚۧۥۙۘۢۢۥۦۛۨۡۗۘۘۘۜۨۜۙ۬ۡۜۢۨۘۙۦ۫ۡۤۘۘۤۦۖ۟ۜۢۚۗۦۜ۟ۢۘۙۗۗۜۡ" : "۬ۖۨۘۖ۫ۨۗۦۡۘۛ۠۟ۛۙۤۢۚۡ۠ۖۧۘۦۤۦۡ۟ۧۚۘ۟ۙۖ۠ۚۧۨۘۘۥۥۡۦ۟۟ۡۥۘۜۨۘۖۘۘۧۖۧۘۨۛۘۦۦۥۤۧۡۘۚۘۘ۫ۙۧۖۥۡ۟ۧ۫ۡۖ۟ۜۖۘۤ۬ۨۥۡۦۘۙ۟ۘ";
                                                                        }
                                                                    }
                                                                    break;
                                                                case -356073551:
                                                                    str5 = "ۙۥۖۨۡ۬ۧۚ۠ۜۙۡۛۨۚ۠ۙ۬ۜۘۦ۟ۥۘۜ۬ۡۘۜ۬ۥۢ۟۟ۜ۟۠ۚۨۡۘ۟ۗۥۡۛۜۘۛ۫ۧۖ۫ۨۦۦۦۚۖۙۘۜۡۚۡۘۥۧۥۗۜۧۘۙۥۜۘۜۢۦ۫ۜ۠ۥ۠ۖۛۜۖۘ۟ۖۙۨۤۦۘۢۗۨۘۛۨ۟ۦ۫ۡۨۘ۠۫ۖۚۦۧۢۖ۟ۡۘ۠ۙ۠ۜۦ۬ۥۨۙۢ۠ۤۗۤۡۙۛ۬ۥۜ";
                                                                case -175206781:
                                                                    str4 = "۟ۡۜۘۖۘۡۘۢۡۘۥ۫۬ۛۚۨۤۛۛۖ۟ۨۗۘۦۘۘۡ۠ۢ۠ۢ۠ۨۢۧۧۥۘۖۢۨۜۗۦ۠ۦۜۘۢۡۤ۠ۘۘۧۜۜۛۢ۟ۥۘۘۚ۬ۙ۠۫۟ۥۙۘۚۙۘۜۘۜ";
                                                                    break;
                                                                case 2146781541:
                                                                    str4 = "۫ۧۘۘۤۜۚۚۨۜ۫ۦۧۘۤ۠ۧۡۢۡ۠ۚۖۤۨۘۙۘۡۘۢۡۖۤ۬ۦۘۡ۠ۘۙۢ۬ۛۤۥۨۜۖۘ۠ۦۗۥۚۖۛۡ۠ۗۤۘۘۛۘۜۧ۟ۖۖۙۘۘۧۤ۬۬۬ۖۘ۫ۤۡۗۨۖۘ۬ۥۤۖ۟ۛۘۙۖۘۢۛۖۦۙۡۨۙۘۗ۫ۧۨۡۡ۫ۛۥۦۨۨۘۢۤۤۨۨۡۧۛ۠ۜۖۧۘۥۜۙۦۚۖۘۗۡ۫ۥۘ۟ۜ۫";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 1374089378:
                                                        str4 = "۫ۙۛۧۖ۟ۘۛۙۧۡۥۘۨ۫ۜۘ۫ۥۥ۫ۥۚۘۚۙۜۢۙۜ۬ۗۡ۠ۚۖۜۤۛ۟ۙۙۧۦۘ۬ۖۖ۟۟ۧۡۨۗ۟۠ۡۘۧ۬ۨۘۧ۟ۤ۟ۙۘۨ۟ۘۚۖ۠۫۠ۢۦۡۦۘۚۧۛۗۢ۬ۡۖۢۘ۬۠ۨۧۜۘۖۨۗۖۖۙۜ۬ۤۙۜ۫ۥ۟ۘ";
                                                    case 1822560330:
                                                        str3 = "ۧۙۜۦۖ۠۫ۦۡۤۤۥۘۜۚۡۘۚۘ۬ۦۜۧۚ۬ۖۘۧۖۥ۬ۜۨۧۢۖۡ۟ۢ۠ۡۘۥۦۗۖۚۢۙۘ۬ۨ۠۠۬ۜۗ۬ۦۧۜ۠ۖۘۘۨۦۧ۠ۛۜۥۖۨۘۧ۫ۡ۠ۥ۫ۡۙۘۚۚۚۨۤۤۡۦۤ";
                                                        break;
                                                    case 1823638612:
                                                        str3 = "۬ۨۜۜ۠ۡۢۖ۬ۤۜۖۘۡ۠ۥۛۘۥۘۜۛۥۘۧۥۘۘۢۥۨۨ۬ۦۢۨۛۘۡۜۚۘۤۦۘۦۡۖۗ۠ۚ۠ۘۨۨۡۖۨ۬ۛۜۘۗ۫ۡ۠۟۟ۗۢۢۛۦۦۖۛۥ۟ۚۖۘ۠ۡۨ۠ۧۘ۟۠۟ۤۥۦ";
                                                        break;
                                                }
                                            }
                                            break;
                                    }
                                }
                                break;
                            case 711757511:
                                str = "ۤۚۖۘۦۧۢۤۗۦۘۜۦۦۘۙۙ۫ۚۡۥۜۛۦۘۦۙۚۢۧۥۘۗۗۚۖۚۤۡ۫ۚۧ۬ۖۧۚۦۘۗۦ۟۫۠ۡ۫ۥۦۚۙۛۙۨ۬۠ۜۗۙۨۧۘۢۨۖۘۦۥۘۢۢۘۘۥۧۧۚ۫۠ۤ۬ۧۖ۟ۗۧۡۘۚۥۘۘ۬۬ۡۢۨ۫۬ۨۘۘۨ۟ۨۘۡۜۥۚ۠ۨۙ۬ۙۨ۬ۨۜۨ۟۬۟ۥ";
                                continue;
                            case 1302937571:
                                str = "ۡۚ۫ۤ۠ۘ۬۠ۤ۠ۙۜۘۗۘ۟ۦۖۦۖۦۨۘۗۛ۠ۗۙۦ۠ۧۢۡۖ۠ۤۥۡۘۘۡۚۗۦۡۘۛۧۡۘ۫ۖۜۘۨ۬ۖۘۘۚۡۙۘۜۖۥۨۘۖۧۢ۬ۖۛ۠ۢۧ۟ۙۜۦۨۖۚۘ۠ۘۖ۠ۡۥۚۘۡ۬۬۬ۨ";
                                continue;
                        }
                    }
                    break;
                case -79162421:
                    return i2;
                case 37836562:
                    str = "ۨۨۖۙۢۘۥۢ۬ۛ۫ۘۘۛۤۨۤۚۦۘ۟۠ۡۦۚ۟ۙ۬۫ۨ۫ۡۥۚ۬ۥ۫ۡۘ۟ۤ۫۠ۢۖۢۤۡۨۡ۬ۚۘۖۦۧۦۘۡۢۤۢۧۖ۫ۥۜۘۗۥۙۗ۫ۘۘۢۧۥۛۖۚۙۜۢ۟ۡۘ۠ۥ۟ۙ۟ۤ۫ۦۘۗۧۖۘۧۛۘۢۚۘ۬۫ۦ۫ۡۖۘ";
                    break;
                case 223275154:
                    str = "۠ۛۖۘۜۗۜۘ۫ۚۡۗ۠ۦۢۖۜۘۛۛۜۘ۫ۛۢۢۤ۫ۚ۬ۛۖۘ۬ۚۖ۬ۛۜۙ۫ۢۖۘۖۤۦۘۚ۫۬۫ۛۧۧۨۘۘ۬ۡۘ۬۬ۘۘۛۚۢ۟ۨۗۜۤ۬ۜۥۜۛۙۚۥۥۙۛۡۨۧۨۖۤ۫ۤۖۨۥۡۚۧ۫۠ۗۚۦ۟ۛۛۙۨ۟ۜۘ۟ۙۦۘ";
                    i2 = i;
                    break;
                case 768824944:
                    str = "۠ۧۦۙۧۨۘۛۦۡۚۡۘۘۨۧ۬ۚۘۦۘ۬ۗ۫ۥۙۖۘۖۘۛۢۤۖۘۥۘۨۨۥۛۚۚۗۢۨۘۛۛۜ۠ۢ۠ۡ۬ۨۘۘ۠ۚۨۙۢ۬ۖ۫ۖۙۗ۟ۛۢۙۙۚ۠ۢۡۘۦۢۡۘۥۦۡۦۘۡۧۦۘۦۗۗۘۥۢ۠ۦۘۘ۟ۛ۟ۚۦۛ۬۠۫ۚۧۖ۫ۥۥۛۛۚ۬ۖۨۘۨۘۜۢۛۨۘ";
                    i2 = i3;
                    break;
                case 1061538454:
                    str = "۠ۛۖۘۜۗۜۘ۫ۚۡۗ۠ۦۢۖۜۘۛۛۜۘ۫ۛۢۢۤ۫ۚ۬ۛۖۘ۬ۚۖ۬ۛۜۙ۫ۢۖۘۖۤۦۘۚ۫۬۫ۛۧۧۨۘۘ۬ۡۘ۬۬ۘۘۛۚۢ۟ۨۗۜۤ۬ۜۥۜۛۙۚۥۥۙۛۡۨۧۨۖۤ۫ۤۖۨۥۡۚۧ۫۠ۗۚۦ۟ۛۛۙۨ۟ۜۘ۟ۙۦۘ";
                    break;
                case 1741949077:
                    i3 = 2038;
                    str = "ۥ۫ۘۘ۠ۚ۠ۤۛۢۤ۟۠۫۠ۜۦۤۘۘۨۥۥۖ۟ۢۘۢۤ۫ۗۥ۟۫ۤۢۡۚ۬ۥۢ۟۟ۥۘۦۥۖۘۖۗۘۘۖۤۖۘۘۖ۠ۥۡۘۡۛۚ۟۬ۖۘ۠ۡۦۘۧۘۧۘۡۨۖۘۛۚۨۘۖۢ۠ۜۤۜۡۤۖۥۤۜۧۗۙۢۘۜ۟۟ۧۥۙۜۘۦۙۥۘۛ۫ۨۘۜۨۘۘۛۦۘۚۚۦۘۚۨۖ۫ۙۖۧۚ۬۬ۖۥۘۥۚۖۤۥ۬ۘۢۛ";
                    break;
            }
        }
    }

    private WindowManager.LayoutParams getParaams() {
        WindowManager.LayoutParams layoutParams = null;
        String str = "ۘۡۛۦۛۖۘۧۗۜۘۨۚۦۘ۟ۤۘۢۦۗۙۙۘۘۨۖۨۡۢ۠ۧۜۛ۬ۡۘۛ۫ۦۡ۠ۗ۠ۧۚ۠ۚ۫ۡۛۤۦۘۡۧ۫ۖۗۜۦ۫۫ۗ۟ۗۖۚ۫ۢ۟ۙ۬ۤۥۘۧۘۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 710) ^ 372) ^ 642) ^ 460) ^ 670) ^ 579) ^ 698) ^ 520) ^ 872) ^ 545) ^ 810) ^ 120) ^ 924) ^ 763) ^ 867) ^ 937) ^ 734) ^ 842) ^ 943) ^ 755) ^ 439) ^ 527) ^ 488) ^ 927) ^ 510) ^ 169) ^ 18) ^ 572) ^ 156) ^ 614) ^ 484) ^ 1730215733) {
                case -1845537680:
                    layoutParams.y = 0;
                    str = "ۥۤۘۘۘۗ۠ۘۨۛۗۘۦۧۨۘۘ۠۠ۥۘۖۢۡۤۚۡۨۡۖ۫ۨۦۦۚۘۡۢ۫ۨۤۦۖۥۡۘۜۡۤۥۧۥۦۨۘۦۛۜۗۨۥۘۦۨۡۧۢۨۥ۬۠ۤ۫۬ۙۨۘۗۤ";
                    break;
                case -851002921:
                    str = "۟ۖۗ۬ۘۨۘۜۙۖۛۗۢۘۜۗ۠ۤۤۤۘۜۢۧۖۘۡۡۛۙۜۦۘۧۧۘۗۤۢۚۦۛۛ۠ۗۙۙۛۤۜۢ۬۬ۗۨۖۧۘۗۦۘ۟ۢ۫۟ۛۦۘ۠ۦۖۛۚ۬ۨۜۤۧۤۙ۫ۥۤۨۚ۠ۚۜۘۥۜ۫۟۟ۖۘۧۜۥۧۧۧۚۖۗۘ۬ۘۥۘۛ";
                    break;
                case 325349622:
                    layoutParams.x = 0;
                    str = "۟۫ۦۘۙ۫ۙۖ۬ۨۘۥۜ۠ۗۨۦۧۘۛ۬ۦۧۢۦۛۦۨۘۖۛۜۘ۬ۨۥۘۙۘۦۘۧۜۦۘۘۗ۫ۦۨۖۘۚۙۙ۟ۗۜۘۛۚ۟ۗۙۙۤۙۜ۠ۛ۬۟۠ۙۨ۟۫۟ۗۤۖۧۘۡۥۜۖۦ۟۬ۨۧۘ۠ۗۢۦۢۨۘۥ۟ۥۘ۬ۨۖۚۘۧۥ۠ۘۧۢۛۜۡ۟۬۫ۗۢۗۨۗۘ۟۠ۖۘۦۖۥۘۘۚۨۘۡۤۡۘۛۥۜۘۛۦۢ";
                    break;
                case 435423152:
                    layoutParams.gravity = 17;
                    str = "ۨۜۘ۠ۦۙۙۡۨ۬ۥۖۘۗۜ۫ۚۧ۫ۘۛۛ۟ۜۘۨۧۦۜۨۖۗۥۘ۟۫ۘۘۚ۬ۙۢ۠ۨۘۙۜۥۡۨۙۛۨۖۘۜۗۨۘۖۜۘ۫ۜۛۖۥۤۘۥۡۘ۬ۖۢۘ۫۫ۥۥۤۘۤۚۨۡۦۧ۟ۙۖۗۢۚۦۘۛۘ۬۫ۙۥۡۗۦۘۙ۟ۦۘۡۥۧۚ۠ۜ۬ۢۘۡۦۡ۠ۡۖۘۗۡ۟";
                    break;
                case 1171251246:
                    str = "ۛۥۖۖۨ۬ۥۤۦۥۘۘۚۥ۠ۧۥۢۖۙ۠۠۠ۘۘۤۚۚۧۦۜۛۥ۠ۜ۫ۖۖ۬ۛۖۡۥ۬ۤ۠ۜۗۧ۬ۚ۫ۜۛۗۖۥۘۧۦۤۨۧ۠ۧ۠ۗ۟ۖۨۘۘۥۢۡۖۡۜۧۘ۬۫ۡ۫۠ۙۖۦۨۖ۫ۡۖۤۤۜۖۦۖۡۗۙۤۜۘۜۘۘۖۖ۬ۨۤۥۜ۟ۖۘۡۖۘۘۛۤۨۘۤۦۢۦ۫ۥۥ۬ۢ";
                    layoutParams = new WindowManager.LayoutParams(-2, -2, getLayoutType(), 8, -3);
                    break;
                case 1871460187:
                    return layoutParams;
            }
        }
    }

    public native void ToggleAim(boolean z);

    @Override // android.app.Service
    public IBinder onBind(Intent intent) {
        String str = "۟ۤۖۘۡۛ۠ۗۙۛۦۚۚۗۡۥۛ۟ۛ۟ۖۗۨۚۖ۬ۤۜۡۨۘۘۖۘۧۤۥۡۦۡۘۧ۠ۜۘۗۡ۠ۖ۠۟ۥۙۘۘ۬۫ۦۘۛۢ۟ۗۛۨۚۛ۬ۚۗۚۤۛۘۘۤ۬ۧۤۖۗ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 661) ^ 678) ^ 537) ^ 350) ^ 958) ^ 471) ^ 568) ^ 108) ^ 741) ^ 336) ^ 314) ^ 862) ^ 585) ^ 778) ^ 914) ^ 206) ^ 904) ^ 639) ^ 543) ^ 996) ^ 961) ^ 801) ^ 264) ^ 181) ^ 740) ^ 320) ^ 670) ^ 411) ^ 579) ^ 173) ^ 794) ^ 1453385210) {
                case -1912564018:
                    str = "ۥۦۙۗۜۜۖۛۖۘۖۗۧۦۤۦۢۥۜۘۢۢ۫۠ۨۢ۠۫ۜ۬ۘۡۘۨ۟ۘۧۨۢۨۧ۟۟ۗۨۘۚۘ۫۠ۧۦۙۤۖۘۦۖۥ۠ۦۚۢۧۦۘۦۛۥ۬۬۠ۦۤۢۖ۫ۨۛۤۖۛ۟ۡۗ۠ۡۦۗۡۘۢۛۚۧۚ۫ۧۛۖ۫ۡ۬۟۠ۙۖۤ۫";
                    break;
                case -431383813:
                    str = "ۧۗۤۘۥۖۥ۫ۥۥۡۜۘۤۚۘۘ۬۠ۡۘ۬ۛۥۘۨۖۨۘ۟ۧۤۙۨۖۗۡۗۨۖۢۛۙۜۧ۬ۥۨۛۦۘ۠ۨۘۘۥۖۘۜ۬ۦ۠۟۬ۢۨۡۘۚۘۘ۫ۜۦۢ۫ۘۨۗۗۨۤۡۘۙۧۦۘۖۘۢۖۙۙۜۡ۫ۨۥۡۘۚ۬ۜۡۚۡۗۡۡۘۡ۬ۖۘۤۡۨۖۜۨ۠ۤ۬ۧۛۛۘۛۨۙۢۨۘ";
                    break;
                case 1608757263:
                    return null;
            }
        }
    }

    @Override // android.app.Service
    public void onCreate() {
        String str = "ۢۖۤۚۤۤ۟ۘۖۗ۫ۤۧۢۖۚۛ۫۠ۨ۟۠ۥۡۘۨ۫ۙۧۥۛۥ۬ۜۘۙۦۧۥ۠ۦۡ۬ۤۛۥۜۘۛۥ۟ۦۧۧۚ۠ۧ۫ۜۘۤۦۗۚۢۗۗۦۘ۟ۘ۠ۨۥ۫ۢۡۗۜ۟ۦۙۖۧۘ۬ۡۡۘۤۧۥۘۤۨۧۘۤ۠ۤ۬ۦۘۨ۫ۜۖۤۡۘ۬ۙۤۙۧۨۘۦۨ۬۠ۥۥۦۖۦۖۚۧۘۚۘۘۥۨۘۛۚۡۖۙۘۘۜۥۜۘ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 381) ^ 670) ^ 557) ^ 245) ^ 35) ^ 491) ^ 991) ^ 61) ^ 775) ^ 572) ^ 229) ^ 396) ^ 56) ^ 51) ^ 781) ^ 722) ^ 218) ^ 940) ^ 333) ^ 729) ^ 920) ^ 358) ^ 432) ^ 315) ^ 341) ^ 104) ^ 426) ^ 763) ^ 255) ^ 574) ^ 290) ^ (-1629130601)) {
                case -872385660:
                    ShowMainView();
                    str = "ۡ۠ۙۚۙۢۨ۠ۖۡۜۨۘۘ۫ۦۧ۠ۨۦۥۧ۟ۢ۟ۖۦۥۘۨۦۘ۬۠ۘۗۜۘۦۢۥۘۢۡۗۥۤۦۙۡۗۢۗۡۘ۟ۘۦۘ۫۬ۙۙۦ۠ۖۥۡۘۨۙۙۚۧ۫ۦ۬ۗۨۡۤۙ۫ۖۘۥ۫ۧۛۘۧۥ۟ۗۡ۬ۖۘ۟ۙۧ۫ۤ۠۠۠ۦۡۡۜۥ۟ۥۘ";
                    break;
                case -415114388:
                    super.onCreate();
                    str = "ۡۙۨۡۜۗۙۤۤۙ۠ۦۗۜ۬۟ۥۘۧۧۦۛۥۙۗۥۢ۬ۢ۫ۜۘۚۛ۫ۨۗۖۧۤ۬ۗ۠ۜۘۨۨۦۛۧۘۚۢۦۗۦ۠ۢۜۥۘۤۧۦۘۢۜۧۘ۠ۢۦۘۦۖۨۘۥۥ۬ۜۙۤۗۦۦۘۢۙۖۘۨۗۘۗۥۘۥۧۖۖۤۘۘۡ۟ۘۖۜۜۘۚۡۖۘۦ۟ۧۗۧۚۜۡۜ۠۫۫ۢۚ۠";
                    break;
                case 1433474305:
                    str = "ۖۡۨۡ۫۠ۗۥ۫ۢ۠ۡۤۢۖۘۙ۬۟ۘۙۥۘۖۙ۟ۚۦۘۨۥۚۥ۬ۖۘۥۘۘۢ۠ۨ۫ۧۜۧۡۡۘۦۚۦۘۥ۬ۙۘۗۦۧۥ۠۟ۡۥۘۛۦ۠۬ۡۡ۟ۙۤ۠ۚ۠ۚۨۜۘۙۛۡۙۚۨ۠ۡۡۢ۫ۡۜ۬ۖۘ";
                    break;
                case 2033884927:
                    return;
            }
        }
    }

    @Override // android.app.Service
    public void onDestroy() {
        View view = null;
        String str = "۠ۥۙ۟ۤ۟ۚۨۘ۟ۦ۠ۚۛ۬ۗۧۢۤۥۦۘۥۢ۫ۥۙۢ۟ۦۜۘۡۖۜۦۚۢ۠ۡۦۘۤۦۡۘۥۢ۬ۙ۠ۡۥ۠ۖ۫ۧ۟۟ۘۦۘ۫ۘۛۦۦ۬ۡۥۘ۬ۛۡ۬ۦۡۘۙۚۢۗ۠ۨۤۗۖۜۡۚ۬ۗۘۥۦۖۘ۠ۥۘۘۨ۫ۖۛۧ۫۠ۢۡۨۗ۠۠ۧۘۘۢۧۧ۬۠ۜۙۖۖۘۧۘۤۥۦۨۘۖۦۗۦۤۥۘۢۜۥۘۧۛۗ";
        while (true) {
            switch ((((((((((((((((((((((((((((((((str.hashCode() ^ 489) ^ 748) ^ 516) ^ 459) ^ 321) ^ 23) ^ 328) ^ 443) ^ 620) ^ 961) ^ 694) ^ 332) ^ 20) ^ 943) ^ 357) ^ 470) ^ 430) ^ 4) ^ 29) ^ 724) ^ 876) ^ 717) ^ 302) ^ 384) ^ 569) ^ 856) ^ 142) ^ 611) ^ 140) ^ 686) ^ 804) ^ 1362669576) {
                case -1959866884:
                    this.windowManager.removeView(view);
                    str = "ۨ۫ۥۘۖ۠ۜۖۦ۠۟ۨۨۡۘۖۘ۬ۧۘ۟ۖۘ۠۬ۗۢۜۚۙۥۦ۬ۘۜ۠ۥۥۢۙۥۗ۟ۧ۟۫ۘۡۦۗۗ۬ۙۛۦۡۨۚ۟۬ۜۜۡۘۘۤ۟ۦ۫ۛۨۙۥۛۨۥۙۥۗۡۘ۬ۡۢۨۢۜۥ۟ۜۚۦۜۘۢ۫۟ۜۦۘۗۗۗۦۥۥۚ۠ۜۗ۫ۤۜۚۙۥۚۘۨۦۜ۠۠۠ۖۜۘۗۚۙۘۢۦۘ۟ۚۡۥۗۖۘ";
                    break;
                case -1509049207:
                    view = this.mainView;
                    str = "ۛۤۚۘۢۧ۫ۙۡۘۙۙۗۢۨۙ۬۟ۚ۠۟ۢۗۛ۟۬ۜۤۡۧۛۚۨۦۜۧۗۤ۫ۙۜۨۘۦۚۡۘۙۙ۫ۨۜ۫ۙۡۛۢۘۗۜۢۤ۬ۥۘۧۖۛۚ۟ۨۛ۫۠۟ۖۢ۫ۧۗۤۨۗۙۛۖۘ۬ۖۧۖۘ";
                    break;
                case -1343550627:
                    str = "ۙۨ۟ۧ۬ۘۘۤۦۜۘۘۧۙ۫ۙۤ۟ۘۡ۬۫ۘۖۦۖۘۦۧۚۜۦۦۥۚۡۘۨۖۦۛۤ۬ۘۡۘۘۛۖۘۜۤ۬ۗۤۙۜۚۘۘۦۢ۠ۡۗۨۥۚۢۜ۠۟ۖ۬ۡۘ۟ۗۧۦۢۖۗ۠ۖۢ۫ۨۘۜۛۛۤۖۥۜۡۨۘۚۛۜۘۤۜۛۛۚۨ۠ۡۧۧۗۢۚۗۨۢۡ۫ۙۗ۫۫۬ۛۡۘ";
                    break;
                case -576336876:
                    String str2 = "ۧۖۖۢۗۡۚ۠ۙ۬ۢۨۤۛۡۘ۫۬ۢۖۦۦۗۨۧۘۚۗۢ۠۬ۨۘۦۛۜۘۛ۠ۥ۠ۢۙۘ۫ۛۢۡۨۛۤۡ۠ۧۜۘۨۤۚۤۡ۠ۧۥۨ۫ۗ۠ۢۤ۫ۡۘۥۧۖۜۘ۬ۡۖۘۖ۫۫ۤۧۜۘۖۚۨۘ۫۬ۙۡۚ۬";
                    while (true) {
                        switch (str2.hashCode() ^ 1888404601) {
                            case -1766675351:
                                str2 = "۟۫ۢۜۜۦۘۙۛ۬ۙ۫ۡۘۨۙۤ۠ۗۦۥۨۡۧ۟ۥۥۘۧۘۚۨۦۧ۠ۚۤۧۖۘۥۚۛ۬ۤۜۘۧۖۨۘ۬ۤ۟ۥۙۖۘ۫ۥۜۘۧۗۙۗۗۙ۬ۥۘۚ۠ۡۘۤ۠ۙۘۦ۟ۦۧۚۢۡۗۧۨۘۢۛۖۙۦۙۢ۠ۜۘۚۦۡۘۜۛۛۜۚۘۤۥۜۘ۟ۤۘ";
                            case 76858219:
                                str = "ۖۘۖۘۦۖۥ۫ۚۜۘۦ۠ۢۨۥۘۛۤۚ۠ۖۢۛ۠ۙۧۨۖۖۚۜۗ۠ۜۙۘۥۧۘۦۨۖۘۙۖۧۥۙۖۙۦۧۘ۫ۛۧۥ۬ۛۜۙۥۘ۟ۥۖۘۧ۫ۙۨۗۡۦۤۢۡ۬ۡۤۨ۬ۖۧۦۘۤۥۡۘۡ۬۠ۢۛۜ";
                                continue;
                            case 1418886349:
                                String str3 = "ۨۖۨۘۙۦ۟۫ۚۨۚۘۢۥ۬ۜۘۚ۬ۨ۟ۖ۫ۦۧۖۤۙۗۙ۫ۖ۬ۙۢ۬ۥۜ۟ۜۡ۬ۜۤ۬ۗۤۗۘ۟۫ۧ۟ۥۜۙۤ۬ۨۛ۫ۘۛۢۢ۠ۡۨ۟ۡۥۘ۠ۡۤ۬ۤۤ۟ۜۜۛۧۨ۟ۗۥۡ۠۬ۙۜۨۘ";
                                while (true) {
                                    switch (str3.hashCode() ^ 663802766) {
                                        case -1933336331:
                                            String str4 = "۫ۥۤۙۚ۠۬ۤۡۘۤۦۚۖۛۥۘۦۖۜۜۦ۠ۦ۫ۥۚۦۖۘۡ۟ۨۚۢۨۘۡۘۧ۟ۛۡۘۖۦۡۘ۬ۦۜۙ۫ۘۚ۬ۧۛۜۖۘۖۘۢۧۨۘۘۦۘۖۦۗۦۜۚ۫ۤۘۥۦۦۢۨۥۘ۫۠۫ۙۚ۬ۤۤ۠ۦ۫۟۬۠ۦۘۘۜۖۘ۬ۢۥۡ۬ۤۘ۬۟";
                                            while (true) {
                                                switch (str4.hashCode() ^ (-1825468999)) {
                                                    case -117144422:
                                                        str3 = "ۡ۠ۙ۠ۙۦ۬ۖۢۚ۬ۧ۟۟ۘۘۤ۬ۜ۟ۤ۬۠ۛۜۘۨۦۚ۬ۚۦۘۦ۫ۗۜۢۨۘۚۛۜۘۖۨۢ۠ۡۖۘۙۛۡۘۤۛۗۢ۫ۢۥۥۥۘۧۢۤۖۥۚۚۧۨۨ۫ۥۘۗۛۦۘۤۨۢ۟۟ۛ۟ۧۨۘ۫۬ۜۘۤ۟ۨۤۨۛۛۘۨۧ۬ۜۘ۬ۢۙۢ۫ۜۡۦۡۘۘۥۥۨ۟ۘۡۧۘ۬ۗۜۛۤۛۧۖۘۖۥۨۘۧۢۖۘۤ۫ۥۘ۠ۤۖۘ";
                                                        break;
                                                    case 27925650:
                                                        String str5 = "ۤۙۙۨۥۨۘۤ۬ۨۙۤۨۖۙ۟ۙۖۜۘۖۖۡۘ۠۠ۘ۫ۙۥۘۚ۬ۡ۬ۨ۟ۛۚ۬۬ۖ۬ۙۡۢۘ۟۬ۙۘۘۢ۟ۨۗۘۢۙۦۧۗۡۧ۟ۛۢۙۨۘۛۙ۫ۖۢۖۗ۬ۥۘ۠ۜ۬ۚۘۗۗۚۢ۟ۚۜۖۡۨۧۧۥۡۥ۫۠ۜۘ۠ۧۨۥۗۖۘ۫ۗۤ۟۫ۖۘ۠۬ۥۚۜۦۘۥۢۜ";
                                                        while (true) {
                                                            switch (str5.hashCode() ^ (-1462244921)) {
                                                                case -1263297733:
                                                                    str4 = "ۨ۫ۙۘۜۧۘ۟ۗۥۘۦۨۘ۫ۖۡۚۦۤۥۤۜۡۜۘۖۤ۟ۧ۬ۗ۫ۧۜۧۙۜ۬ۜۗۛۚۘۤ۫۠۬۬۬ۦۨۨۜ۟ۨۘۦۨۜۚۨ۬ۧۗۡۙۥۖۘۥ۟ۦۡۢۘۘۗۡ۬ۛۙۨۘۖۤ۟۠ۗۖۙۙۗۛۜ۫";
                                                                    break;
                                                                case -677885007:
                                                                    String str6 = "۫ۥۨۚۜۤۙۤۖۦۨۛۥۤ۟۫ۙ۠ۙ۟ۖۘ۠۬۟۫ۦۘ۠ۡۥۙۦۦۘۗۦ۬ۢۚۗۙۚۜۘۧ۠ۗۡۥۦ۬۠ۘۘۨ۠ۦۘۧۖۜۘ۠۬۟ۗۛ۬ۗۥۢۛۜۦۘۤۥۢ۠ۢۜۘ۬ۨۗ۫ۦ۫۫ۘ۟ۙۧۢ۫۫ۙ";
                                                                    while (true) {
                                                                        switch (str6.hashCode() ^ (-974996635)) {
                                                                            case -2118311959:
                                                                                str6 = "۠ۜ۟۫ۡۖۚۧ۟ۨۤ۬۫ۨۥۘ۠ۗۡۨۡۘۘۤۤۥۚۦۘۛۚۖۘ۠ۗۨۘۗۡۧۜ۠۬ۖۨۧۘۤ۟۠ۢ۫ۖۧ۫ۚ۟ۦۜۘۨۢۡۧۘ۠ۤ۟ۗۗۤۧۘ۫ۛۢۧۜۘۘۗۦۦۨۧ۬۬۠ۧ۬ۢۖۦۧۘۛۙۖ۫ۘ۬۫ۙۥۖۗۥۘۥۦ۠ۖۢۖ";
                                                                            case -1473139127:
                                                                                str5 = "ۗۦۢۨۖ۫ۤۚۙۦۗۡۘۖۥۙۘۢۡ۠۬ۨۜۚ۠۟ۡۖۦ۠ۤۜ۬ۜۥۛۘ۫ۙۧۦۘ۟ۚۡۘۦۜۗ۬ۡۖۘۢۘۗۗ۠۬۟ۛ۠ۨۘۜۛۜۘ۠ۖۖۜۜ۠ۦ۫ۖ";
                                                                                break;
                                                                            case -789116567:
                                                                                str6 = view != null ? "ۤۛۧۙ۫ۙۗۡ۫ۡۨۡۘۥۢۡۘ۠۟ۤ۫۠۬ۢۧۛ۫ۖۜۙۛۨۦۘۙ۫ۙۤۚ۟ۢۦۧۘ۟ۦ۟ۛۡۦۧۤۙۥۦۗۛۛۢۨۜۘۥۛ۠ۤۤۢۦۙۖ۠ۨۘۥ۠۬ۜۙۖۘۥۘۙۢۘ۟ۢۚۙۡ۫ۘۘۚۚۖۘ۫ۧۥۘۨ۟ۙ۬ۢ۬ۙۙۘ" : "۫ۡۖۘ۟۬ۘۡۙ۟۫۫ۦۘ۫ۚۜۘ۠۬ۜۛۙ۫ۨۘۘۘۛ۫ۨ۠ۧۧۙۜۗۙۦۙۧۦ۠ۤۤۙۘۗۜ۫ۥۚۤۗۧۖۨۚۡۙۖۘ۫ۗۛۘ۟ۡۙۡۘۤۗۥۘۡۘ۫ۙۢۡۧۜۧۘۖۤۜۥۥ۬ۗۛۙ۠ۛ۫ۨۚ۟ۧۖۗۦۘۦۘۙۨۦۘۜ۠ۤ۫ۧ۬ۚۚ۫ۨ۫ۢۛ۫ۖۘۨۢۖۨۘۗ۬ۥۨۙ۬۬ۧۥ۫ۥۡۥۘ";
                                                                            case 1158668431:
                                                                                str5 = "ۜۡۨۗ۫ۗۦۧۘۦ۫ۘۦۤۤۢۛۜۘۚۧ۫ۚ۠ۘۤۗۛۨ۠ۖۘۖۖۨۢ۫۠ۜۜۛۢ۠ۛۤۛۚۜۨۡۤۥۢ۠۬ۘۦ۠ۤۦۧۦۤ۠ۤۗۧۖۤۜۛ۫ۜۛ۠ۥۘۘۜۙۦ۫ۘۜۚۛۘۤۘۨۧۚۤۜۦۘۚۥۦۨۢۚ۟ۜۜۡ۟۬ۡۤ۫ۨۘۘ۠۫ۡۨۢۛۙۗۧۙۘۘۦۛ۠۠۫ۘ۠ۙۨ";
                                                                                break;
                                                                        }
                                                                    }
                                                                    break;
                                                                case -676001288:
                                                                    str5 = "ۥۢۛۘۡۘۥۥ۫ۗ۬ۙۜۜۥۤۚۥۦۢۘۖۜ۟ۜۥۘۨۘۦۦۥۖۨۡۘۗۖۘۘۚۛۖۘ۠ۛ۟ۡۘۧۘۛۤۥۘۢ۫ۙ۠۬ۥۘۢ۠ۦۚۧۛ۠ۜ۠ۚۜ۟ۙۨۘۡ۫ۚ";
                                                                case 1371163560:
                                                                    str4 = "ۤۖۚۚۜۥۘۙۘۗ۬ۜۚ۠ۛۜۙ۫ۜۨ۠۟ۚۥۜۡۥۘۥۗۙۨ۬۫ۦ۬ۙ۠ۧۗۚۧۛ۫ۚۜۘۜۖۥۨۘۧۡۚۖۘۤۜ۠ۦ۠ۡۘۡۤۖۘۗۨ۟۠ۦۧۡۙۖۡ۠ۦۘۙۙ۠ۙۚ۫ۢۘ۟ۨ۬ۛۧۧۜ";
                                                                    break;
                                                            }
                                                        }
                                                        break;
                                                    case 1311476876:
                                                        str4 = "۬ۖ۬ۤۘ۬ۡۢۗۡۦۘۡۛ۠ۗ۠۟ۘۖۨۘ۫ۥۢۜۡۘۨۗ۟۫ۛۦۘۜۤۖۥ۟۫ۧۜۡ۠۫ۙۦ۫۠ۘۦۦۘۗۜۘۘۦ۫۟ۖۙۘۘۜۤۘۚۦ۟ۨۦ۟ۤۦۚۨۗۖۘ";
                                                    case 1338080353:
                                                        str3 = "ۧ۟ۧۢ۠ۡۘ۫ۨۥۘۡۢۚۗۨۘۢ۫ۜۘۡ۟ۛ۫ۗۦۘۤۛۨۚۨۘۘۡۦۧۘۡ۟ۗۤۤ۟ۤۗۜۘۨۙۨۘۢۦۨۧۖۦۘۧ۬۟ۡ۠ۦۛۧۦۘ۫۟ۛۗۖۤۗۖۜ۠ۛۡۘ۟ۚ۫ۖۨۘ۠۠۠ۤۢۤۜۖ۟ۙۙ";
                                                        break;
                                                }
                                            }
                                            break;
                                        case -1509944101:
                                            str2 = "ۤۙۘۥۗۚۜۨۧۚۜۥۖ۬ۧ۟ۖۧۢۢۢ۟۠ۨۘ۠ۡۗ۟ۘۖۘ۟۫ۡۘۨۤ۠۬۠۟ۙۗۛۚۢۨۨ۬۠۬ۧۥۘۥۤ۬ۥۜۘۚۜۙۘۨۨۘۜۤۘۘۘۥۤۜۚۢۤۗۜۚۧۛ۬۟ۤۨۘۦ۬ۜ۫ۘ۬ۘۘۚۜۥۢۨۡۥۗ۠ۨۨ۬ۦ";
                                            break;
                                        case -1334853985:
                                            str2 = "ۗۡۘ۟ۖۘۥۧۛ۬ۙۖۘ۠ۥۡۘۚ۫ۦۚۧۛۧ۠ۡۘ۫ۥ۫ۜۦۨۘ۬ۧۘۖۛۖۘ۫ۨۗۚۤۘۘ۠ۜۨۖۖ۠ۚۖۗۨۖۗۘ۫ۖۤ۬ۜۙ۟ۦۘۧۙۢۤۡ۠ۨۧ۠ۖ۫ۛۤۥۘۗۛۙۖۘۖۘۘۤۡۘۤۘۜۙ۫ۛۦۧۙۢۥ۟۠ۖ۠ۚۘ۠۟ۢ۫ۗۦۜۗۗۛۙۛ۟ۢۨۥۡۤۛۚۤۖۡۨۙ۫۟ۢۖۖ";
                                            break;
                                        case 1046110345:
                                            str3 = "ۙۥۘۘۡۚۖۧۚۙۨۗ۟۬ۙۤ۟ۦۛۙۤۦۜۛ۠ۜۛۛۗۛۧۖۘۚۜۥ۟ۜۥ۫۠ۢۨۗ۠ۚۦۖ۠۬ۨۨۘۡۦۜۘۤ۠ۙۡۘۖۧ۫ۗۛ۬۠۟ۚۗۛ۬ۜۗۘۛۨۘ۟ۗۨۧۙۥۢ۠ۡۘۙۘۨۧۛۘۢۥۧ۟ۦۡۘۥۤۜۘۗۘۤۛۨۛۗۛ۟ۚۦۗۜۙۡۘ۫ۡۚ";
                                    }
                                }
                                break;
                            case 1477264011:
                                str = "ۨ۫ۥۘۖ۠ۜۖۦ۠۟ۨۨۡۘۖۘ۬ۧۘ۟ۖۘ۠۬ۗۢۜۚۙۥۦ۬ۘۜ۠ۥۥۢۙۥۗ۟ۧ۟۫ۘۡۦۗۗ۬ۙۛۦۡۨۚ۟۬ۜۜۡۘۘۤ۟ۦ۫ۛۨۙۥۛۨۥۙۥۗۡۘ۬ۡۢۨۢۜۥ۟ۜۚۦۜۘۢ۫۟ۜۦۘۗۗۗۦۥۥۚ۠ۜۗ۫ۤۜۚۙۥۚۘۨۦۜ۠۠۠ۖۜۘۗۚۙۘۢۦۘ۟ۚۡۥۗۖۘ";
                                continue;
                        }
                    }
                    break;
                case -465565067:
                    this.checkStatus = false;
                    str = "۫۟ۢۨۡۜۘ۬۬ۦ۠ۨۥۘۧۧۥۚۢۦ۬ۚۚۘۗ۫ۚۛ۠ۧۤۜۗۧۤۡۖۘۙۛۘۘ۬ۢۖۘۗ۫ۥۧ۬ۦۘۧۦۥ۫۫ۥۘۦۢۖۘۢۢ۫ۤۜۘ۬ۙۧۦۜۦ۟ۡۘۙۢ۫۠ۡۖۚ۠ۚۘ۟ۤ۟ۜۤۚۘۡۜۧۘ۬ۧۛۗۨۨۨۙۡۨۡۡ۫ۖۦۥۗۖۜ۫ۦۘ۟۠۫ۦۨ۬۬ۚۖۚۧۨۚ۬۫ۦۢ";
                    break;
                case -151568918:
                    super.onDestroy();
                    str = "ۜۧۚۗۘۙۙۦۚ۬۟۟ۤۗ۫۠ۤ۠ۥۤۦۘۥۦۙ۫ۦۖۤۖۨۘۢۢ۟۟۟ۦۧۢۡۘۚ۬ۡ۟ۖ۟ۚۥۨۦۙۜۘ۫ۖۥۘۗۘۘۛۥ۫ۤۚۧ۫ۢۧۡۦۜۘۜۥۛ۬۬ۙۗ۫ۘ۠ۛۗۨ۠۠۠۬ۡۘۧۙ۬ۘ۬ۢۧ۟ۦۜۗۛ۟۬ۚۗۘۧۙۙۥۦۘۙ۫ۦۘۦۤۘۘۤ۠ۘۘ۟ۚۖۘۨۛۨۙۦۗۜۨۘۧۤۘ";
                    break;
                case 603484407:
                    return;
                case 1640565838:
                    ToggleAim(false);
                    str = "۟ۜ۟ۗ۠ۛۚۘۢۦۢ۠ۙۖۘ۟۬ۗۨۖۙۜۛۗۖ۠ۖۘۙۗۗۥۙۡۘ۠ۘۨۙۧۦۘۘۤۖ۠۠ۖۘۙۘ۬۟ۦۜۘۦ۠ۗ۟۠ۡۘۡۢۗۨۢۗۙۖۨۜۧۘۘۚۦۙ۬ۘۘۥۡۗۥۛ۬ۜۡۡۥۢۘۘۘۜۚ۟ۧۡۘ۫۠ۥۘۤ۫۠۬ۘۘۘ۬ۜۖۘ";
                    break;
            }
        }
    }
}
